{"fXqFWTGU-_s": "This video is all about full spectrum CBD oil benefits What is full spectrum CBD oil and why is it better than regular CBD oil? Check it out. Hey guys My name is Johnny Ross. I am a student at the University of Kentucky right now And I just did some research on CBD so that you don't have to if anything in this video is helpful for you I would really appreciate it if you would stop by my subscription button over to onder and Smack it maybe leave a comment leave a like if you don't like it. Let me know why share the video Don't forget to stay to the end because there is CBD there so full spectrum CBD oil is a type of CBD oil So if you're not really sure what CBD oil is in general, you can check out the video in the card above Basically CBD is one of 104 cannabinoids which are chemical compounds found in the cannabis plant These cannabinoids are particularly Medicinally useful for things like pain recovery mental clarity Inflammatory relief depression and anxiety relief and a ton of other cool stuff CBD is really helpful for humans full-spectrum CBD oil is CBD oil that has been extracted from the cannabis plant which includes all of the chemical compounds that the plant produces this includes terpenes flavonoids cannabinoids fatty acids and even THC when you extract all of the compounds from cannabis in Context of each other. They're more beneficial for you therapeutically Did you say that was th seed that now I did say there's THC in there Some people want THC free oils and that's totally understandable but a lot of times the THC content in a Seabee full-spectrum CBD oil is actually Point 3 percent or less so it's a trace amount of THC at best and it's not going to get you high You're not gonna feel any of the effects of that but it is going to help with the context of all the medicinal benefits that all the cannabinoids terpenes and flavonoids have for within that CBD or full-spectrum CBD oil is different from broad-spectrum CBD oil and CBG isolate exactly as it sounds is 99.9% CDD it usually comes in a powder looks a little bit like cocaine, but it's not cocaine It's CBD. It has wonderful healing effects for you but you do put it on your gums or under your tongue broad spectrum CBD oil is a CBD oil that has been doctored to contain many of the cannabinoids terpenes or flavonoids But they are usually select by whoever's mixing them or producing them and very generally speaking Broad-spectrum CBD oils and never have THC not even a little bit So you might ask why should I care? because full-spectrum CBD oil is actually clinically proven to be more beneficial for you than CBD isolate or even broad-spectrum a study that I'm going to put in the link in the description compared CBD isolate effectiveness to Full-spectrum effectiveness, they found that CBD was producing anti-inflammatory and anti What when they increase the dose there was a drop-off in the effectiveness they then remedied this by adding CBD to a full plant extract full-spectrum CBD and the dosage and effectiveness both rised together so like I was saying CBD in the context of all of the chemicals that the plant cannabis Produces is more effective than CBD itself, and I just wanted to show you guys this it's not Super relevant, but it is relevant. There's a website that has a terpene slider so you can go see what effects you want And then it will tell you what terpenes and flavonoids that you should get in your oils That's pretty freakin. Cool cannabis has over 400 known chemical compounds that it produces the majority of medicinal benefits come from cannabinoids like cannabidiol and THC terpenes and flavonoids also have medicinal benefits, but they're not unique to cannabis A lot of essential oils are actually made from terpenes and flavonoids These chemical compounds are generally responsible for the way that a plant or oil smells or tastes Flavonoids are more responsible for the things but pigmentation as well So what colors are in your plant because full-spectrum CBD oil comes from a certain plant. It is actually very important to know what strain your CBD oil is coming from so You know what specific medicinal or therapeutic properties that you're getting in that oil because it's relevant to the genetics of the strain of cannabis That it came from that's what I got for you guys today except for one more thing Which is a link in the description to get some broad-spectrum CBD oil from a veteran-owned American company that sells CBD called pure American hemp oil Try them out first link in the description below and generally thank you guys so much for listening once again I appreciate your time. If you appreciated this time with me that we spent together just now intimately consider subscribing consider leaving a comment nasty or nice doesn't matter and leave a like or just keep watching different videos on my channel because they're interesting and maybe they would Benefit you Thanks for watching guys. Peace If you're not really sure what CBD oil is you can watch this video right here click the card above and Eat my the majority of medicinal benefits come from cannabinoids like cannabis can it be debited can't cannabidiol and THC", "dBjFJRXboI8": "Marten Carlson: Hey guys, Marten here from\nMattress Clarity. Today, I'm reviewing the Populum Full-Spectrum\nHemp Oil. You've probably seen online a lot of videos,\na lot of articles about CBD oil. I want to talk a little bit about the science\nbehind that. I want to talk about the Populum here, my\nexperience with it, the benefits I felt, and some other things to consider. Let's get started. [music] Marten: I want to talk about the science behind\nCBD. First I want to say, if you want to see a\nlist of my top picks for CBD oil, Google Mattress Clarity best CBD oil. What exactly is CBD? It stands for Cannabidiol. It is a phytocannabinoid, a compound found\nin Cannabis sativa. One of the other phytocannabinoids which we're\ngoing to find in Cannabis sativa is THC. While THC is going to have some stony properties,\nit's going to give you that more of that high feeling, you're not going to get that feeling\nwith CBD taken from hemp plant. While THC is illegal in many states, CBD oil\ntaken from hemp plants is legal in all 50 states. Definitely keep that in mind. In terms of what exactly CBD can help you\nwith, while it's not going to give you that stony feeling, it can help with anxiety, nausea,\nand inflammation. Last but not least, it can help with sleep. As a person who deals with anxiety and that\nhas sleep issues, that's why I want to try out CBD oil. I want to know why you're interested in CBD\noil? Is it to help with your sleep, help with your\nanxiety, or for some other reason? Leave your answer in the comments section\nbelow. I want to see what everyone has to say. Now let's look at the Populum. Before I talk about the Populum, I do want\nto say I am not a doctor. If you're considering adding CBD to your medical\nregimen, or your sleep regimen, do talk to a medical professional. With the Populum here, you're going to have\nthree options -- 250 milligrams, 500 milligrams, and 1,000 milligrams. For the potency I went with a 500-milligram,\ntheir most popular potency. What exactly is in here? First off, you're going to have your CBD oil. This is a full-spectrum hemp oil. While some are going to be CBD isolates, some\nof those competitors are going to get only CBD oil, this is full spectrum. It's also going to have some other phytocannabinoids\nthat naturally occur in hemp plants. In here as well, you're going to have some\nphytocannabinoids such as CBG, which is also going to help with nausea and have anti-inflammatory\nproperties. In addition to that, you're going to have\nsome terpenes. Terpenes are essential oils found in the hemp\nplant, and those are going to have properties. They're going to help with the flavoring,\nalso give you some more sense of well-being. In here, you're also going to have hemp seed\noil, grape seed oil, coconut oil, and cold-pressed orange oil. There's a lot in this bottle. These extra elements are going to help with\nflavoring, also going to have some amino acids, help with your metabolism and your immune\nsystem. There's a lot in here. If you want to know exactly what's in this\nmodel, don't worry. Every bottle is going to come with your lab\nresults. You're going to know exactly what is in this\nbatch of CBD oil. It's also a third-party tested. While it's not FDA approved, you know exactly\nit's in this bottle. It's tested for quality and effectiveness. How do you use the Populum? It's very, very simple. You first, unscrew the top here, and it's\ngoing to be a dropper. In terms of how much you want to fill it with,\nit does depend on how long you've used CBD oil for. If you're just getting started, Populum recommends\nusing 8 milligrams to 8.5 milligrams. This is the 500-milligram potency so it's\ngoing to be about a half a dropper. Once I have that, I put it under my tongue\nand then squirt the liquid under my tongue. I'll leave it in my mouth for 30 seconds. They also recommend you can work the liquid\non your cheeks with your tongue. After the 30 seconds, take two deep breaths. You can drink down the liquid and you're good\nto go. Let's talk about my experience with the Populum. I'm going to break that down into three sections\n-- falling asleep, staying asleep, and then the morning after. In terms of falling asleep, this worked very,\nvery well for me. I took it for a few weeks. Every night before bed when I'm watching TV,\nI would take this about 30 minutes before bed, and it definitely calmed me down. My anxiety was less and I deal with anxiety. Before bed sometimes it was hard for me to\nfall asleep. With the Populum, I definitely fell asleep\nmuch more quickly. In terms of staying asleep, I slept through\nthe night with no problem. However, that's not usually a big issue for\nme, staying asleep, so take that into account. But it did not negatively affect my sleep. The morning after, that's where I had some\nissues with the Populum. Waking up, I did feel a little bit groggy,\na little bit washy as I'm started out my day at work, out of it a little bit, having trouble\nfocusing. I will note this is my first time using CBD\noil. I lowered my dose over the next couple days. It did seem to work itself out. But keep that in mind, if you're just starting\nto use the CBD for yourself. Let's talk about some of the pros and some\nof the benefits I experienced using the Populum. First off, it made it easier to fall asleep. If you're looking for a CBD oil to help you\nfall asleep more quickly, definitely ease you down into a nice state of relaxation before\nyou sleep, take a look at the Populum. Also, if you want something to help you stay\nasleep all night, the Populum worked for me in that respect. If you want to sleep throughout the night,\nthe Populum could also work for you. I'm also a big fan the fact the Populum is\nfull spectrum. You're not just getting a CBD isolate, you're\nalso getting other phytocannabinoids. You get the full effect of the hemp plant\nwith this full-spectrum hemp oil. Lastly, speaking about the third-party testing,\nI like the fact they bring in outside scientists to come in and test this product to make sure\nyou get the best quality, the best effectiveness with the CBD oil. Let's talk about the cons. Some of the things you might want to consider\nif you're looking at the Populum. First off, I experience some morning grogginess\nthe next day. If you want someone's going to help you wake\nup clear-eyed and refreshed, the Populum might not be the best match for you. Keep this in mind. If you're looking for something with a lot\nof potency options there are only three with the Populum -- the 250, the 500, and the 1,000-milligram. Some other companies are going to have five\nor six options, so more options for you in terms of potency. Also, this CBD oil is not FDA approved. That's not necessarily a con for the Populum\nbecause most CBD oils are not FDA approved. But keep this in mind if you're going to add\nthis to your medical regimen. Lastly, in terms of price, right now it's\n$99 for a bottle for the 500 milligrams. That is very affordable for a CBD oil, but\nif you're comparing this to other sleep supplements, it might be on the pricier side. In the end, I enjoyed my experience with the\nPopulum. It helped me fall asleep more quickly, stay\nasleep, very much a nice experience overall. I will just note, if you're looking for something\nto have you waking up feeling more refreshed, you might want to look elsewhere. That's about it. If you're just getting started looking for\na mattress or other sleep products, do check out mattressclarity.com. We also do a lot of videos like this in Mattress\nClarity, so hit the Like button and Subscribe.", "MlKEp5kFqss": "row row row your blood fool the CVB break it down roll it up line it up hit it no more is 8800 work you know what I just realized I'm not rolling a blunt today well I'm not running a blunder in this review I'm still going around a bluff fool to CBD break it up light it up he didn't know more as IDE my bow ties crooked what up um welcome to smoking legal or if you've been here before then welcome back to smoking legal that means you know how we do we're gonna review a couple of things we're gonna have lose each other down in the comments and we're gonna have a nice warm and open conversation before I go any further please forgive me how could I be so rude let me introduce myself I go by the name tears and our review [ __ ] mainly um and today today we have a product that I really really enjoy I'm gonna do a lot more reviews this year on things other than just the actual flower I'm gonna review a lot more CBD products and one of my favorite CBD products is tincture this right here is a honey lemon tincture it's 1500 milligrams and it's full spectrum CBD that you take a look at it this comes from let me get Michael let me get my influence at home and this how'd I do it oh yeah oh yeah it's the ozone Oh close close close Oh that's right sue me it's coming from Monroe farms it says to suggested for best results is to drop under tongue and hold for about 30 to 60 seconds one milliliter equals 50 milligrams of CBT the ingredients are MCT or derived from organic coconuts also help extract organic flavor organic stevia leaf extract extract of honey and lemon it's an all around the product it says that it's about you got to get about 30 servings per container um I like this product a lot mum reforms has great tincture see what I reached out to them and I ordered some one of the latest said they're not too proud of the bottle itself per se I don't think it's nothing wrong with it you know it's a bottle of tension but hmm almost [ __ ] some [ __ ] up it's a bottle of teacher I'm more into what's inside the bottle to see if it's actually gonna do me any good I've lived with this product for about a week now it's amazing for me you're not always gonna be in a situation to where you have access to be able to smoke the flower although I do think that smoking gives you the benefits and effects of the CBD the fastest tincture is excellent I use it throughout my workday and I'm sure that goes so you guys I got a one milliliter of it you see how it has just up that's like oh [ __ ] him it has a slight color to it so you're gonna put it up on your top [Music] now I'll put it up on the tongue you can still taste it I'm gonna do it another little jump on top of the tongue so I can just give you a little straighter flavor profile the honey is it's prevalent it's in the forefront you can really taste that honey I like honey hence the reason I really like this lemon honey tincture the lemon profile the lemon is there too but it's light it's not as strong as the honey is in it and with tincture I for me I found that it usually takes about 10 minutes maybe 5 to 10 minutes to kick in some people said 15 minutes there's just so many benefits from it everyone just can't smoke period everyone is not gonna be able to enjoy that CBD flower like that I have a friend who I gave a bottle of tincture to and she uses it she uses it for headaches she said it has done amazing things for her for her when she gets headaches you take some of the tincture and before you know it her headache is gone she also told me ladies she also told me that she uses the tincture for cramps she gets very very bad cramps and it just has her bent over sometimes so she'll use though she use the tincture for the cramps my aunty who is a she had a tumor removed from the back her neck she uses the tinctures she actually prefers the tinctures over prescribed medication I'm not trying to influence nobody in that way I'm just sharing the story of what my auntie does she swears by this CBD tension she swears by it she swam back she swept back I get it oh she swears by it it's been about three or four minutes and I can slow this off feel the effects coming in um it's it's gonna calm you down it's great for me it's great for my anxiety I can what I really like to do is I can have a meeting or something at work or if I'm going to be the client sometimes it you know stressful situations can cause that anxiety to kick in or or because that nervousness to kick in so I found that by taking the tension that it really helps settle that anxiety settle those nerves a little bit so that I can walk into that meeting confidently so I can meet that client confidently I can take this I can stand up in front of a group of people and talk fluidly and not be nervous I like the 1500 milligram there's a thousand milligram there's 1500 and I believe Monroe Farms also has a 3,000 milligram I've never tried the 3000 I want to know I want to try the 3,000 milligrams because the 15 milligram the 1,500 milligrams it usually I usually do - I'm not gonna lie I'll do one in front of the time I'll wait about 15 seconds let that kick in and then I'll do another one I'll do that one on top of the tongue and I won't even wait for that I'm gonna be honest I'll just go ahead and swallow it because I just feel like it's gonna kick in and I really like the 1500 I like the taste of the tinctures I really like the ease of access to them because even if you want if you don't want to just be doing drop something depending on the flavor of your Oh your tincture I like to add a droplet fool in my coffee I also drink a lot of water during the day I took a lot of water and what I'll do is I'll get my bottled water and I'll put me two or three drops in that bottle of water because I'm gonna be drinking on it so why not be getting me some CBD at the same time that's true it is it's kind of oily so it kind of sits on top of when you shake it up it's a little bit uh oil droplets other than your water it looks it can look kind of funky it can look kind of funky bleed bulid oh it's really really good like I like it a lot so I put it in my water and Monroe one wrong hemp is that they have good products I haven't I haven't had a strand of flour from them that I didn't like this is my very first tincture from them and like I said I've been having it for about a week living with it using it on a daily basis and I really enjoy it I plan on keeping me a bottle of it on hand I like to have it not only for myself but I like to have it for others around me that would like to try CBD and they're just not gonna smoke it so you know if I have with me and work and a co-worker's has a headache or putting them a little anxiety coming on I just wish they could relax a little bit I'll give them some of my teacher I'll [ __ ] with them and it's kind of like a it's kind of like a nice open door kind of open up to the CBD world because once you see how good the tincture works you'll be ready to try all the products um it's kicking in I feel good it's a it's a calming feeling that comes over you from the tincture and it's just it just really settles your nerves it really sells in there's man Oh show it to you one more time this is like I said this is the lemon honey I can't get this damn camera to work but I can't oh I called it that time without hitting the island kudos to me be kudos someone something that doesn't mean a lot to you can mean a lot to someone else like war right dark and hitting that like button if you want to be in the gang gang gang okay that nobody gang hit that notification bill shut up see I appreciate you double salut mmm to the note again hmm you could be anywhere in the world right now but to you with me and I appreciate that I want to thank are you guys for coming and being a part of this channel I have to show one more time you can see if I can give because you - I don't know how they get their thumbnails or what goes on but let me see if I can get this to be my thumbnail not working though maybe what's up a physical what is it gonna work no no but anyway 1500 milligrams CBD tincture full-spectrum CBD from Monroe heeeeelp company unique until next time you know how we say I'm smoking legal keep it positive or keep your [ __ ] keep it positive or keep it pushing oh wow", "5Rg_5CS9PSs": "hey guys today we're going to review the relief and relax cbg oil by cbd distillery i'm tomas and i'm jess and we're with best dosage so today we have a little bit of a different product we have cbg oil which also this product also has cbd oil in it it is a one to one ratio so you get this whole bottle has 500 milligrams of cbd oil and 500 milligrams of cbg oil and with each serving you get 17 milligrams of cbd oil and 17 milligrams of cbg oil so before this we found this product we both didn't know much i didn't really know a whole lot about cbg but this definitely turned us on to it yeah we found this product and let's read a little bit about cbg oil so on this box it says cbg binds with cannabinoid receptors in our neutral system which helps to regulate your pain mood inflammation motor control nausea memory appetite pleasure and immune function so this bottle has a lot of good effects in it with cbd oil and i definitely feel like they are true yeah we definitely feel like they're true this is full spectrum cbd and cbg oil um yeah we really seem to love this product let's just try it yeah let's see a little bit how it works so first the directions you shake before use and then to open it you press this dropper in and turn so it's not super easy to open but that's that's okay and then you to fill up the dropper you press the squeezer and it fills it up and then you squeeze it under yeah when you fill it up it's a full dose and then you would squeeze it under the tongue let it sit for what 20 to 30 seconds no let it sit for 15 to 20 seconds and then you swallow so let me give you a little bit you can tell us about the flavor let's sit for a second i found the flavor to just be like just hemp flavor it's just like neutral oil oh it's salty i definitely agree it's very mild and just kind of earthy and it definitely it says on the bottle it says natural hemp flavor and i definitely agree it's very just earthy and just heavy though yeah it tastes pretty good um let's see what else it's definitely not the best taste in the world but it's really not too bad and with all the benefits that i think that it helps me with i definitely yeah it would definitely be worth it let me try a little bit of the oil too on the camera what is it pretty swallow oh it's really not bad at all you don't really taste it too much it's like a natural flavor yeah and i definitely agree the benefits are worth it for the flavor and for you know and not tasting the best it doesn't taste bad um it has the serving size listed out on here also cbd distillery's website is very easy to navigate i have it up on my phone right here we like a lot yeah we like the website super easy to use they have a lot of reviews too this product only has 19 reviews right now as we said cbg oil is just just starting out so um the product effectiveness customer experience and pricing is all five stars so very good review so far yeah um let's see robert says it's great stuff it's a great flavor and it has truly had an impact on his over overall well-being so people seem to really like this adam says it's the most effective cbd he's ever tried craig says it's an excellent product leah says i've been using these tinctures for years this new product is great i take it in the evening it definitely relaxes me more than the regular full spectrum product so i seem to be sleeping better so that's good if you've been using cbd for a while and you're you know starting to lose the effects maybe try cbg oil because it's something new and again this is a one-to-one ratio of cbg and cbd oil so we'll definitely be perching purchasing this again i feel like it's definitely been helping me sleep as well too because it just helps me relax and everything yeah just puts me really calm yeah so we'll definitely be trying this again give cbd distilleries website a look it's really easy to navigate and we really love their website so thank you for tuning in today and have a great day thank you", "HYMd4rhjF0A": "it's another beautiful day to watch another video and for me to be here with you right now I just want to talk about full-spectrum hemp oil what it is and what the difference is between it and regular CBD oil so full-spectrum refers to when the pure oil extracted from the hemp plant contains all the same cannabinoids and compounds found in the original plant cannabidiol is actually very very beneficial it makes up over 90% of the cannabinoid content in a plant it's non psychoactive and it's the main focus of the benefits of hemp oil full-spectrum hemp oil contains cannabidiol as well as everything else that's included with it so in addition to all the other different cannabinoids in a hemp plant full-spectrum hemp oil also has a great variety of essential vitamins minerals omega fatty acids flavonoids chlorophyll and terpenes health benefits of a full spectrum hemp oil go beyond just the therapeutic benefits of CBD itself the array of cannabinoids and other natural constituents and compounds that are in the entire hemp oil like the whole oil work together in what's known as the entourage effect and together these compounds all work harmoniously to magnify their therapeutic properties this mix of cannabinoids essential nutrients proteins essential fatty acids they'll work together synergistically to encourage homeostasis and balance in our health full spectrum hemp oil comes in tinctures edibles they also have like lotions and capsules available you guys might want to know like does it show up in drug tests did hemp THC is a very minor constituent and only appears in under 0.3% by dry weight so this extremely low level of THC in hemp makes the hemp oil the full spectrum hemp oil non psychoactive and safe to use for all ages and today we're gonna be checking out this brand called Veritas Farms which is a farm-to-table full spectrum hemp oil company located in Colorado they also have capsules and gummies as you guys know I have been going through a lot of anxiety lately I do have CBD oil but I'm also you know trying out different brands just to see what's different and what I like and so far various farms has been really great transparency and sustainability is really important to them they use organic ingredients as much as possible they grow extract formulate bottle label and ship all from their farm locally they are third-party tested and they also emphasize so much that they're not a CBD company they're not a THC company they offer full spectrum hemp oil which offers the benefits of the entourage effect this one is strawberry flavored but they also have a salted caramel flavor that I was interested in trying out but I wanted to go simple first so I got strawberry I just placed dropper like straight under my tongue I like using the oil tincture for immediate effects for anxiety and stress the gummies and capsules would be the best for sleep because they set in a little bit later and one more item from various farms that I really really have been loving is this full-spectrum Fido cannabinoid rich lotion and we're talking about full spectrum but CBD for sure is really really good for inflammation stress also like joint pain I've been using this on my face lately my skin has been breaking out my like bumps on my chin have been going away had these little things go on they've gotten better this has been really really good for my skin anyway that's my little talk about CBD oil versus full spectrum hemp oil if you want to learn more about full spectrum hemp oil make sure you look in the description below but now I'm going to go I need to take some of this because it's time to go wake my grandma up so I can get her all ready for the day my parents out of town I'm her caregiver for the day which stresses me out a little bit because being a caregiver is very it's really stressful and also when it's somebody that you are related to can also be I don't know it's caused me a lot of anxiety lately so I've definitely been taking advantage of this full spectrum take some of this [Music] [Music] so I really wanted to go to yoga class today at the studio but my brother I guess wouldn't be home until later so no one could take care of my grandma and it kind of life are shaded me a little that I had these plans that was really excited about because it's by a teacher that I've been wanting to go to but that like it didn't fall through and I'm really really rigid with my schedule and I get really frustrated when things don't go my way because I'm like a control freak I especially like when it's things that I'm planning for and then I'm excited for and then it just like doesn't happen for some reason and it's harder for me to be flexible which is really interesting because this morning I was reading a little excerpt from this book called don't sweat the small stuff it just lies around the house they're just simple ways to keep the little things from taking over your life so before I knew that my brother would be coming late and I wouldn't be able to go to this yoga class that I was excited about I read this excerpt said that says be flexible changes in your plans like once we get something into our mind a plan it can be tricky to let go of it and just go with the flow and it's hard for me to go with the flow is it more important to stick to my original set my rigid schedule or to go with what I planned them to be available for my grandmother is missing that yoga class worth getting upset over just because plans didn't fall through the way that they were meant to be the more general question is what's more important getting what I want and keeping my plans or learning to go with the flow clearly to become a more peaceful person you must prioritize being flexible over rigidity most of the time it's also helpful to expect that a certain percentage of plans will change if you make allowances in your mind for this inevitability then whatever happens you can say here's one of those inevitabilities in this little expert you said like you'll feel more relaxed yet you won't sacrifice any productivity you may even become more productive because you won't need to expend so much energy being upset and worried and I think that's a big thing it's like okay I need to just relax accept the fact that I missed a plan that I wanted to make today well rather than worrying about it and rather than be upset over it I could just make more plans and now I have space and room in my life in my head to just clear it out just relax and plan something better and do something else in that time I feel like this little rigidity that I have is what makes it hard for people around me to to like ask me for things or talk to me about things because I'm so rigid with my plan and I'm like me I don't want to change anything and that's what he says - it's like it'll make the people around you feel more peaceful and relaxed around you that they won't be walking on eggshells to ask about different things my mom definitely tiptoes around me because I'm just really rigid with my plans and I'm like very set in my ways and I get like upset over small things that change those plans so I don't know just a little a little tidbit instead of going to that yoga class I'm just going to do yoga outside in the Sun and enjoy it and also be present over here compromise being flexible me and although this might seem like a normal thing to most of you guys to me it's not and this is something that I personally struggle with and I hope I'm not alone on this but some of you might just be like what the heck Amanda it's just like a change in plans just go and do something else like it's not a big deal to most people but it's a big deal to me [Music]", "_KOUuNB0N9M": "[Music] what's up everybody Alex from uncanny here and today I want to talk to you about the difference between full-spectrum broad-spectrum and isolate based CBD hemp extracts [Music] I get this question all the time and it is honestly a pretty confusing topic people throw these phrases around without really knowing what they mean but today I'm gonna tell you exactly the difference between the three so first let's just talk about what this spectrum really is in full spectrum a broad spectrum and the spectrum really refers to the different compounds that are in the natural extract so when you think of a CBD oil it's not just CBD that's in that oil there's different fats there's different terpenes potentially different cannabinoids and other things that create the full picture and so in that sense a full spectrum product would be just that it has the entire full spectrum of naturally occurring compounds that are found in that extract so on the totally other side of the spectrum would be what's considered an isolate and as that sounds it's the CBD that's been stripped away and isolated from all the other naturally occurring compounds in that extract and then in the middle between an isolate and a full-spectrum extract you have the whole range of broad spectrum and as that sounds it doesn't necessarily have the full set of compounds but it has a lot of them or most of them for example at uncanny wellness we remove the THC from our products so that is technically part of the spectrum which is why we don't call ours a full spectrum extract instead it's a broad spectrum extract so it has the CBD it has the terpenes the flavonoids and all those other naturally occurring compounds in the extract a common misconception that people have is that you need THC in order for CBD to work properly there is some truth in that because THC and CBD work synergistically together but you don't need the THC for the CBD to work going off of that something like an isolate would work it just doesn't work necessarily as well as a full spectrum product so full spectrum is going to have apps everything in it as such if you remove any part of that spectrum whether you're removing the THC or even if you're distilling down and concentrating what's in the extract you're getting into the territory of broad spectrum so really most of what's out there in the market is gonna be a broad spectrum and not a full spectrum because full is just a very absolute phrase and as a natural result of the processing and extraction and refinement in to that final product form you do lose certain parts of that spectrum another important thing to understand is that the spectrum a full spectrum broad spectrum directly relates to what's known as the entourage effect and the entourage effect basically says that when you have CBD in conjunction with the other naturally occurring compounds that it's usually found with it has a greater amplified effect versus an isolate which is just CBD has no entourage has no other components of the spectrum and is less effective than a full or broad spectrum product so you can kind of think of it like there's more entourage effect happening the more full the spectrum is and as you start taking things away you're removing naturally-occurring compounds from that spectrum you're losing members of the entourage and over time you go all the way to an isolate format which has no entourage effects happening whatsoever the nice thing about a broad spectrum extract is that you can do something like THC removal which is what we do and that's nice for people that may have to get drug tested or just don't want any trace THC in their system or maybe they want to give it to their kids or a pet or they're a pilot or any reason like that they can still enjoy the benefits of the entourage effect and of a broad spectrum CBD extract without having any residual THC because the legal limit for hemp products is 0.3 percent THC so a full spectrum product could have at most 0.3% but you could easily remove that making a broad spectrum or end up removing everything for an isolate for most people the best option for a CBD product is going to be a full or broad spectrum extract isolates are kind of the pharmaceutical reduction of CBD it strips it away from everything else reducing its holistic nature and making it more controllable as such isolates are the cheapest form of CBD available and a lot of times people will actually just throw isolate into a product to make it a really high milligram count and then end up charging you more even though you're getting a lesser quality product so when you're out there trying to figure out which CBD product is best for you it's fair to either ask the company or look for where it says it on the label to see is it isolate broad spectrum or full spectrum and that should help you decide exactly what you're looking for so in summary on one end you have an absolutely full spectrum product that's gonna have the most other compounds besides CBD and it's going to have the most entourage effect on the other end you have an isolate where the CBD is stripped away from all the other naturally naturally occurring compounds there are no extra compounds in the extract and there's going to be no entourage effect and then in the middle you would have the range of broad-spectrum extracts that don't have all the naturally occurring compounds but have most of them and you're still getting the benefits of the entourage effect because of the turbines the flavonoids the polyphenols and all of the other array of compounds that are naturally present in a CBD hemp extract so that's it that's the breakdown between full spectrum and broad spectrum and isolate thank you so much for watching if you enjoyed this video please give it a like leave a comment down below if you want to share your thoughts and make sure to share this with friends so that they can understand the difference between these three forms of CBD as well that's all for today see you next time peace [Music]", "pYsO9slIUF0": "[Music] how's it going today guys today we're doing something not vape related but it is CBD related and you guys seem to be really interested in that so we're gonna talk about this stuff today well this is hemp extract CBD oil by potent potions they sent us it um thank you guys so much for sending it to us now this stuff is twelve hundred milligrams meant to be taken orally or I guess apparently you can like rub it on your extremities that are in pain or whatever I'm not too sure but this stuff I'm gonna drip directly into my mouth um that's how you're supposed to take this stuff so let's jump beat around the bush I'm just gonna go for it uh-huh so you shake it up real good first and then you just pretty much grab a dropper full and then pop it in your mouth let it hang out for a minute so if fully absorbs and then you swallow it and then you should be chilled out so I'm going to do it here goes a drip one minute 57 seconds later alright it's been about a minute there we go alright oh when you swallow it you really taste the flavor it's um it's pretty minty which is cool yeah I'm going to let that CVD effect really set in and I'll tell you guys a little bit about this stuff so potent potions is a company out in California who makes really cool stuff it's completely organic and if you're interested in doing this stuff and you want something organic these guys are a great choice to check out now I will warn you guys this stuff is kind of expensive this 1200 milligram bottle was a hundred and twenty bucks so that's that's pretty that's pretty steep but apparently I mean it's super deluxe like 1200 milligrams is pretty pretty high potency makes sense I guess it's potent potions on the back of the bottle it tells you the nutrition facts which is kind of funny um apparently it's 9 calories per serving so if you're watching your weight only take one serving but yeah every serving is one dropper full and it gives you 40 milligrams of CBD in the filming of this video I [ __ ] it up a bunch so I'm on like eight servings right now and I'm pretty freakin mellowed out Motz crazies you know you're not stoned you're you're chilled out it's CBD there's no THC so it's supposed to help relieve anxiety stress pain all the normal things that weed helps with without getting you stone or so I'm told I don't smoke weed but apparently it's supposed to help you out in that way which is cool now if you look closely on the bottle guys this stuff says it's medical grade so I don't know what that means I wouldn't take it too seriously I think that's kind of a marketing strategy I'm not sure but it's definitely good stuff you know flavor is nice and it tastes like CBD stuff like if you have experience with CBD vape juice or whatever or if you've done other oral you know means of taking CBD it definitely tastes like it and this stuff some got like a mint kind of overlay on top which is pretty cool top to bottom you know this stuff is pretty cool I've used it a bunch already and you know on video right now after a bunch of different servings I'm pretty I'm pretty chilled out which is great it definitely works but you know it's pretty expensive now there's other options you can get it in lower concentrations and obviously the less concentrated it is the less expensive it is but I'll link down below for you to check out but yeah if you really want to get into it and you want something that's strong check out the 1200 milligram it's a 120 bucks like I said but you know it's definitely worth it and it'll last especially like I mean [ __ ] we've had this stuff for so week and a half using it everyday pretty good and you know if you don't want something so so powerful you can jump in at a lower concentration and really get your feet wet see if it's something you want to check out and if you do use our link because it helps us grow which is awesome and you know what guys if you enjoyed this video definitely hit the subscribe button I mean we're always here but we need more subscribers and hit a thumbs up because this video is awesome as all and until next time guys peace out", "jfYaSky511Q": "what's up CBD lovers welcome to I love CBD so first of all I want to apologize for being away for so long but life life has been catching up to me and I haven't had any chance to review any CBD products lately so sorry about that but uh I got some new stuff for you guys and I'm gonna start out with this one right here and this is from koi CBD so I was driving around and I saw a big billboard that said koi CBD on it and I was like wow and CBD company bought a whole billboard this is pretty impressive I gotta try this out so I looked him up heard some pretty decent stuff about him so I was like okay let's try it out and give you guys a review and let you know what I think of it so this right here is a tincture bottle it has 250 milligrams and it's peppermint flavor I ordered this off their website keep it quick turned out that they were actually here not that far away from where I lived there in California as well but I think they have other locations this is what the bottom looks like and the liquid inside is pretty clear there's no substance or anything in there see it's almost two hairs water and actually the taste is also very clear tastes like when you taste it all you taste is that peppermint and you know it's almost like you're taking water with peppermint which again you know it's okay I don't mind that the pepper is pretty refreshing I'm usually expect a little bit extra flavor or something in there but this has none the ingredients are COI prism full spectrum cannabidiol blend natural peppermint extract and the oil so pretty simple no fluff no additional stuff that it doesn't really need to be in to your CBD and no weird stuff that I can't pronounce so I like that I like that it's simple and straight to the point however the recommended dosage on this bottle has one full dropper so just wonderful dropper like we just pulled out at the bottle right now I tried this three days before I made this review because the first day I took the recommended dosage was just one full dropper and I didn't really feel much the second day I was like okay let's double up the dose and take two full droppers and I actually felt more effects at that point and you know if felt more relaxed and little loosened up some tension and you know muscle soreness also eased up a little bit I wasn't sleepy but I got good sleep when I went to bed it's pretty deep sleep as well so pretty decent so yeah on the effects part it's you know it's not bad so it's okay it does what it's supposed to do flavor-wise the peppermint is good I didn't mind it and price wise it was 39.99 off the website you can definitely find some coupons online if you search up going CBD coupons you'll find it on some website and you can probably at least get like $10 off or 10% off I'm sorry I could get 10% off your order sometimes you know special occasions or whatever they might have a higher coupon get more of a discount but you can almost always find that 10% off so yeah for this I would give it 4 out of 5 stars I'm not disappointed I'm not overly impressed either it's okay it's fine I think for somebody like me I'll probably go to higher dosage if I do get it next time not sure if I will or not but you know I have nothing against getting it again and that's it for coy CVD tinctures and yeah I also got some gummies which I'm pretty excited about because I haven't tried CBD gummies yeah before so that's gonna be coming up on next review and I'm excited about that I hope I'm not disappointed and I look forward to putting up a review on that one all right I hope you guys find this video useful if you liked it and you found it useful give me a like if you have anything to share about koi cvd drop us a comment let us know what you think and if you like CBD like we do subscribe and you'll get all my reviews and happy CBD I will see you guys in the next review goodbye", "Hr22KInfWJg": "before buying CBD oil you need to know your choices and full spectrum CBD oil is one of them cannabis and it's byproducts are gaining popularity in many of the places both in the United States and around the world that have loosened their laws surrounding this plant the majority of the united states now have at least medical marijuana laws in place with 11 states legalizing the plant and its byproducts for recreational use CBD oil has staked its claim as one of the most beneficial and popular cannabis products being used to treat everything from back pain to seizures as you probably guessed not all CBD oil is created equally and there are actually four different types and you should know about one of which being full-spectrum so give me your attention for the next few minutes and we'll address what full spectrum CBD oil is and how it varies from the other varieties first type we'll talk about is marihuana derived CBD oil many of the early studies regarding CBD oil point to a very synergistic effect between the compounds of THC and CBD thus people who have a medical card or do not mind the high that comes with taking CBD THC might want to seriously consider this oil onto CBD isolated CBD isolate is the purest form of CBD you can possibly take it is normal for manufacturers to distill the CBD as many as four times to get the purest product possible scientists think that this may not be the best way to take CBD though since you are losing out on many of the other cannabinoids and minerals in the refinement process but if you are in a situation where you need to closely monitor what goes into your body then this is your product finally full-spectrum CBD even here we find two different variations of full-spectrum CBD oil the first type is zero percent THC full-spectrum much of the oil currently produced comes from the head plant which normally has a small percentage of THC in it in most cases this is not enough to produce the high feeling but still will leave a small percentage of THC in your bloodstream so there are a lot of situations when a consumer may want to avoid THC completely if that's your situation then this is the type of full-spectrum we recommend last but not least is full-spectrum CBD with THC full-spectrum CBD is also commonly referred to as whole plant CBD because it is derived from the entire front plate there are a lot of benefits to consuming some face CBD in the full spectrum variety since you were able to get all of the cannabinoids flavonoids and Terrapins first present in the template now we realize that this is just one of many questions that are common for new users of CBD oil with that in mind we've created a free ebook detailing everything you need to know about this powerful product the arrow is pointing to the link where you can download this ebook or you can find the link in the description below thank you for watching our video and we would love for you to comment and like it and subscribe to the channel if you haven't already so you'll be notified of all the great health information will be produced", "dh5AVKuMJ4c": "the Joe Rogan experience gotta get off the CBD oil man his mess around your brain man you can't be too relaxed right yeah that's CBD [ __ ] it saves vacations for me I don't stress out like it's it's it's I think it's one of the best things I've ever tried for anxiety it's it's weird and I didn't even know I had anxiety until I started taking CBD I think these little jammies these are this is uh this will [ __ ] you up though this is one in one one part CB don't put this one but yeah it does not put this in your you can put in your butt but you will get no nervous you're gonna get paranoid but it's it's a weird like the CBD THC high is a different high because CBD does something to alleviate anxiety it sort of just leaks makes you comfortable with your own demise lets you do the existential angst is the flames don't seem so hot so you like yeah we're all gonna die yeah but right now we're not dead cool look at the colors let's feel that feel the warmth the Sun but this uh this is not like funk this is not functional like you don't wanna I don't do this if I have anything super important to do but but just CBD oil hmm I just find it it did puts you in a great place okay like it but I'm journal not topical its internal yeah topical is really good for muscle aches okay it's really good really the probably the best thing I've ever found for like a alleviating soreness and stiffness and stuff like that because I found I was yeah in Europe all of a sudden discovered that they actually had ibuprofen like cream to put on ibuprofens terrible for you alright really really bad what I found out was that if you let your pets lick it they get liver failure and die so don't did you guys accidentally didn't know I had a person who works at the Humane Society I mentioned you know mentioned that I found this stuff and like I just in desperation and Europe like she had some storm muscles and uh she's like don't let your pets like that cuz they were trying to kind of figure why these kittens were dying Oh God my friend Cameron Haynes is a runner and he runs marathons and runs ultra marathons he runs he's 240-mile Moab [ __ ] ridiculous runs that last three days and he was having like all this joint pain so he's taking ibuprofen every day of st. taking 800 milligrams not just once but sometimes twice a day and he was just constant aches and pains so dr. Rhonda Patrick had been on the podcast she was talking about the dangers of ibuprofen and about what it does to your gut biome and how much it [ __ ] you up and it actually creates inflammation and actually can cause stress or it can cause strokes rather and all sorts of horrible horrible things so I call him up and I said hey man that stuff's fine to take every now and then for a headache but you can't take that [ __ ] every day you just can't do it and you're you're [ __ ] your body up just get off of it and I sent him the recording he listened to it he's like Jesus Christ I don't have a stroke so he gets off of it all his pain goes away it turned out his pain was being caused not just by the running but by the fact that he was creating inflammation by destroying his gut biome by taking 800 milligrams of ibuprofen 2 times a day so the idea of like fixing himself was [ __ ] him up crazy death chasing that yeah yeah so [ __ ] ibuprofen okay well we don't I take it every now and then but you can't take it every day so you're a liar no I mean just saying don't take it every day but if I had like a bad headache I'll take you some Tylenol or some [ __ ] it's not Tylenol right Advil yeah yeah it's it's it's just not something you're supposed to take all the time yeah I never realized it was doing what you said yes I was more achy than I should be and then like you know bad night out you didn't drink enough water right okay boom coming ahead yeah then you're fine you can still do that but CBD does that too it's better better for you than all that stuff seems to be no side effects okay all right the side effects is people think you're a hippie that's the only side effect right", "kzbq3cFf-s4": "hey dr. axe here today I want to talk to you about how to start using CBD and CBD oil CBD is a hot topic of conversation today the problem is a lot of people don't know what type to buy how to use it in the dosage I'm going to be answering all of those questions in today's video the first thing you need to know about CBD is that it really supports the balance of what's called your parasympathetic and sympathetic nervous system a lot of us live in this fight-or-flight stay of constant stress which can affect our hormones our sleep our gut health what CBD does is allows us to get more in a parasympathetic State and so when you're buying CBD the things you want to look for is you want to buy CBD number one that is certified organic now I can't stress that enough when you're buying CBD look for the USDA certified organic seal on it if it's not on there if it doesn't say organic you don't want to buy it just like you want to buy coffee organic just like you want to buy your kale Organic you also want to make sure that CBD is organic or else the most the time it's been sprayed with chemicals herbicides and pesticides so make sure it's organic number two make sure your CBD or CBD oil is full-spectrum now full-spectrum means it's gonna have all of the other nutrients that CBD needs to work most effectively in the body let me give you an example of this did you know that if you consume calcium by itself it does little for your bone health your bones need more than calcium your bones need calcium vitamin D magnesium boron phosphorus your collagen your bones need all of these different things what a lot of people today especially companies that are more synthetic based and what they create they're creating these isolated synthetic forms of CBD which don't really work with your body similar thing tumeric is great because it contains curcuma noise and tumor owns and all these different types of nutrients when you're buying CBD make sure it always is a full spectrum which means it's going to have CBD but it's also going to have a very small amount of things like THC CBC CBG and terpenes which are what are found essential oils now in terms of dosage I tend to do between 20 and 50 milligrams a day and that's really what I what I notice I'll do maybe 20 milligrams twice a day or 30 to 40 milligrams in the evening that's how much I personally take if you're new to it though and just getting started sometimes you might want to just start with about five milligrams maybe just a half a dropper of a 10 milligram dose and see how your body feels with that and then you can move up over time and you can take it in many different forms everything from the oil form CBD capsules or tablets and also a seaweedy powder all of those are great forms of CBD and I think by using CBD you're going to know some great benefits in your health", "lO6fagHWtQo": "health tastes so good sometimes hey everyone welcome back to my channel and if you are new here my name is patrina shell and i am on an endless pursuit of life and everything incredible natural healing whatever makes life incredible and high-quality hi vibe that is what I'm about today I'm talking about my experience with CBD oil now CBD oil is the cannabinoids from the hemp plant and it has the THC removed from it so it's literally just the CBD which is non psychoactive so you will not get high from it it is literally full of the most healing properties of the whole plant the cannabinoids in the CBD oil actually work with our own and no cannabinoid system in our body our body is full of endocannabinoid receptors and what they do is create a homeostasis within our body so when you're taking a CBD oil it actually just amplifies that and it helps create the homeostasis feeling it has been proven to have myriads and health benefits I wanted to give it a go myself and see exactly how it would affect me and what great benefits I would feel from it I have now finished one whole bottle of this I'm on to my second bottle and I started taking CBD oil because I was suffering from adrenal fatigue I was super tired all the time no matter how much sleep I got I would wake up tired come 3:00 in the afternoon and I would crash and burn and I need super healthy I live a healthy lifestyle so this was really getting me down you know and then come the evening I was wide awake and I would be awake till 3:00 in the morning and it would throw off my whole day in my sleeping patterns and it was just not fun not at all not only that I also suffer from anxiety have a really bad ankle and that can cause me pain when I'm on it a lot I decided you know what with everything I've heard of CBD oil I should give it a go now from the very first day the very first dose I innocently felt a difference like my first dose was in the afternoon when I was feeling that crash-and-burn feeling like I was hitting a massive wall and I took my first dose of CBD oil and within 15 minutes I felt totally renewed I felt super calm tranquil like I felt amazing I was blown away at how fast it worked and as I progressively took it day after day that feeling it completely went away I'm not even kidding within two weeks I have not experienced that feeling again I feel like a totally new person it also corrected my sleeping patterns and I fell asleep super easy and at the perfect time there was none of this tossing and turning staying up all night like when I lay down and I'm ready to sleep I'm out and when I wake up in the morning I feel great I do not feel that foggy headedness at all fully I was blown away at that that was probably the thing that was really getting me down was feeling foggy headed every day feeling like there was nothing I could do to get it to stop or prevent it so that changed my life and rocked my little world right there not only that when I'm feeling any sort of anxiety building up inside of me I take my CBD oil and within 15 minutes the anxiety is completely gone I feel peaceful I feel relaxed I feel clear-headed I feel incredible like zero anxiety and for those of you who have anxiety you know it's also not a good time you just feel it inside of you and it just makes you anxious about everything and that feeling of impending doom or something Bad's gonna happen that's totally gone CBD oil is also incredible for depression if you suffer from depression since it does create that homeostasis feeling in your body it will zap that feeling of depression you will feel more balanced and you will feel more general joy and happiness and your being with the pain in my ankle between this and another joint supplement that I've been taking I have zero pain in my ankle I can be on an all day no problems at the end of the day of being on my foot all day prior to this I was limping I could barely walk it was really also unpleasant yet that is completely gone now I can be on my foot for 12 hours no problem and it is all thanks to the CBD oil and obviously the joint supplement yet CBD oil reduces inflammation in your body dramatically and inflammation can cause so many health problems it's insane by combating the inflammation you are increasing the healing abilities and capabilities of your body there's been so many studies that I've read how if anyone suffers from seizures CBD wale will stop people seizures helps prevent cancer it is truly one of the most incredible products I've ever used in my life CBD well you do have to find your perfect amount take about 0.75 milliliters twice a day under my tongue I hold it there for a few minutes I take it in the morning and in the afternoon and that's used to be perfect for my body if you take too much for your body you'll know you'll maybe will feel bit irritable and a little jittery your body will tell you it will not do anything damaging to you it wouldn't be fatal if you take too much CBD oil yet your body will let you know and for people who have a lot more health problems and you know we need a lot more healing well your dosage would be much higher and that is just something you play with and you find for yourself you'll feel the effects of it like I said you hold on your tongue within 15 minutes I already feel that calming peaceful effect come over me I pretty sure this is like an addition to my life that I will not live without I'm excited to see what happens after my second bottle of CBD oil which I'm underway right now the benefits of it so far have been incredible and one of the great things about CBD oil is that as there is no THC knows kelex and it is totally legal so there is no problem getting CBD oil would highly recommend it for anyone it definitely promotes that homeostasis and that level feeling within your body so your body can do more of what it's meant to do which is heal itself and regenerate itself and just be an awesome body CBD oil for the win dramatically improved my health well-being and my general feeling of Awesomeness I am NOT a doctor I am NOT giving medical advice whatsoever this is simply what I've experienced from implementing CBD oil into my life into my diet into my body all do have that endocannabinoid system within our bodies so you're simply just feeding that and giving it a little more of what it loves have the opportunity or if you've been thinking about it for a while give it a go you know and give it a real go at least take a whole bottle and take it consistently as you will never get the benefits of anything truly if you just take it here and there or once in a while if you really want to experience the benefits of anything you're adding into your body or health regime do it consistently I say do it consistently for three months and then you really get a general feeling of how that's affecting your life if you give it a good 90 day go it's so good thanks for watching and if you enjoyed my video please give it a thumbs up and if you enjoyed your time here as much as I enjoyed having you then please do hit the subscribe button and right beside that button eat the little notification button to make sure you're notified every time I post a video because I love having awesome people just like you around you soon guys", "2yZkulTsDYg": "[Music] what's going on yo shout-out to tweedle farms if you have not heard of them I don't know where you've been CBD products awesome CBD flour CBD charges now we got hemp oil tincture yeah are you excited I am so this is tweedle farms CBG rich hemp oil 250 milligrams cannabinoids vegan non-gmo no THC so that means what you're not getting high gluten free healthy all-natural good [ __ ] ingredients THC okay we started already TAC free distillate and hemp seed oil the FDA has not evaluated gay basically it's not FDA approved but c BG CBD hemp products do help try for yourself now let's get into it this is a 250 milligrams bottle this would be 30 bucks [Music] without the dropper how many know what I just said put it down where help I am so bad it does not taste like Earth very very faint this CBG tastes very faint dissolve in your mom in there and she's gone the CBD rich hemp oil tincture from Twitter farms combines the power of a concentrated dose of CVD with a higher than usual concentration of CBG using only TAC free high CBG distillate this tincture boasts a twenty to one ratio of CBD to c22 one CBD CBD ratio that means that for every 20 milligrams of CBD you ingest you also get one milligram of CBG all right so uh I guess you wonder what the hell CBG is all I'm gonna tell you kena biker all is one of more than 120 identified cannabinoid compounds found in the plant genus cannabis that's why I provide links in the pin comment so you can check it out for yourself so what has been my experience with this tincture you can tell it's very relaxing for me I start to feel it over here I've been using this for two days now and yeah I like you a lot now I've said before tincture is not really my way of taking it you know ingesting taking and CBD because I don't like the earthiness taste the earth Venus earth earth taste dirt I know it's too much I mean I've done was you know review some companies that a sit with the the the whatchamacallit the term terpenes that whoever their chemist is is the [ __ ] and so it's tweedle farms now this I said remember it's 250 milligrams so serving size is 1 mil one is 1 mil is the dropper and the serving servings per container is 15 so you can drop this right here it's saying it's 15 servings in here so you will use this 15 times depending on how you medicate this one besides when I last you too long so you're able to get this up into a 30 mil bottle and a 30 mil contains 30 doses per container but again who knows how much you will you need to medicate your body only you could tell but 3 2 farms is definitely a company I would recommend that you try for your CBD products anything doesn't want to share with you about this yes directions for use there's not really a wrong way to use your thing to use are tinctures but we suggest that you put them under your tongue as you saw we do so that cannabinoids can be absorbed by the mucous membrane you can of course also put them in your food in your drinks or on your skin yay shout out into Twitter farms thank you for allowing me to experience this I'm really enjoying it y'all make sure y'all check on that pin comment so you get one for yourself and all that notes how about thank you for checking out the review all information is down below where you can get the product for yourself remember thumbs up subscribe all that good stuff and I'll catch you in the next one come out [Music]", "Uqi2RPITg-c": "want to get the most out of your CBD check out CBD FX's new CBD with MCT oil let's check it out what's up guys it's your boy big Jay coming back at you again from Vaco TV where you watch the side and vape and as I said I've got CBD FX's new CBD with MCT tincture hmm what is this you speak of big Jay well let me tell you your CBD right CBD is great if you want to get the most out of it you want to absorb as much as you possibly can try this stuff okay the MCT in it really helps you absorb pretty much everything like gets every last little drop that you can okay of goodness out of your CBD all right but we'll talk about that more in a little bit let's go ahead and check out the box shall we so here's your box hashtag feel the difference CBD FX hemp plus MCT oil 30 milligrams the 500 series made in the USA roll it over producing se GMP certified facility that's good that's good hashtag feel the difference CBD FX roll it over supplemental facts serving size one dropper basically one milliliter contains 30 servings so 30ml bottle calories a total fat one gram which is 1.6 percent saturated fat one gram hemp extract 65 milligrams CBD is a natural constituent of hemp 16 and a half milligrams 500 milligrams per bottle MCT of ingredients mzt oils CBD rich hemp oil these statements have not been evaluated by the FDA and are not intended to diagnose treat or cure any disease always consult with your physician before use underage sale prohibited I have a fact sheet about that world war with that too and then some trademark stuff and it is made right here in Los Angeles California roll it around it does contain full spectrum CB a hemp oil with amino acids and fatty acids it is gluten-free and non-gmo rich in cannabinoids and turkeys and it is a vegan product for all you vegan folks out there can ability all in CBD afx is naturally occurring in the industrial hemp plant and is legally imported and produced hashtag feel the difference and again we'll go over that with the fact sheet and back to the front let's pop it up and check out the bottle so here's your bottle much like the box CBD f/x have plus MCT oil 30 milliliters 500 series and again contains full spectrum CBD gluten-free non-gmo and it is vegan the ingredients are exactly the same as we went over on the box so I will over those again roll around same with the Supplemental facts we already read those off on the box and roll it around one more time and we're back to the front alright let's go over those effects that we were talking about shall we okay so I got the fact sheet out and this is for the CBD part okay you've probably heard old CBD is illegal not so CBD effects and the CBD oil contained in it are illegal for the following reasons non psychoactive hemp was deemed legal by the Ninth Circuit Court of Appeals in 2004 step one there have biomass which means basically their crop comes with an import certificate signed off on by Homeland Security because we did cover it it is imported we only use CBD derived from the stalks of European grown hemp plants mm-hmm products meet the standards of the 2014 farm bills definition of compliant hemp which means it must be industrial hemp and contained less than 0.3 percent THC last but not least our products are considered exempt from the CSA and DEA drug scheduling practices which classify whole hemp extracts as schedule one drugs then you're like wow so yeah don't use available haha extracts from the stuff stocks of EU European grown hemp are explicitly exempt from this scheduling practice so there you have it guys legal alright long as it comes from Europe as long as it's industrial and as long as it meets everything else which it does you're good good now you're like well okay that covers the CBD what's MCT though got some facts on that too alright so MCT or what is it is MCTS our medium chain triglycerides okay and there are fatty acids that your body can quickly and easily break down and convert to usable energy okay MCT oil is often recommended for people with medical disorders related to absorption such as Crohn's disease because of their ability to help your body make the best in the nutrients it takes in they added MCT to the CBD tincture primarily to ensure that you get the maximum benefit from the CBD that you're taking okay so basically the MCT stuff makes you absorb alright all of the CBD goodness in there which is awesome is CBD plus MCT oil used for a ketosis or part of a ketogenic diet swap pages one of the main reasons MCT oil is used on its own as a nutritional supplement is to keep your body healthy absorbing all the nutrition you throw at it a side effect is to keep your body in ketosis essentially that's a metabolic state where your body gets energy from fats instead of carbs this promotes a healthy metabolism and it has been linked in some studies to healthier weight and body composition so I'm sure you've heard of like the keto diets and all that good stuff oh it's even keto diet friendly come on come on that's awesome it's awesome so let's go ahead and try it with the bottle just spin it around and you will find some perforations and then once you do that it's doubly perforated so you can just grab it and then bone and then just take the whole thing off oh you actually don't have to take the whole thing off just get it to where you can open the top push down spin oh yeah there we go and let's try it shall we hmm doesn't really taste like much yeah you just get like the earthy flavor of the CBD in there at the end yeah that's not bad and like I said if taste is a big thing for you there's a bunch of other CBD products that CBD FX offers that you can use again I've gone over this in a couple of the other I think every other CBD video I've done but this is the first one you've seen I'll tell you what CBDs does for me I use it to help sleeping help me sleep I'm one of those guys go to bed and sit there flip through social media look on my phone for hours anyway my mind won't shut down this stuff helps me shut my mind down alright it doesn't make me drowsy it just helps me turn off and actually go to sleep there's a couple other things that I use it for aches pains so on so forth so keep that in mind alright if you're looking for something other than what the doctor is going to shove down your throat or over-the-counter and whatnot give this a shot alright that's all I'm saying if you want to try it check the link below or check the description below you're gonna find a link directly to the product and smash the mouse button a couple times and do what put in the cart pay for it ship it to your door give it a shot and like I said with the MCT oil in there not only can you absorb all of it you lose a little weight keto diet who knew so until next time it is your boy big J for venko TV where you watch the side and date and I am how [Music]", "MYdhUBPQrPM": "you guys who got their handful today oh my gosh I'm so excited right now everybody your hemp oil is showing up I know mine just came in the mail today I've had so many people say there showed up today so I want to take a minute and show you how to use it and what to expect because I know so many of you are gonna be having questions so this is the one ounce bottle that you have received today tomorrow sometime this week if you order and I want to show you how I take my hemp oil every single night what I do why I do it and and give you a little bit of what to expect all right so super easy I'm gonna keep this short either you ordered the full spectrum like this or the isolate and in it you are this is the bottle that I've been using for the last couple of weeks in it you're gonna have a dropper and it goes to one milliliter okay so you're just gonna go ahead and if you just give it one full suck it usually fills mine to 0.75 the first month that I used my oil I only used a half of a dropper the reason why is because number one so I use just a half of the dropper the reason why is because number one I didn't know how long it was gonna be before I could get another bottle and so I wanted to like conserve it and make it last and I had also heard that you can have some detox symptoms with it and to start slow so I thought okay that's fine so I messaged my friend who was really really knowledgeable about hemp and I said you know what happens to me if I use the full dropper like what's gonna happen to me and she's like nothing nothing's gonna happen to you use the full dropper so the only reason why I really we used the only the half a drop of the hemp oil to start was because I was trying to conserve it because I didn't know how long it was gonna be and I wanted to make it last for a full month so the benefit though of doing it that way is I did have some detox okay the detox that I had was exhaustion I was completely exhausted for a couple of weeks I remember just like in the afternoon sleeping all night and being so tired and I will link the call that Jamie Foote did for us last week on our leaders retreat team call so that you can hear why that happened why it's a good thing and I just took naps you guys it's your body basically coming back into homeostasis and healing itself so I've been through detox before it was an enjoyable detox it was not uncomfortable it wasn't bad I mean you just drink an active or take them ed a burn or take a nap all those things are gonna work great so I'm gonna show you now you can start off at a half a dropper and after a week if you're feeling great go up to a full dropper I am up to a full dropper now and and you'll you'll be able to just navigate this and it's just something new but it's nothing to be afraid of it's not like normal detox where you're gonna be sick none of that I just had extreme fatigue as part of my detox so I don't want anyone to be nervous or scared like start with the full dropper but I just thought I'd share with you what I did and what I experienced in case you have that too Sean is gonna start his tonight because we've got three fresh bottles he's gonna finally get to try it and then I also got the isolate for Mackenzie so I'm gonna give her I'm probably gonna start her off on a quarter full like a little quarter of a dropper or maybe even half a dropper and I'm hoping that it really helps her with her anxiety so more on that later but I'm gonna show you how to take it so this is just a half dropper because I'm gonna take another Huff dropper again tonight I thought I'd show you what it looks like to just take a half drop right now so what I want you to do is I want you to put up under your tongue and then I want you to hold it there under your tongue for nine seconds why do I want you to do this because that is how it's going to absorb most efficiently into your body its fat soluble so the fat is actually gonna make it so that it's absorbing more efficiently anyway but you want to hold it under the tongue for 90 seconds now I don't sit and count to 90 in my head what I do is after I've brushed my teeth I I'm in my jammies I go to my bedside table I just keep it inside of my little sock drawer and I pull it out I put my chapstick on I put half of it I put a full dropper and I do a full dropper but I put a full dropper under my tongue all right and then I walk around my house I make sure all the lights are off again I'm just holding it under my tongue this whole time I turn off all the lights in my house I set my alarm on my I set my house alarm I go downstairs I check on the kids and then I come upstairs and by the time I get back upstairs and I get in bed I figure that had to have been 90 seconds and then I just swallow it at that point the full spectrum tastes like berry guava I think the isolate is like a mint but I'll let you know because it's coming today still I had that one shipped to my mom's house because I got on her account so I'm gonna show you now what to do and how to do it and I want you to do this at bedtime if you're someone who who wants to use this if you're like CrossFit and like super into exercise and fitness and weightlifting and all of that I want to know what your experience is with the hemp oil if you take it right before your workout because I've heard that the MCT oil inside of this those are multi chain triglycerides I've heard that it can help with workouts so for those of you that are like really inch bodybuilding or CrossFit or things like that I would love to know if you notice the difference but I just take mine at bedtime so just do just tell us all the things and how it goes for you because this is also new for us okay so this is what you do under your tongue but uh uh and uh hum well ninety Saturn's okay Oh it's like who's people under your tongue for like 90 seconds Brennan you're gonna hold it under your tongue for 90 seconds don't talk to anyone like don't do what I'm doing right now again this is why I do it right at bedtime at night who's gonna hold it under your tongue and then after you hold it under your tongue for 90 seconds you're gonna swallow it and then you're gonna go to sleep you're gonna have the best sleep of your whole entire life it's gonna be life-changing like I'm gonna swallow now just because I want to build talk normal to you guys what the the best way that I can describe the sleep that I have with my oil is I feel like I sink down into my mattress halfway and a cocoon closes up over me and I don't move until I wake up the next morning like I thought my sleep was good before this hello it's amazing so super excited for you guys cannot wait for you to drive it out cuz I know everybody's oil is coming today these are my three bottles that I ordered on my account chanson count my reentry account then I ordered one on my mom's account too so and I got the isolate on my mom's account so I'll let you know how that goes I'm gonna just easy not with Mackenzie I want the full spectrum for myself and and I just wanted to buy a nice alit and see how that goes and I'm gonna I'll try it too I want to see what it tastes like but um make sure that whatever results you're having with this post them here in the team page even if you're like oh my gosh can it do that can it work that fast yes it can yes it can and I want to document all of it in our team page so that we have a wide variety things for people to just just showcase everybody's different experiences with it if you remember too when you put your story in there use hashtag CBD hashtag hemp so that we can find all of these stories really easily all right guys Callie Tara goes for you happy hemp in", "1-qdvTBmo3I": "[Music] hi these are the sublingual tinctures from koi CBD these are called coin Naturals and they are full spectrum however THC 3 sublingual tinctures in other words they're designed to be used orally under the tongue and these products are they have a hemp extract natural plant terpenes and the carrier oil is coconut oil they come in we carry two different flavors a natural flavor and an orange and the orange flavoring is not artificial it is natural orange flavoring these are true full-spectrum sublingual textures so if you're looking for the anti-inflammatory the analgesic the anti-anxiety and the antioxidant benefits of CBD koi naturals is definitely a good choice in addition to being THC free these are 30 mil in your bottles and we carry a 500 milligram and a 1000 milligram each one no leader dropper or 1000 milligram tincture would have 33 milligrams of CBD which is right in the middle of where we see most of our customers using these products in terms of daily CBD intake for their different ailments and benefits that you're looking for the taste of these are great like I mentioned the natural it's it's very very natural tasting the coconut oil does a really nice job smoothing out the hemp extract and the orange is a very very good natural orange taste so if again taste is an issue for you if you've used CBD products before these are very very good have no fear these are very very good tasting sublingual tincture as you actually will enjoy using them again these are these see the koi Naturals CBD sublingual full-spectrum tinctures", "D5EDCvg4w8I": "hey there my name is Jennifer Dixon with thrive yoga and wellness and today I want to talk to you about a brand new product that we've recently started carrying here in the studio I'm super pumped about it because it is a CBD product that is an isolate so for those of you that are drug tested or maybe on pain management and you're not allowed to take a full-spectrum product this is a great option for you so before I get too much further let me talk to you a little bit about this this word isolate when you are taking an industrial hemp product like CBD if you take the full spectrum there is as much as 0.3 percent THC inside that dose inside each dose inside that bottle if you will this may or may not show up on your drug test in it is that because a hundred percent dependent on your body's mcdonough metabolism so for instance I could take a full spectrum and somebody else right beside me could and it might show up in a drug test for me because my body metabolizes the THC a little bit slower so here's the thing there's not enough THC in a full spectrum product to get you high it's not going to get you high but it is possible that it shows up on a drug test so for those of you that absolutely cannot have any THC you have have to go the isolate route this is a really great option because it's got zero THC they actually claim to be 99 percent THC for of THC free so such a small small small amount of THC that it shouldn't show up on your drug test now this is called even to herbals it's actually made out of New Hampshire it's made in New Hampshire and it's a really cool product I love it because it is super affordable inside this bottle there's 30 milliliters of product 30 milliliters of oil pink shirt that would give you thirty one milliliter doses and each dose would give you 33 milligrams of CBD ha tongue-twister right so let me talk to you about that again so inside this whole bottle is a thousand milligrams of CBD so let's go back to I think it was in third grade that we started learning fractions right so if we have 1000 milligrams and 1000 milligrams and 30 milliliters if we were to divide that by 30 we'd get about 33 milligrams of CBD in each dose and that's if you take a dose that is a full dropper full so when you order it it's going to come in a bottle it doesn't have any special packaging of its own I know that's kind of an industry trend that's happening is individual boxes for each one I kind of like it because why waste the paper so you get exactly what you get exactly what you see when you order this it's gonna come and bubble wrap and all that kind of stuff and then you're just gonna open it and you can I it's kind of like childproof you gotta have to push down on it to open but it's not a huge deal and when you're doing it make sure that you push it while you're screw unscrewing it because you want to be able to and otherwise you'll just be stuck there screaming and screaming and nothing ever happens okay so if you notice something this is a pretty clear liquid that's because it's an isolate and so usually when it's an isolated it's with a carrier oil in this case it's an MC t there's there's not a lot there to cover to color excuse me so it's a pretty clear fluid one of the things that I absolutely love about this particular product is that it is so mild flavor there's not a really strong earthy flavor if you catch my drift a lot of times TVD products you're not taking it because it tastes good right you're taking and because you want it to make you feel better you want it to help you sleep you want it to you know make you not want to yell at everything so the anxiety goes away so this is a really great really great way to get into it because it's so mild flavor like I said it is almost clear I'm not sure if you can see that I hope you can and on on the dropper there are a little delineation so I'm going to set my my bottle full and see if you can see that it shows like 0.5 0.2 5 0.75 and so then you can kind of back out your own mass so if you know one milliliter is thirty three milligrams of CBD and you don't want to take that much you could take a half of the one of those droppers 0.5 milliliters and then you know you're going to get about 1617 milligrams of CBD and that's about what I'm gonna take if I take too much more than I kind of I don't want to say I don't you don't get high but I just don't care about anything else and so I usually stay between 10 and 15 or so milligrams of CBD because that that takes away any sort of residual pain and anxiety that I might have it helps me sleep but I still can otherwise if I take too much then I just don't care and I want to sleep all day and that's not an ideal situation because I'm a mom of two really little ones so I need to care a little bit right so we've gone ahead and gotten myself point five milliliters inside the straw / super clear and this is amazing in terms of very very mild and what you're gonna do is you're gonna put it underneath your tongue and you want to sit there and let it wait about thirty to sixty seconds the longer it goes underneath your tongue the faster it's going to absorb yes if you swallow it you're gonna still get the benefits of it of the CBD but it's got to go through your entire digestive tract before you get those benefits so it's best to let it hang out there underneath your tongue if you've ever done oil pooling you know just channel your oil pooling pretend you're cleaning your teeth or whatever and just let it stay underneath your tongue because you're gonna start to feel it almost immediately when you can do that underneath your tongue and it's in it's really easy you've got your half a milliliter or I do right here and then you just open it up and you put it under and then you wait for the interest of this video I'm not gonna let it wait for the full thirty seconds because that would be pretty boring to sit there and watch because you just be sitting there watching me let it be underneath my tongue again you'll still get the benefits of the product even if you swallow it it's just gonna take a little bit longer and so for those of you that really can't fan you know the taste of oil or anything like that even if you swallow it or if you chase it with juice or whatever you're still gonna get the benefit it's just gonna take you a little bit longer because your body has to it's just like when you take an Aleve it's gonna take you like 3045 minutes to get the benefit again today this was Eden's herbals let me show you this bottle there was a thousand milligrams inside of this this particular product it is manufactured in New Hampshire it is 34 third party tested and I haven't even told you the best part price point of this is absolutely awesome if you consider what other market rates are for a thousand milligrams this is $42 that's it forty two dollars for thirty milliliters of a of a third party tested product is amazing I think my next my next cheapest price for the same size is like $70 so if you're new and you don't need the full spectrum and you are just a little bit nervous about spending that much money this Eaton's herbals might be a really good option for you to try because it's super smooth really easy to get to take and it's very affordable and again it is third-party tested so you know exactly what you're getting that's you you know you're gonna get thirty three milligrams in each milliliter the one thing that I will say that I should have said probably earlier is you own if you want to always mix it in when you are using an MCG like an all-natural coconut oil the it can said it can create a sediment it can separate so make sure you you shake these up I did that before the video started thank you so much for watching again my name is Jennifer Dixon with drive yoga and wellness and I can't wait to hear what you have to say if you give this Eden's", "InB9xx41tkU": "hi y'all Becky page diamond ambassador I wanted to come and talk to you today really briefly about CBD and hemp as you've heard plexus is getting ready to launch into yet another new market and it's one that we're so excited about now here's the deal you might if you're like me you've probably started to see CBD sold in other places whether it's a shop on the corner depending on which which state you live in or whether it's through another company network marketing company perhaps sharing it and maybe some other places as well maybe even your integrative doctor has started to sell it and there's a reason why it's because CED has some pretty incredible effects on the body whether it comes to dealing with discomfort or mood disturbances or wanting a better sleep cycle there's a lot of different ways that CBD can be used and part of that is because of our awesome endocannabinoid system which affects every cell in your body so what I wanted to do is just to tell you that I was able to get a sample of the full spectrum hemp oil and I started using it on Friday night and here's what I've been noticing so first of all I slept terribly in Vegas it's probably due to the stress of having to get on stage in front of 12,000 people but I was grinding my teeth and I just wasn't in a familiar place and probably a lot of you had this experience as well you're over stimulated you've got some stress oxidative stress in your life and so you're not sleeping that great so when I took that full-spectrum hemp oil on Friday night left it under my tongue for 30 seconds to get that absorption started get the blood absorbing it and then swallowed it by the way it tasted amazing very mild flavor um I slept like the queen of the Dead like a zombie I don't think I moved literally think I was just out like a light and I thought to myself well this is probably you know just the effects of convention I was really stressed out I hadn't slept in multiple days I've had an exciting time but like a lot of you are learning excitement and stress your body can't always tell the difference so I thought okay I'll type I tried again the next night because it's pretty blown away tried it again the next night same thing Sunday night same thing last night same thing that's something that makes me so excited guys plexus has massively changed how I sleep in fact sleep was one of the biggest reasons why I got excited about plexus what if we can do an even better job right how could this help so many people so I hope that as many of you guys as possible are going after your three new ambassadors so that you can be a part of trying this product we need your experiences we are excited to know what other people are discovering as they put CBD and hemp oil to the test and I am so pumped to be a part of this company my belief is higher than it's ever been and I hope yours is - can't wait to hear what your results are", "ydZRyIeEvaM": "Hey it's Dustin in this video i'm going\nto be doing a cbd review on this PureKana 300 milligram mint cbd\ntincture so stick with me. Alright when it comes to cbd oil\nthere's three criteria that i want to judge it by and review it by and those\nare quality taste and price so obviously if we're\nreviewing a topical there's not going to be any taste so\nwe'll skip over that one so what i'm going to do here is i'm going to tell\nyou about the quality of this product and uh and i'm just going to give you a\nbrief overview we're going to talk about taste and price after that and then\nafter that we're going to go over the computer and i'm going to give you a lot\nmore nitpicky when it comes to quality we're going to look at the coa\nwe're gonna look at uh everything that's in it when it comes\nto the different cannabinoids and i'll let you know if this is a quality cbd\noil more in depth at the end so be sure to\nstick to the end brief overview of quality this is a quality product if\nyou're just like hey has a quality product or isn't it\nyes it is and the reason i say that is because um i've looked they sourced\ntheir hemp from kentucky decent place to do it i think uh oregon\nand central oregon specifically it's better to do that because we're on\nthe 45th parallel and so the light cycle is much more natural to grow hemp\nanyway that's a different story it's a little bit longer story if you're\nlooking for the best hemp i'm going to argue it comes from central\noregon they do it in kentucky and that's just fine they if you look at\nthe color of this product you'll notice that it's almost\nclear it's almost see-through it's a little bit golden\nin color and so that tells me that they're not using crude oil they're\nusing distillate so when you extract hemp the oil out of\nhemp it's going to first of all be a dark almost black very gummy crude oil\nand i i believe since this is so light in color they're not using\ncrude oil they're taking it to the next level through distillation\nso it's a lot more refined and so as a result\nthis product is not going to taste very heavy so i'm going to taste real quick\nand it has a good taste this is mint flavor\nand really it's got a refreshing taste you put put it in there you're not\ntasting very much hemp and you're tasting a mint\nflavor and so as far as taste goes it tastes really great\nin fact our product at green method farms we also have a mint product and\nthese basically taste identical let's go into price real quick\nuh we i have it pulled up right here on my computer this 300 milligram bottle\nwhich i bought you can get for 54. if you want to\nupgrade to the thousand milligram bottle which\nis kind of where people usually are at it's going to cost you 139\nand green method farms our product we offer a thousand milligram\nfor 45 on our website greenmethodfarms.com you can check the\nlink below if you want to look more into that\nanyway so these two products here if you got a thousand milligram purcha or the\nthousand milligram green method farms very similar uh in quality\nand very similar in taste this one's going to cost you 139 bucks this one is\ngoing to cost you 45 bucks so way cheaper and so anyway that's kind of\nthe review when it comes to quality taste in price now let's go to\nthe computer and i'll show you a little bit more in depth\nwhen it comes to quality and i'll be able to show you a little bit more\nuh the nitpicky when it comes to cannabinoids because here's something\nthat you need to understand um when it comes to the cannabinoids\nwhen it comes to cbd oils cbd is great right we know that it helps\nwith inflammation and with many other things but one of\nthe ways that the hemp plant and cbd oil that's extracted from\nthe ham plant works the best is through something called the\nentourage effect that means when your oil contains the minor cannabinoids so\nof course it has the major cannabinoid which is\ncbd when it has other minor cannabinoids in there like\ncbn uh cbc cbg those are the those are the big ones but\nthere's also other ones in there when it when your oil contains those as well it\nall works together better than if it was just a cbd product\ncoming from a cbd isolate or something like that where there's nothing else in\nit but cbd so if you have the choice\nbetween a cbd isolate product which has nothing but cbd in it or a cbd product\nthat also has the minor cannabinoids in it you're going to want the miter\ncannabinoids so let's go to the computer and we'll take a look at the coa the\ncertificate of analysis and we'll dissect that and we'll\nactually do a side by side comparison to green method farms versus\npure canna because this is kind of the benchmark because i'm the one doing the\nvideos and i'm the one that grew the hemp and i'm the one that extracted the\nham from the one that created this product\nso i will do a side by side i'm doing comparisons and i'm gonna be i'm gonna\nbe completely honest about it there are some cbds out there cbd\nproducts that are absolute crap they're scam\ndon't buy them uh purecam is not one of those this is a good product\nit's an expensive product but it's a good product so let's go to the computer\ni'll show you what i'm talking about okay so here we are on purecanna's\nwebsite and this is the page for their 1 000 milligram uh\ncbd tincture as you can see it's 139 dollars\ni'm gonna go over to our website real quick and i'm going to show you that the\n100 000 milligram full spectrum cbd oil tincture basically\nthe same thing 45 so let's go over to um their coa we'll talk a little bit\nmore about quality so this is the pure canna coa on their\nthousand milligram uh cbd tincture and you're gonna be able\nto notice here they have 30 39.4 so um\nyeah 39 milligrams per gram of cbd so you can see here on the graph\nthat's mostly what this bottle contains there is\na little bit .06 milligrams per gram of cbc\nso that's a minor cannabinoid there's point three\non well actually this is part of cbd product so never mind on that\num and then uh cbl point zero eight cbn point zero\neight milligrams per gram so very small amounts\nand then uh thc point seven milligrams per gram so a little bit more\non the thc side i wanted to point out that when it\ncomes to cvg it doesn't even register so there's no\ncbg in this let's go real quick to green method farms and\nwe'll do a side-by-side comparison okay so here's the certificate of\nanalysis for green method farms 1000 milligram cbd tincture again this is 45\ndollars if you want to order it at greenmethodfarms.com\num and we'll just look at the graph here because this points out the major and\nminor cannabinoids so we'll go to the big one first\ncbd it's got nearly 31 milligrams per gram\nso of course that's going to be the highest cannabinoid in the cbd oil but\nlet's look at the minor cannabinoids as well\nif you look at the delta 9 thc it is 1.2 milligrams per gram which is going to be\nhigher but if you look at the percentage it is\n0.12 so the legal limit of thc\nin the united states is 0.3 of a percent so we are\nwell we're almost one-third of uh below the legal limit so um\nit's basically a tenth of a percent of thc in this but thc is actually good\nfor you so i mean it's not a bad thing i'm just letting you know that it's\nbelow the legal limit but there is some thc\nin it and there is some thc in the uh purecanna\nversion as well it says full spectrum oil so going\ndown to let's see here um cbg we have a point two\nmilligrams per gram so um cbg at pure canada didn't even register so you're\ngetting more cbg in this and then um that's cbga just regular cbg\nis going to be one uh milligram per gram so\nway more uh cbg than the pure canna and then cbc\nis also a 1.1 milligram per gram so anyway the minor cannabinoids are\nhigher they're more concentrated in the green method farm so again my\nopinion this is going to go this is going to be because of the\nquality of the genetics the farming and the extraction uh process so let me\ntell you real quick what i mean by that so\npurecanna is sourced by farms in kentucky kentucky is on the 36th\nparallel and that's significant because the closer the 45th parallel\nthe better um in on our farm in central oregon we actually are on the\n45th parallel the reason this makes a difference is because of the light\ncycle the summer solstice around june 20th it's an 18\nhour to six hour light to darkness ratio and so when the days become shorter the\nplant the hemp plant decides hey the day's getting shorter it's time\nfor me to start flowering and that's when they produce the most oil so\nin central oregon you're getting a really dry climate which is great\nbecause you can rake it's got you know lots of sun the light cycle is great you\ncan regulate as much water and nutrients as you want\nthrough the drip line and so that's the reason i'm a little bit biased but i\nreally do believe that central oregon is a superior place\nto grow hemp compared to other places like kentucky\nbecause of the dryness of the climate and it being on the 45th parallel\nthe other thing that i want to mention is that uh\npurecanna uses a co2 extraction method where green method farms uses an ethanol\nextraction method now you probably don't know chances are\nyou probably don't know a ton about extraction this might not\nmake a big difference to you in our experience\nco2 extraction produces a real gummy and not as high quality of a crude oil\nand as a result it takes more through distillation to be able to have\na good product and i think that that might be either the genetics or it's the\ndistillation is the reason that the pure canna\nproduct has less of the minor cannabinoids\nin green method farms we use an ethanol extraction\nand in our experience ethanol extraction is a lot more clean of an extraction\nwe take our uh extraction to crude oil and then we water wash it which removes\na lot of the impurities such as fats and lipids and sugars and those kind of\nthings so that you're actually left with a pretty good\nclean crude oil and since that crude oil is clean to begin with when we take it\nthrough distillation it's just an easier process and i think\nthat you're left with more minor cannabinoids as a result so that\nis in my opinion starting with better genetics but also\nending with a more pure uh product cbd product that goes through\nthe distillation process they don't have to refine and pull out as much of the\nstep the cannabinoids like cbc\ncbn cbg as they do with pure canada so anyway both\nproducts i'm going to say are great um you're not going to have any problems\nwith the pure canada product i'm just saying and i'm a little bit biased\nbecause i'm the one doing it but i have spent\nthe entire process from farming through extraction to bottling\nand formulation so maybe you're wondering why are we selling our product\nfor way less when we could be selling it you\nknow if it's the same product as pure canada we could be selling it for 140\nwe've got two reasons for that one because we can we're a small family farm\nwe have 10 acres and uh and so we extract enough oil to\nbe able to produce enough oil to extract at our extraction\nfacility which i work for so we get a deal on that so\nbasically our overhead is just it's just not\nvery high we could charge 140 bucks for this product\num but we've decided that we don't need to\nand because we really believe in the medicine we want to be able to get that\nout there as to as many people as possible and not you know have to\ncharge the 140 so anyway if uh if you're interested in\nbuying cbd oil cp oil tincture i'm definitely going to say buy it from\nus because you're going to get a great product for a fraction of the\nprice if you want to spend 140 bucks this is a\ngreat product go ahead and do it pure canada\ni highly recommend them i mean this is a great product it's just expensive\nso if you want to get the same thing maybe even a little bit better of a\nproduct because of the extraction methods\nbecause of the genetics that we started with green method farms is the way to go\ngo ahead and click the link below to purchase uh 45\nfor a thousand milligram cbd tincture and charge 75 for the 2000 milligram\ntincture so still you're getting double the cbd and it's still significantly\nless than the thousand milligram here so\neither one that you want it's gonna be a high quality product we\nstand by it there's a 30 day money back guarantee if you're not satisfied with\nit and so if you have any questions about\nanything concerning cbd oil how to take it um the quality of it or\nanything about green method farms and our cbd oil\nin general go ahead and post those in the comments section below i will\npersonally reply to those um if this video has been helpful and\ninformational and please support us by giving\nus a like down there thumbs up and if you haven't subscribed to us at all\nbe sure to subscribe to the channel turn on notifications because i'm making\nmore and more cbd products uh product reviews and product videos\nso if you have any questions about that or want to see any of our videos then\nyou'll want to subscribe to our channel and be sure to notify so thanks again\nfor watching and make today extraordinary", "Qofq6bjOlh4": "[Music] hey guys Justin Ross here with green valley Nation I'm gonna give you a quick review of CB distilleries 1000 milligram full-spectrum CBD oil CV distillery uses American grown hemp that is non GMO not certified organic but it is third-party tested in each one milliliter dose of CBD oil you get 33 milligrams of CBD which is printed clearly here on the box see if you're still earning one thousand milligrams CBD oil uses a co2 extraction method they don't add any flavors to the oil itself they do use coconut oil as a carrier so that the product tastes like coconut oil and hemp plant so if the smell or the taste of hemp is not something you enjoy that might be something that you want to consider when purchasing this product see distillery 1,000 milligram full-spectrum CBD oil comes in this individually packaged in this nice bright orange box with CBD really easy to read across the top the other thing about this package is the milligrams of CBD per dose or easy to read right here on the front as well and each box comes with a informative pamphlet kind of gives you a little information about CP distillery itself and the product and how they extract the oil and all that the other thing I like about this is the label on the bottle matches the label on the box so if you lose the box no big deal so I'm taking CV distilleries 1000 milligram full-spectrum CBD oil for about six months now I usually take between 20 and 35 milligrams at one time I started taking it to see how it would help in my chronic back and knee pain and I noticed after about 20 minutes that I had significant reduction in pain and inflammation in my lower back and my knee I also take it in the evenings before bed to help me calm down from the day so that I sleep well all through the night and I don't wake up with any pain that's an added bonus so the things I like about CP distilleries 1000 milligram full-spectrum CBD oil is that it takes away the pain after only 1/2 I can also take it before bed and it'll help me sleep all night soundly and I'll wake up without any pain in the morning the other thing is that it's easy to fit this into my monthly budget the cons are the plant light flavor and the fact that I don't feel like it's quite as strong as some of the others that are in a similar concentration so overall if you're looking for a more economical high concentrated full-spectrum CBD oil and you don't mind a little bit of a plant flavor you can't go wrong with CBS tillery's 1000 milligram full-spectrum or CBD oil my name is Judson Ross and if you liked this review and would like more be sure to follow us at Green Valley nation for your most comprehensive review on hemp products [Music]", "A9JpHA3_c9w": "hello hello good morning YouTube go ahead what is the good word today thank you for joining me for the ones who don't know me I am the Connecticut medical marijuana critic what's going on Facebook play how are you again Connecticut medical marijuana critic here thank you for joining me as always it's nice to see you today I'm going to be doing another test on another one of the green Rhodes products this time this one is the green Rhodes broad-spectrum CBD 1000 milligram formula yeah that's right no you don't eat the whole thing you take 33 milligrams or 66 milligrams and give it to yourself a nice little convenient dosage the best and easiest way to do this let's see right here it's a gel cap I'm gonna put the product inside off the gel cap and then I'll put the gel cap underneath my tongue sublingual Bestway let it soak directly in mucous membranes you're getting the product outside of that how's everyone doing today what's going on Jake what is a good word over there in Facebook land you have our DJ core remember this one you can get you can order online or if you're local if you're here in Connecticut there's you know - posh City right there on the Boston Post Road and pick it up all the products all these green road products that I touch you can get right there I've got a couple users over and you - you've already no get my posters up over at Facebook let everybody know we're here now again as everyone knows when I do my test videos I only do a couple of songs but I do do some songs kind of past the time for us while we're chatting I'd say I'm gonna go right over into my favorite there's a little broken reality from Kevin MacLeod - good - of course I will touch this I'll get into it probably around the 10-minute mark good morning mark how are you my friend thanks for joining us little interface LaPlante what's up buddy [Music] [Music] few things heated up over here getting never ready [Music] coffee hope everyone had a good night good morning wayward bill how are you my friend thanks for joining us over their Facebook land as always man it's very nice to see you I hope wall as well eight minutes in I'm going to be starting this path within just two minutes [Music] [Music] that's was broken reality there's my promo - so the admit in change long so perfect this is fight or flight ten in itself [Music] [Music] well damn eyelash hopefully right neon good morning h7 how are you thanks for joining us over there in YouTube land I see I have 5 people watching over in YouTube land and so far only one person has has actually had a not what persons always are what is the word man what is happening [Music] [Music] all right okay there we are what's happening everybody today as I was stating do it attached this particular test isn't on another green roads product this is the green roads broad spectrum CBD 1000 milligram formula now as you can see plastic syringe absolutely good morning Ken it's another syringe now this one here is an oral dosage you know we'll get into that in a minute just for the ones who don't know daily dose CBD oil 1000 milligrams this new daily dose formula is the perfect way to enjoy CBD on-the-go the powerful daily dose CBD oil 1000 milligram formula is designed to fit into any busy schedule while still providing a high dosage of CBD that you're looking for the daily dose 1000 milligram formula tincture is a sublingual oil that is vegetable glycerin based excuse me infused with pharmaceutical grade cannabidiol CBD their broad-spectrum CBD oil is made here in America it's compounded by a licensed pharmacist with over 20 years of them in the business 20 years experience this daily dose formula is a high concentration of CBD each syringe as approximately they say 33 milligrams and concentration of broad-spectrum per dosage now just with a one's also and never heard me talk about this stuff their CBD oil is done in a five-step process and their five-step process is as follows they use a stain of certified organic cap its cultivated a process according to the highest industry standards now to produce the effective final product uninvited step plants meet our standards grown without pesticides or GMOs - you heard me say broad spectrum and you're like maybe what does he mean no problem got you covered CBD CBG cbn plus terpenes broad spectrum to extract the CBD from the hep plant beta is a supercritical co2 extraction process takes co2 to a low temperature under high pressure which gives its properties of both a liquid and a gas this allows them to extract all in the useful cannabinoids once returned to room temperature all of the co2 evaporates leaving behind only the purest isalus completely solvent free now they say although it's the most expensive excuse me it's although it's expensive its method is the industry's best practice for free solvent free extraction now they take that 99% cannabidiol the isolate it starts out as a crystalline solid they take that CBD and then they formulate it through their licensing compound with their pharmacists into all of their products now as you've heard me say it's the best vegetable glycerin base as at seed oil as the base for the product now all of their stuff is independently tested meaning third-party tests all real components are lab tested throughout the process the final products are lab tested for purity and potency with over 20 years experience they're licensed compounding pharmacist then transforms those five raw materials into their finished product now you can't go online you can purchase these products they have a website it's green roads world.com also if you're a local go to when I say local let me to me here you know orange Milford Stratford West Haven areas like that go to puff City right up on the Boston Post Road 874 Boston Post Road in Milford alright phone numbers 203 283 9606 he sells the full wide go on and ask for it or if smile his partner all right well let's see what we have so it open up again no I am NOT taking the thousand milligrams and putting it under my tongue no you shouldn't take this syringe and even if you just want to give yourself a small dosage don't do it direct under your tongue cuz it truly is kind of hard to regulate and you could give yourself more than you wanted to now you can get these glycerin cats arm almost anywhere health food stores places like that just take this put it right into your cap so not my fingers there we go all right into the cap nice and easy this comes out quick it is rather running so watch that and then just a little time yes I want my fingers hahaha our girl with each other over there do - laughs come on nah so yeah that's it literally I'm gonna talk you let it soak it won't take long before you start feeling it right away what's going on Raymond right away I am gonna tell you it tastes like [ __ ] [Laughter] it has a a funky funky taste to it hello Scott [Laughter] and judge come on quick haha right finger looking good hello Polly how are you thanks for joining us so yeah keep in mind got a funky taste to it not saying it's like overall bad I know I said it tastes like [ __ ] but III definitely tried worse tasting products three roads world.com for the product they do have a huge lied of greed roads products - they have oils they have CBD capsules they have CBD edibles to have CBD daily doses CBD oil for your pets I know a lot of people have asked me about this seaweed pain cream CBD bundles you could even go CBD terpenes CBD syrup they even have a CBD tea and a coffee yeah you heard that right kind of curious I'll be safe all right there's CBD decaf coffee line CBD standard coffee line and a CBDT line interesting they say their drinks have the ability to improve the digestive process increase energy in the body and lower the blood pressure additionally organic drinks have been linked to blood sugar control weight loss and lowering of cholesterol to receive these advantages one should use 5 to 10 grams of the hemp tea for a 1 liter of boiled water let it sit for about 15 minutes drinking heav CBD tea daily will improve your body immune system and help you sleep better at night interesting thank you for the share Raven I do appreciate it so of course I'm sure I'll be picking up some more of these green Rhodes products to test for everybody however this was the last of the ones that I had right now if you recall I had like five products total that I've done that is correct Scott I know right I said tried the CBT coffee but that is very correct Scott over and YouTube says you know I I have an answer to the D carb cannabis and coffee question chlorogenic acid and coffee helps break down THC and coffee also acts as an agent for the endocannabinoid system now as we know we've discussed this as well coffee does work in the body a lot of people don't realize it coffee itself is a natural accident when individuals have problems I often ask that Matt now you have a cup of coffee today oh no I didn't yeah give it a try also just so people know because ones whereas I might ask me about prices online through their website this product only goes for $10 I mean again you can't go wrong good morning Steven how are you thanks for joining us over there in YouTube land excuse me that's a good question I truly do not know if they would shut to the UK however if you contact them they are they are very good at responding quickly yeah I don't know where everyone is today Raymond well do keep in mind 87 that individuals bodies to process things differently some individuals who well some individuals who suffer from PTSD who have other issues are opposite of what a lot of people are when they smoke cannabis a lot of people will smoke indicas to help themselves calm down - calm down - get that sleep I know people who go to the sativa side because it does that same thing to them so you are correct in what you were saying there yes and you're welcome Stephen they do have a lot of money different products I have to admit their their shop the gummy frog was pretty damn good [Laughter] they also have a relaxed formula of gummy bears excuse me they also have their own it's basically like a fruit by the foot but it's a CBD it's pretty interesting ah they have called CBD sleepy zzzz they're literally in the shape of his e [Laughter] that syrups to add two things pain creams that you rub on I got k9 formula 2 which I do like I hate everybody well we have no more questions on this particular product I'll be shutting down this broadcast for the test give me two minutes - and - and I will be right back with compound concentrates and coffee for today i I understand Stephen believe me believe me I wish we would actually have you know well Connecticut is going for legalization we're gonna get it it's it's just been a process Oh coffee effects or panic attacks understandable Oh Kevin have you been here when we've talked about it many many many times I don't know if you've tried it on ground peppercorns unground peppercorns what anxiety or panic attack kicks up or you have those raised levels that some people get when they smoke one or two unground peppercorns pop them in your mouth as soon as you chew down as soon as you bite on them it's an instant natural chemical reaction it stops that panic attack likes to smell a ground being I have a feeling that's what you bet but I was just waiting for clarification on that one hello space Raglan how are you my friend okay just making sure I tell everybody about that because it truly does work now Facebook of course you guys know you got to give me a minute and then the stream will come back up you know obviously you're gonna have to click on the link there on my Facebook page YouTube hahahaha fantastic fantastic applied to here the peppercorns work for it is now as I've said YouTube you guys know guys and gals you don't have to go anywhere hang right there in the chat room and it's going to roll right over the new broadcast just got to come up so thank you very much for joining me today both Facebook as well as YouTube Lance I do appreciate the questions on the products once again green roads Worldcom for the prop for the company that makes it go to puff city out there and Milford and you can go pick the products up I'll see you in two minutes two minutes", "dBJqb6_TaHw": "Full Spectrum CBD vs CBD Isolate. Hi, I am Matt and welcome to another CuredByNature\nepisode - CBD Frequently Asked Questions. After such a long time of cannabis stigma,\nthe truth is finally out. Cannabis is very good for the human body. Most of the people know about THC - the cannabinoid\nIn the cannabis plant that gets you high, right? One other cannabis component has been massively\nresearched for the past 30+ years, because of its health benefits. And that’s CBD or Cannabidiol. And since CBD does not get you high or in\nother words, it’s not psychoactive the way THC is,.. and because US president Trump signed\nthe new Farm Bill in December 2018, you can buy CBD products almost anywhere these days. From local health shops to different online\nshops. And believe it or not, the majority of the\npeople prefer not to be stoned or high all the time. That makes CBD products ideal cannabis products. You get the benefits of cannabis but without\nthe high. Now back to the subject… Full Spectrum CBD vs CBD Isolate\nIf you’ve done just a little bit of research you know there’s basically 2 kinds of CBD\nproducts. Products made with Full Spectrum CBD\nand Products made with CBD isolate. First the Full Spectrum CBD\nIt’s also called Full Spectrum CBD Extract,... or Whole-plant CBD extract or FECO that stands\nfor Full Extract Cannabis Oil. It includes all of the cannabinoids found\nin the cannabis plant and also includes all the other components that get extracted out\nof cannabis flowers in the process. These other components are terpenes, waxes,\nhealthy fatty acids and chlorophyll. And you know what,... there are other components\nin the cannabis plant that get extracted in the process that we are not even aware of. But that’s a story for another time. So when we say “full-spectrum,” we’re\nreferring to a naturally extracted spectrum rather than a constructed spectrum. Now let’s talk about the CBD isolate:\nCBD isolate is just CBD. It’s just cannabidiol molecule isolated\nor separated from other cannabis compounds in the plant. Now to the big question:\nWhat to choose - Full Spectrum CBD or CBD Isolate There are studies that give scientific proof\nthat Full Spectrum CBD that also includes low amounts of THC plus other cannabinoids,\nterpenes, etc. produce what is known as an Entourage Effect. The synergistic relationship between all of\nthe cannabis components has been shown to increase the healing properties of each. But when it comes to CBD isolate,... even\nthough it’s fairly unlikely that you would fail a drug test or experience a form of “high”\nbecause of the low amounts of the THC in those Full Spectrum CBD products,... some people\nprefer to be on the safe side. So now you have the information you need to\ndecide... CBD Isolate vs Full Spectrum CBD My suggestion is always Full Spectrum CBD. Why? Well, when it comes to health I don’t think\nwe should hold back. This is a natural medicine and it just doesn’t make any sense not to get the full benefit out of it. If you got any questions simply ask in the\ncomments below or send them directly to our email: support @ curedbynature.org\nIf you like what we do, don’t forget to subscribe but most importantly Click the link\nin the description below and sign up for a fast track to a healthy life! I am Matt,... Thanks for watching!", "5jMNt_CagrY": "okay guys so I'm kind of doing this as quick as possible on my phone and I wanted to do a review for you guys and this review is going to be on the coin naturals thousand milligram CBD oil that's what it looks like I bought this because I was a marijuana user and I loved I didn't love the high that I got from marijuana I loved the palm relax feeling that I got from it and so I tried the CBD oil and it says that your if I can read it here adults take one full dropper approximately 20 drops or one milliliter one to three times per day tripping hold under the tongue for 15 to 20 seconds before swallowing wait three hours after initial use to see how the level of CBD may affect you now I tried this multiple times and think I did it for maybe a week and a half trying to see the effects that this have brought and I I suffered from really really bad anxiety to the point where I'll get panic attacks randomly and I've I passed out because of my panic attacks and it's a level of fear that happens especially when you know you got three kids if I am driving with my kids and I have a panic attack that could put their lives and serious danger now I do feel it coming on so I am able to avoid getting behind the wheel or I can call my mother-in-law or I can be like okay kids I need a moment can you go play for a little bit and I'll put the baby in her crib or in her playpen and I'll just like excuse myself to the bathroom or something for a few minutes so I could have my panic attack and it's not something that brings it on there I can't nail it down to something that brings it on but I do get it I get it at least three to four a day when I'm driving it I do get them when I'm by myself driving I do get him where I pulled over and I'll be getting the panic attack crying my eyes out just for no random reason and one thing that I am absolutely sure brings them on is being in large crowds I I get kind of freaked out unless I have someone with me and it's got to be someone that I can trust someone I actually have a mutual trust with and I've noticed that so far that person's like my mother-in-law or my fiance's uncle my fiancee obviously or like any of my family they can be with me and I am totally fine I'll get like a little anxious and I'll get in xiety but I don't get the panic attacks um they get even worse during pregnancy I've noticed they get really bad during pregnancy so back to the review the reason that tried this is I was hoping that maybe it would help with that a lot of people have told me that CBD it helps major with anxiety and stuff so I was hoping that this was going to help and unfortunately it did not I have tried to boost this up to 2,000 milligrams but I didn't know exactly how much stir like play with oh I don't know like at if you can overdose or anything on this I probably should have figured that kind of stuff out when you take it it was just a little dropper and yeah it just sits under your tongue I got the flavor spearmint because the place where we had gotten this uh me and my friend crystal a place where we had bought this I think they only had like lemon and something else Oh a lime flavored and they had this one those were the only three they had left in stock so I had gotten this because lemon or lime sounded horrible and yeah it doesn't work for me um I do believe that if you had like a lower level of anxiety maybe not severe anxiety like I do this product could do wonders for you and there have been multiple reviews here on feet or on YouTube on Facebook uh who have said that they've had great reviews and there's some nuts that they had bad and I just wanted to leave this on here and of course all my videos are unedited so I mean if I screw up you're gonna see it so yeah that is my review of the coin at rolls in my really awkward video so yeah alright guys bye", "s4LCzj5l69M": "[Music] have you ever wondered what exactly is meant by the phrase full spectrum cbd oil is there really any difference between a full spectrum product and say another type of cbd product let's take a look let me go ahead and remind new viewers to subscribe to the way of leaf youtube channel we deliver the industry's most accurate and up-to-date information on all things cannabis and cbd anyway back to the topic of what actually full spectrum cbd oil is it's really pretty simple cbd is just one of more than a hundred different compounds naturally found in the cannabis sativa plant a full spectrum cbd oil well contains pretty much all of these compounds a product like cbd isolate oil on the other hand contains just the cbd compound by itself after it's been filtered and fractionated off during the manufacturing process depending on what exactly you're trying to achieve full spectrum cbd oil can actually work better than a cbd isolate in fact research shows that when cannabinoids work together rather than isolated by themselves they're potentially more effective in terms of a therapeutic benefit this phenomenon is known as the entourage effect but we'll talk more about that later as far as what a full spectrum cbd oil actually contains they can include a variety of natural ingredients found in hemp and other types of cannabis these ingredients include things like phytocannabinoids essential vitamins and minerals beneficial fatty acids like omega-3s and omega-6s plant-based protein and fiber chlorophyll terpenes and flavonoids also it's important to understand that full spectrum cbd oil can come from both hemp and marijuana most of the cbd products you see for sale online and in places like gas stations and grocery stores are made from hemp that contains 0.3 thc or less full spectrum cbd oils can also be made from marijuana these oils have higher levels of thc but are only available in dispensaries in states that offer legal medical or recreational cannabis one of the most important studies relating to full spectrum cbd oil took place at the hebrew university of jerusalem in 2015. the study compared the performance of a full spectrum cannabis extract with one that contained cbd only and concluded that at least in mice the full spectrum oil was more effective for pain and inflammation in fact authors of the study claimed the whole plant cannabis extract was ideal for clinical use as compared to isolated cbd another great quote we like to use in order to describe the effectiveness of full spectrum cbd oil comes from dr ethan russo in a 2019 publication in frontiers in plant science dr russo's paper claimed that one molecule i.e cbd is unlikely to match the therapeutic potential of cannabis itself as a phytochemical factory in other words while pure cbd can be effective it appears that full spectrum cbd oil is the better option for therapeutic purposes do you have any more questions about what full spectrum cbd oil is is there anything that we left out feel free to join in the conversation by leaving a comment below also if you enjoyed this content and found it helpful don't forget to hit the like button and subscribe to the way of leaf channel", "MSzIYGWRXbE": "- [Narrator] You've probably already heard about cannabidiol,\nbetter known as CBD. It's exploded in popularity with claims of treating everything\nfrom insomnia to diabetes. - That's the only thing that would help me with my migraine headaches. - [Narrator] It can be consumed as an oil, applied to skin, or inhaled it as a vapor. We know CBD is a component of marijuana, but it's derived from hemp,\nusually does not contain THC, and won't get you high. The game changer for the\nCBD industry came when President Trump signed a farm bill legalizing hemp cultivation. One prescription drug\ncontaining CBD has been approved for treating two rare forms\nof childhood epilepsy, but the vast majority of\nwhat we know about CBD has been limited to personal experiences and unproven animal studies. - More often than not, things\nthat look good in animals, when you go into humans,\nthose effects aren't there. - [Narrator] According to a\n2018 Harvard Health Blog post, scientists say they still don't know much about how CBD affects the brain or which doses and\ndelivery methods work best. For example, if you put a few drops of CBD under your tongue, you\nmight consume 10 milligrams. But some researchers say you\nwould need 30 times that amount to reach a threshold\nthat can relieve stress. And since CBD products\nare primarily marketed and sold as supplements, the U.S. Food and Drug\nAdministration doesn't evaluate whether these products\nare safe or effective. That means if you buy a CBD\nproduct, you don't really know how much CBD is actually in the container. There's no denying the\nCBD revolution is upon us and the marketplace is buying in. However, there's still\na lot of TBD about CBD.", "wZfWq1ji9PA": "hey everybody I'm CJ with med Tara CBD you just purchased the thousand milligrams CBD medal tissue I'm gonna give you a brief rundown and show you how to use it it is important to notice that all of the droppers inside of the tincture bottles have graduated measurements to help you with your specific survey when full east java contains one milliliter of total liquid one milliliter of 1000 milligram oil is equivalent to thirty three point three milligrams of CBD we suggest you start with one full milliliter placed directly under your tongue and hold there for at least 15 seconds before swallowing wait 45 to 60 minutes to see for desired results have been achieved if you need to consume more it's okay there's nothing a psychoactive included in this product it usually takes people 2 to 3 days to understand what serving is best for them on behalf of everyone at Med Terra we would like to thank you for purchasing our product", "mY20TICyT8g": "what's going on everyone my name is chris here at CBD review lab and today i'm reviewing the savage CBDs 1000 milligram full spectrum CBD oil specifically their peach and pear flavor so savage CBD is based in California and they've been in the CBD game since 2015 and they carry a massive selection of products all of which are a third-party tested by SC labs so you know you're getting products that you can trust when I was looking at the certificate of analysis for this specific product the lab results showed that there's actually over 42 milligrams of CBD per milliliter in this product so while they market it had 1000 milligrams it's actually close four to twelve hundred and sixty milligrams of CBD which I'm totally cool with so the oil itself has a clear appearance to it and it has a nice fruity smell and taste with absolutely no bitterness where cannabis taste at all it is hands-down the best tasting CBD oil I've tried so far and I've tried quite a few CBD oils so my dosage for this product has been two milliliters which according to the certificate of analysis is over 80 milligrams of CBD and I've been very pleased with the results I find that it doesn't relax my body as much as other CBD oils but it does seem to relax my mind and it makes me very sleepy I don't know if the CBD strain that they use to make their products is a sativa but I seem to feel it more in my head than in my body which I'm actually a big fan of I love getting that body high from CBD but this is been quite enjoyable as well so as far as price goes this Teamster runs $85 if you use the discount code CBD review lab and if we go off the lab results which say there's 1260 milligrams of CBD in this product the price comes out to under seven cents per milligram of CBD and I consider 10 cents to be average so it's below average so to summarize I think savage CBD offers a solid CBD oil it works well and it's under ten cents per milligram so I've got a link to their website in the description below and don't forget to use the discount code to save some money if you end up trying them out so thank you so much for watching I hope this video was helpful if you have any questions please leave them down below I hope everyone has a great day peace", "Enyvm71R2S4": "CBD oil has many benefits. One of its most important benefits is\nbalancing the body's endocannabinoid system, the endocannabinoid system. It's one of the most important\nsystems in the body for building and maintaining optimal health. It exists throughout all of the\nbody's 11 physiological systems. It is responsible for creating\nbalance or homeostasis. In each of these systems, every\nsystem of the body needs to be in a state of homeostasis for\nyou to experience optimal health. CBD does not fuel the endocannabinoid\nsystem, but rather worse like motor oil. Ensuring that the endocannabinoid\nsystem functions smoothly by ensuring that your endocannabinoid system is\nfunctioning properly, you'll experience a state of balanced wellbeing. CBD also supports a healthy gut. The endocannabinoid system interacts\nwith the body's microbiome. CBD oil increases the number of\nthe body's own endocannabinoids. These endocannabinoids play a major role\nin regulating the gut bacteria present in the microbiome in the ECS is boosted. It functions better and also improves\nthe functions of the microbiome. CBD also shows promise to creating a\nhealthy gut barrier function, gut barrier function, poison, important role in\nsustaining a healthy metabolism, promoting mental health and supporting digestion. CBD oil also promotes a healthy\nand optimistic mental state. The way it interacts with\nthe endocannabinoid system and five HT one a receptors. Everyone goes through stages where\nthey may not feel their best. It is possible for levels of serotonin\nto get out of balance, resulting in changes in mood by stimulating these\nreceptors and the endocannabinoid system. CBD holds promise in improving the\noccasional mood and supporting a positive state of mental health. CBD oil is known for its ability\nto improve and increase sleep. One study compared the sleep\nof people who had taken CBD. Yeah. To those who had taken a control study,\ndiscovered that those who had taken CBD slept longer throughout the night. Here's what you need to remember\nabout hemp oil and CBD oil. CBD oil and hemp oil are two different\nsubstances that come from the hemp plant. It contains high amounts of Omega threes,\nmagnesium, vitamin E, and protein. It also shows the potential to\nimprove the look and feel of skin. Hemp oil does not contain\nsignificant amounts of CBD. CBD oil comes from all\nparts of the hemp plant. Including the flower. She was promised to promoting optimal\nhealth through its interactions with the endocannabinoid system and various\nother receptors throughout the body. Last important thing to remember is that\nwhile a bottle may be labeled as hemp oil, CBD oil, or cannabis oil, the actual\nmakeup of what is in the bottle may be different than what we've mentioned here. It is important to check the\ningredients and look for third party lab test results to determine\nwhat is actually in the product. You are purchasing both\nCBD oil and hemp oil. Okay. Powerful hemp supplements that can produce\ntremendous benefits for anyone taking.", "3o5Au3HyWMQ": "on my way old smoke and falling and falling then turned into rain the rain dried out but the Sun shone against the flowers blossomed in the grass girl the mercury rose and dropped to the face when Darth [Music]", "ngWuODwllSs": "[Music] each CBD product that we carry comes with a standardized dosage the dosage of CBD for the oil that we carry is twenty milligrams per ml for a hundred and fifty pound person the daily dose of CBD is basically twenty milligrams or one full dropper inside this bottle is a glass dropper with a line indicating the ml or CC mark so it says milliliter that milliliter mark indicates that's the 20 milligram dosage and for anybody who weighs more than 150 pounds you can adjust the dosage upward [Music] you", "3AkjvwPweiM": "[Music] science tells us that the effect of cbd in the body has a bell-shaped curve meaning that taking more of it doesn't mean that you're going to experience a higher effect the best practice is to start with a lower dose and slowly increase until you find the dose that is perfect for you the first step is to find the total cbd potency of your tincture which weed is closed at the bottom of the front side of the tincture bottle we suggest that you take advantage of our graduated droppers which offer four different measurements a full dropper means that you're taking at least 16 33 or 83 milligrams of cbd in your toes for three quarters of a dropper you'd be taking at least 12 24 or 62 milligrams of cbd in your dose for half a dropper you'd be taking at least 8 16 or 41 milligrams of cbd in your toes and for one quarter of a dropper you'd be taking at least 4 8 or 20 milligrams of cbd in your toes if you're new to cbd this is probably a great starting point you can take one to two full droppers daily in the morning and before going to bed shake well before every use and remember as with any other supplements to consult your physician before using our products", "_iakycoUmLU": "today we're doing the pure medic an extra strain pain relieving bundle I have in my left hand to solve thousand milligrams solve a solve solve bomb however you call it it is a topical use for external pain this one the main ingredients in this I have to read you the list full spectrum CBD sweet almond oil coconut oil beeswax shea butter lavender essential lavender essential oil natural vanilla extract all natural all organic smells great feels great it's a grainy texture you can tell that it's not some weird cream or some weird balm with these unknown ingredients you can't pronounce almond it's vanilla it's CBD it's a great combination I like it because you only have to put a small dollop you can see the product here see where I took a huge scoop it's pouring outside so I took a scoop you just have to apply a little bit to wherever the targeted pain is this is not meant for a really dry or achy skin it's it's for pain if you have pain and anywhere on your body it really helps with the with the relief and that's the external side now the internal I would use this this is their 1000 milligram tincture they have teachers up to 2,000 milligram but 1000 milligram gives you about 33 milligrams per serving so in the morning when I wake up I take the dropper out squeeze it under my tongue swish around for about 45 seconds and then I ingest it and this is the mint flavor it has a nice subtle mint flavor I like it a lot that takes care of the internal aspect it allows you to go by your day without having much of an edge you feel way more relaxed and again this is 33 milligrams per serving so it's high enough to keep your daily dosage at about what you want someone between 30 to 50 milligrams depending on your your dosage and if you've been taking CBD in the past if you have any type of can take of the word but you built up a tolerance if you have a tolerance to you're going to need something stronger so this allows you to take one dropper in the morning you're done your your dusters is set now I really like the combination of the two products I think the internal external factor is very important for any type of natural product so this takes care of that for you their website is very easy to navigate they sell in bundles which is which is accurate it's way more accurate even if you struggle from stress or anxiety to have an external cream as well that gives you your body something to to relax so the products here they have tinctures topicals and bundles I again got the extra strength bundle I'm really happy with it when you go to their website they have a little plant you click the plant and you can chat live with them I asked them a bunch of questions before I purchased they have a lot of reviews for each product so you can go online and read the reviews you can contact the team to ask them anything about their products in the footer on the very bottom if you scroll down you'll see they have tons of information here they have their third party lab results they have a Learning Center they have an Information Center they have so much information for you to learn that it's really a great site because they offer that transparency and the quality of the products forget the transparency for a second if you just want to talk about quality this solve is one of my favorites in the market actually there's no additives that you can't pronounce it's just a mixture of organic products all natural ingredients and their directions say apply liberally over the desired area and gently massage into skin it's very true once you do take it out you do kind of want to rub it in a little bit and then you'll feel the relief almost immediately externally from from whatever your your pain is so again you can go to their website learn all the information you can contact the team they're on social media so you can ask them any questions there you can comment or call there's an about Us section where you can learn all the information there's tons of lab reports for each product there's again bundles you can purchase I like the bundle packaging it's just easier to get started and everyone looking to get into CBD is looking for some type of relief this adds a full 360 really if you are internal and external again all of their products are all-natural non-gmo 100% tested you can scan the qr-code if you do see these in a physical location you want to learn more here you can see that there's a QR code on the bottom of the bottle you can just take your phone and scan it or you can go to pure Medi kana below this video there is a link and a coupon code use both try the maximum strength let me know how it goes let me know if you're using more than one dropper per day if you're using I'm using the the solve once post-workout just rub it in get a little bit of relief let me know if you're using it multiple times throughout the day how it works for you what effects you feel don't forget to click the link below go read the reviews read their lab reports talk to the team comment below if you have any questions thank you and have a great day", "5bfR8e9hdD4": "[Music] it won its Ivan kept agile calm here to bring you what will ultimately be part one in a multi-part series in my experience ultimately with the uncanny full spectrum CBD oil so I mean probably just lost your mind you're like what drugs yes CBD is absolutely a drug just like caffeine in a plethora of other things ultimately drug being something some sort of substance that is going to either inhibit or promote some sort of chemical reaction in our body which is going to give us ideally a desired effect so to that in like 30,000 foot view what does CBD where does it come from all that stuff lots of misinformation confusion with respect to it because we have cannabis and then within that we have hemp and we have marijuana marijuana of course being THC based the drug that gets you high THC and then hemp on the other side though industrial hemp which while it does have THC that drug component of marijuana they don't want thinks of over here on the side of hemp it's like 0.3 percent THC comparatively to marijuana which spans anywhere from like five percent up to like thirty percent THC significantly more so two totally different things but unfortunately hemp has been demonized for a long time because of basically back in the 70s with Nixon and the war on drugs cannabis gained turned into a Schedule one narcotic and all these other things with a controlled substance act and our war on drugs which is arguably gone as well as our war on like poverty and obesity considering we can't even keep drugs out of maximum-security prisons but I digress finally came full circle with the farm bill in 2018 which removed industrial hemp from the controlled substance act and put it over in the domain of the FDA Food and Drug Administration now that industrial hemp is easier to farm more and more companies are moving into the space of creating CBD oil can a boy do I don't know how to pronounce it but CBD based products with that there's more and more research going into you CBD both with kind of the properties as well as effects benefits things along those lines all kinds of clinical testing so to that end one of the companies that's entered the space is uncanny veteran owned company and per their site their mission statement is to be the leading voice of advocacy for CBD in the military and veteran community provide the most accurate information and comprehensive access to research in the industry to reverse the Department of Defense ban on natural CBD supplements with education campaigns in political action in order to allow access to those who have no alternatives provide the highest quality most trusted products at a competitive price I think that's pretty cool having said all that what does CBD do well start with what it doesn't do it doesn't get you high again 0.3 percent THC so if you want to smoke some industrial hemp you would probably die smoke inhalation before you ever felt the effects of THC which is the drug component of marijuana so it doesn't do that what are potential side effects of it hasn't been used in documented so there's not like tons and tons of evidence but the one kind of side effect that it looks like there is potential is basically interfering with prescription drugs that someone's already on so putting that stuff to the side what are some of the benefits of course can't make any claims because I'm not a doctor and the FDA has to approve drugs we know they can be trusted because the head of FDA is pretty much like a revolving door to the Board of Directors for like Monsanto and all your pharmaceutical companies that's what has it been shown to do well there I've been clinical trials with use for treating epilepsy and beyond that kind of this really broad spectrum of use whether it's helping with sleep-like altima sleeping disorders stress anxiety depression not to mention essentially kind of those symptoms of like PTSD and then on top of that basically other things whether it's kind of inflammatory diseases like within the body or even treating Alzheimer's all kinds of different uses that people are kind of dipping into with respect to research and CBD which brings us to the question of why am I taking CBD what am I looking to get out of it well I don't have epilepsy don't think I have Alzheimer's I don't think I've PTSD but everyone's looking at the world through their own lens like where do you even start trying to define normal I will say largely in part because of basically my journey and where I'm at with Kip Adger entrepreneurial pursuits there's absolutely some stress in my life and with that probably some anxiety and like honestly sometimes I don't sleep as well as I'd like sometimes I wake up don't get as restful sleep as I would like so if it can pretty much do anything for that that would be amazing not only for me personally the bigger picture for me is basically help me be a better father to my boys if I am stressed if I don't get much sleep that basically translate into me not being as patient as I would like to with my boys so I don't know we'll see what it does for me one of the other really important factors with respect to CBD from on canna that I've looked into doing my due diligence is the way it's made so it's produced from industrial hemp more importantly though from organic hemp why is that important well if you take something and you concentrate it the last thing you want is like concentrated pesticides like I don't want to drink roundup not good so this is made from organic industrial hemp on top of that third-party testing to actually verify it it's purity all those things and overall just even vetting them through Instagram follow mine Instagram and the overall message that they basically pushes to live an awesome life like that's it like that's at least that's what I draw from it and I can get behind that like absolutely so with that I have two of these bottles probably enough to get me through probably about two months also came with a handy dose charts right on the front of it each individual's dosage is unique dosing tips start low work your way up take one dose in the morning one at night monitor effects adjust adjust doping doping adjust dosing as needed and yeah basically give you days of the week weeks through the month and PM all that stuff so you can keep track and kind of figure out find the sweet spot for yourself so what am I going to be doing well I'm gonna be taking this you can take it with food or under the tongue I'm gonna probably just take drops under the tongue end up ultimately revisiting it probably in about two weeks maybe a month and we're in there see where I'm at as far as my dosing like what's kind of working for me and where you visited at least once if not twice more like as I go through essentially the product and kind of my takeaways at the end of it if you want to join me on this journey that is unknown at this point you're welcome to they actually reached out gave me a discount code if you guys want to pick some up and yeah ultimately I'm excited to try it and see what it does for me but as always thanks for joining us to keep badger calm look forward to seeing you next time [Music]", "8AjfOxhmjcM": "how much CBD should I take when starting out with CBD many people want to know what's the best amount of CBD to take it depends on what you want to achieve each person is unique and will experience different effects CBD takes time to build in the body much like some vitamins you can take a small amount every day well you might not notice an immediate effect over time you should begin to detect more balanced calm and peace of mind in your life some people may notice a more extreme difference than others imagine someone who is deficient in vitamin C taking a vitamin C supplement will create a radical change in their health CBD is similar to a vitamin and that it helps to maintain and support overall health if your endocannabinoid system is depleted or imbalanced taking CBD could produce tremendous changes more quickly than someone who has a healthy endocannabinoid tone if you're already healthy CBD may not be noticeable right away what your friends may take a high amount of CBD and notice immediate changes you may not need the same amount the following is a general guideline a good way to start is with the mild range take the amount recommended for your weight not feeling anything within the mild range if mild doesn't work for you it could be good to reach for a higher dosage and try out the medium range go for the high dosage if you haven't noticed any changes in the medium range some people take more than 100 milligrams of CBD each day it all depends on your health and your body experiment to find out what works best for you how often should I take CBD there are three main schedules that people use to take CBD once or twice per day every two to three hours so that they feel the effects throughout the day and hourly micro dosing for CBD oil we recommend starting with one quarter drop daily during the first week moving up to one half a dropper during the second week three quarters of a dropper during the third week and a full dropper on the fourth week for CBD balm it's suggested to apply a healthy amount to the area where you are experiencing pain dryness or stiffness every six hours for vaping CBD you should start with three normal inhales and wait 30 minutes to fully feel the effects until inhaling more for edibles and soft gels start with one shoe or one capsule every 12 hours so what is the right amount of CBD to take there's a few key points to remember when you're determining the right amount of CBD to take remember to start slow and work your way up there is no right amount of CVD to take each person is different you can use our chart as a starting guide until you figure out what works best for you enjoy the process and the wonderful calm and peace that CBD can bring into your life [Music]", "oACmVBbLN7M": "[Music] hi my name is Jennifer Dixon with green valley nation and today i want to talk to you a little bit about the Seabee distillery 2500 milligram full-spectrum CBD oil at this level of concentration it's probably best for folks with more severe symptoms that are looking for natural approaches to helping them manage those symptoms in each one milliliter dose you get 83 milligrams of CBD the Seabee distillery 2500 milligram full-spectrum CBD oil is a co2 extracted non-gmo non certified organic u.s. grown hemp product because it's a full-spectrum product you get to experience all the benefits of the many compounds found within the hip plant sometimes this is known as the entourage effect let's talk a little bit about the packaging and what you get when you order the Seabee distillery 2500 milligram CBD oil they recently revamped everything and the new color scheme is pretty neat coral but what's really cool about the new packaging is that you see the dose right here in front which contrasts pretty well with the coral color so you know exactly what you're going to get each time you take one milliliter which is their suggested serving size another cool thing about that this particular new product is that on the side it actually tells you how to take it because sometimes there is a little bit of confusion on how you administer the supplement when you open up the box you're gonna find your little bottle it's 30 milliliters of the full-spectrum CBD oil and then you'll also find a cute little pamphlet that helps to educate you a little bit on CBD what's in the product how much you get for a couple of drops and things like that you're going to notice that it's a it's a dark amber color and that's because it's a full-spectrum full-spectrum products are usually a little more dark and a little more plant like let's go ahead and try it since this is so concentrated I usually don't take a full dropper that's just too much for me so I'm gonna take a few drops I'm going to put it underneath my tongue and then wait about 30 seconds right off the bat you're going to learn two things one this does not taste awesome unless you really love the earthy plant like taste 2 this is really strong a little bit goes a long way you're gonna find within about 15 to 30 minutes that you're calmer you're able to focus a little bit and any residual pain that you have this stuff will knock it right out I don't take the full dose because it is so strong but my husband does and he loves it one dose will that last him basically all day 8 to 10 hours another really cool thing about this product is it'll help you to go to sleep and stay asleep because it is so strong let's talk about value here this is a very concentrated product that comes in far below other competitive prices for similar concentrations it still is a little bit on the higher end if you're on a tight budget but if you do have severe symptoms this is a really great way to manage those symptoms and not break the bank what I really love about the Seabee distillery 2500 milligrams is that a little bit goes a long way if I had this bottle all to myself it would last me forever because I never take a full dropper however my husband is constantly taking mine so it doesn't last quite as long there are 30 doses if you do one milliliter at a time so that's still a pretty good amount and it lasts you all day and it helps you to go to sleep the thing that is not so awesome about the Seabee distillery 2500 milligram is that it does not taste very good if you are very sensitive to strong earthy flavors this may not be the product for you because it is both strong and very earthy flavored the other problem with the Seabee distillery that even though it is a very good value still is expensive if you are on a tight budget if you can afford this this is awesome it's the most concentrated you can get for the money but it still is rather expensive so the CB distillery 2500 milligrams it's really easy to read it's very clear you know exactly what you're getting and it is a good value for the money you get a non certified organic product non-gmo American grown hemp product at a really good value thank you so much for watching again my name is Jennifer Dixon with green valley nation if you liked this review please be sure to subscribe to our channel for the most comprehensive library on hip products you can find thanks and see you soon bye-bye [Music]", "51WvMReLwYI": "hello everybody yeah we've been doing a little series here and doing a little education on CBD since it is all the rage right now and you know now just power right so we all know you can go down to the local video store and buy a bottle of CBD oil so there are reasons why we really want to be informed on what to buy where to buy it what to use it for when not to use it so many things that we really need to have a better understanding of so I just wanted to come on for just a few minutes here um hey Linda hey Kelly good to see you on here be sure to ask questions in the comment section because if I can help clarify any of this for you I am so happy to do that so I wanted to come on today and talk a little bit about broad spectrum CBD oil and why you might even care about full spectrum or broad spectrum or CBD isolate we hear all of these terms but often when we find ourselves in the grocery store or the video store there's nobody there to help us understand what really does matter and we are putting this under our tongue so you may not realize this but when you put something under your tongue it's going right into your bloodstream it's not getting the benefit of being filtered by your kidneys and your liver in that process so you really need to think about that you know before you just take something so I just want to help you understand what to look for how to understand these different terms so that when you are getting ready to purchase you have that opportunity to make an educated decision so first of all the ABCs right um a a means all of it the whole plant right the a a plus version of CBD oil in the a plus version of CBD oil this is our 1500 strengths full-spectrum CBD oil um hemp derived so a quick little mini lesson this is we're talking about the cannabis plant that confuses a lot of people that makes you think we're talking about marijuana we actually are not talking about marijuana the cannabis plant has several different species that exist beneath cannabis so the same way that the you know the cat kingdom has lions and domestic cats and tigers right so there is a species up here called cannabis a genus and it has plants underneath it that are cousins like marijuana and hemp so they're not the same plant although they do come from the same parent plant we're talking about hemp so marijuana on the marijuana side of things high-end THC naturally low in CBD hemp on the other hand high in CBD and many other phyto cannabinoids low very low naturally with THC so really important distinction because they have completely different mechanisms of action within the body so to understand now if we're talking about hemp derived CBD which is fully legal federally legal across the entire United States full spectrum is entirely federally legal as long as the THC is below 0.03 percent so that's important that this full-spectrum still has less than that in it in terms of THC but the full spectrum the a of the ABCs a is all of it all over the plant the stems the seeds the everything that's in it the phyto cannabinoids a THC the CBN the CBG the CBD all of the properties of the plant it produces what's called an entourage effect and what that means is at plant simply works better when it's kept in its natural state it's not being pulled apart and made for use in different in different things this is all aspects of the plant all the cannabinoids all the terpenes everything you could possibly want from that plant is here in the bottle so that's full-spectrum if you have health challenges if you want to stay healthy and keep your body from being inflamed and fighting off the toxins in the environment you want to have this in your diet whether you feel you have a health issue or whether you don't inflammation is a powerful thing we want to keep inflammation down in our bodies that's really important because everything out there is making our bodies acidic which is creating inflammation so that's your sugars your toxins or alcohol your cigarette smoke all of those things are creating a toxic environment in our bodies that are making our bodies acidic that acidic nature is creating inflammation and the inflammation is leading to their challenges health challenges so the primary mechanism of action of CBD generally is to lower that inflamed situation in your body that is the major thing that it does on a gnat in a natural way so really really really great lots of benefits whether you're sick or whether you're healthy is something that everybody should have in their diet both spectrum the whole entire plant everything that's good about it is in here it the 1500 is the most powerful strength that we have um you don't always need to start with that sometimes you can find a sweet spot that's less less strong than that we do have everything from the 500 strengths is 750 strength and the 1500 so many different strengths what we do is try to help you find your sweet spot you can figure out what strengths addresses the challenges or brings you into your best way of feeling from one day to the next so full spectrum remember that it is the elite it is the best way to get this plant into your body to do the best work that it can do a challenge with full spectrum is that in that natural plant there is naturally a small amount of THC now that THC does not give you euphoric feeling there's not enough of it in there to give you that high that euphoric feeling that you would get if you were using marijuana so whether you wanted or whether you don't you're not going to get it if you get something other than a full spectrum a full spectrum has everything in it so the challenge is if you're drug tested and your company will test you spontaneously to see if you have THC in your system if you're taking full-spectrum CBD there is a great chance that you will show up testing positive for THC it really depends on how fast your body metabolizes its THC so as you use your CBD oil if you're often men have less some less trouble with this if you're active if you have a low amount of fat on your body it tends to let go of the THC and metabolize it quicker but if you are like me and you have a little extra soft cushion on your body it holds on to that THC a little bit longer so even though it's a small amount it could show up in a drug test so we live I live in South Carolina and THC in your blood on the drug test is not a good thing I'm lots of people could lose their job on that so you cannot should not I would not recommend if your drug tested for you to take a full spectrum CBD oil so the a is out right the all of the plant not an option for you if your drug tested so the next thing your mind that you could have that is really strong and powerful and has all the benefits of CBD is what we call broad spectrum broad spectrum is all of the plant - the THC so it has a turbine terpenes it has the CBG the CB and the cba the CBD and that all those great cannabinoids that you need that will help you with all of those issues that you might may have going on in your system or to prevent those issues no THC so our company has just brought that on board and we now have a broad spectrum option for people who are typically drug tested on your jobs so just to make sure that you get as much of the benefit from this powerful plant as you can without the THC prior to that and another option that you may find in the grocery store that we will no longer be offering but you may see it is what's known as a THC free CBD isolate a CBD isolate is just that it is only CBD so when you pull the CBD out of the planet you're leaving behind the terpenes the fight of other phyto cannabinoids and the THC and you're getting a pure CBD isolate so it has nothing but that and your carrier oil ours is hemp seed oiler was hemp seed or a cold-pressed hemp seed oil so we won't be offering that at hemp works at all anymore because broad-spectrum is such a better and more effective option for people who need to submit to a drug test and pass it so for those of you in South Carolina who would love to try that and your drug tested this is a very safe way to find out the benefits of CBD oil with the broad spectrum so there's all that all of the plant the a is all of the plants full spectrum the B is broad spectrum although the plant except THC and the C is CBD isolate just CBD so you're reducing in potential efficacy as you go down that list staying at the top is going to give you the most powerful version of the plant and its best in its best version moving down is getting you safer and safer from passing a drug test and making sure that you don't have that THC in your system a fuse quick things as I close this out because I don't want to make this long I'm not seeing too many questions I see Alex on here Mary's on here yeah so a few things at the end to close out basics right then you need to know when you're choosing a CBD oil first of all you want to know that it is grown in a US farm you want it to be non-gmo right you want it to have some regulation in there so that we some people aren't just growing it in their backyard really important to have a farm that you know and trust really important that it is third-party tested we do not want the company testing its own product so often the ones you find on the Shelf out there they've tested their own product it would be like me telling you how cute my granddaughter is of course she's cute to me I'm just keeps everybody because she's just cute but if you really want to get an opinion on something you need to get a third party involved so third party testing is crucial with CBD Oreo you need to have access to those labs so that you can in fact see that there are no metals or toxins in there so having some type of a code like we've got a QR code on the back that you can scan so that you can look at your lab work for your lot number that way you can confirm that what you're putting under your tongue is safe and clean and pure and has no THC if in fact that's the one that you that you're wanting to get so really really important that there's a third-party testing going on they're really important for it to be co2 extracted the way they pull that CBD out of the plant and make it available for us is really important and there are some very inexpensive ways to do it and the problem with those inexpensive ways is that it leaves traces of of chemicals in the system the oil that they used in the breaking down process and it also harms the oil makes it less effective so even though co2 extracted is more expensive it is much more effective and safer so that's why we really think that's important there should be minimal ingredients in your bottle when you look at the back of your bottle you should have a nice you know official thing yet we've got our hemp Seal of Approval here we've got a QR code and then you know what you would expect to write the Supplemental facts and information when you look at the ingredients on your bottle it should have no more than three ingredients preferably two really what we've got is cold pressed hemp seed oil CBD rich hemp extract and if you need a flavour we've got like a peppermint extract or a cinnamon extract if you really have a hard time with the taste although it's a really mild taste but minimal ingredients the more ingredients you have in that bottle the bigger risk you're taking and the safety of what you're putting it so minimal ingredients is really important what we offer that we think is really important is a 60-day empty bottle guarantee on our products so you try them it takes some time to titrate to find your sweet spot use it for a couple months you know work with us let us help you find your sweet spot and then after two months if you haven't seen a difference return your empty bottle no problem no questions asked you'll get a full refund so that sometimes it takes time to figure out you know if you've got major challenges going on in your system it takes a little while for that oil to get in there nd to get to the receptors and do the job it needs to do so you've got to give it time it's not always a you know fix it quick kind of situation sometimes it takes a little bit of time to get to something that you've been building up in your system for years for a lifetime really because if we haven't really been exposed to this prior to now in a way where we could get it like this so let's see a lot of questions on here but I know I've dumped a lot of information your way I hope this is helpful let me know if you're interested in trying some of this if you haven't tried it yet let me know I'd love to introduce you to this product I'd love to make sure that you get introduced to a high quality product and I'd like to help coach you in the process of finding the right amount for you and how to address the challenges that you may have or avoid the challenges that you may be wanting to avoid with this important and powerful supplement so I hope that's really helpful I remember full-spectrum has all of the stuff in it full spectrum all of it the entourage effect the a+ version is full spectrum be broad-spectrum all of it except the THC turkey hides all of that great stuff beneficial supplement no problems with passing a drug test which is really important and then CBD isolate nothing in it except CBD and the carrier oil so no THC but also none of the other cannabinoids or terpenes are in there either so min you may find it a little bit less effective than the other than the a or the B alright so I hope that's helpful have a beautiful evening reach out with any questions that you have share this if you think it's helpful for anybody and send them my way if they have questions I'm happy to help you out have a beautiful day love you uh take care bye bye", "z_1O_h6zOYI": "there we go hey what's going on everybody we are reviewing koi naturals CBD oil now if you are not 18 years old please exit the video but if you are 18 years old then welcome to my bedroom now I know in a lot of videos I'm like making them in different areas we'll just bear with me because I'm very spontaneous when I record so I like to record in a lot of different areas as you can see I was just playing my xbox one if anybody has an Xbox one and they want a game out put your comment below now let's move on so we are reviewing koi naturals CBD oil now I know what you're thinking oh this is the stuff that goes on your tongue and you can put it in a vape no stop right there people you cannot put this in a vape this is for your digestive system only okay let's reiterate this digestive system mouth orally only not Lumley orally alright now that we clarified that I would test some but this is pretty much empty I used this for years and of course that just goes to show this is a definitely childproof cap child definitely proof cap which is another thing I like about this company not a lot of stores sell these so if they do then you're in luck I actually had to order this bad boy online okay so this is 250 milligrams they go all the way up to like a thousand milligrams if not more I don't know I don't need to be overdosing on this kind of stuff but you know so child proof proof lock cap definitely a plus but other than that let's talk about the product so positives of this childproof cap I'm sorry I keep stressing that but I'm not about to stress it enough childproof caps are the way to go people I do not know a lot of things that have childproof caps nowadays and your kids can get into them like what's going on with that this stuff can be digestible but not to kids so we need to make a petition to start having more childproof caps and they're like oh you got to be responsible parent you know what kids can get into anything so shout out to the moms and dads with kids that are watching this video moving on koi naturals has great tasting stuff there's a lot of CBD oil out there that you taste it you kind of get this like a waxy slimy feel and it almost tastes like your how do I put it like you're eating like some sort of like starburst now I know starbursts are juicy and they're delicious and wonderful and hey what am I talking about what I'm talking about is that kind of feeling that you get I'm not sure how to describe it I don't know I've always felt starbursts to be chalky so anyway moving on it does not give you a really bad taste in your mouth this flavor is lemon-lime clay natural I have to say hands down not only tastes good but I wish I could compare we'll do that in another video it's so it's so like liquidy and this costed like $40 you walk into a shop and I guarantee a bottle this side is gonna easily cost you like a hundred to one hundred and fifty dollars excuse me it's very amazing it's cheap it's childproof cap it's honestly I couldn't have asked for about our CBD oil so the the directions of it and let's just let's just put it down here when you look on the back of CBD oil and look on the back of all these seedy BD products there's so many different chemicals that go into it and the reason why I say chemicals is yes I believe that they're natural and you know they can help you better than like vicodin or something like that abso-freakin'-lutely Viking it this stuff is not gonna make a make you addicted to it and be make you like hallucinate or drugged so I absolutely say go with CBD if you're in pain or anything along those lines over taking a vicodin or something this stuff helps you with pain headaches anything that you wanted to that involves your body now as I was saying the ingredients on this bottle full-spectrum candid can I bid all the hi spell it I spent it is that how you sound it canada Badal blend natural lemon line extract in coconut oil that is it people that is all they put in this full spectrum can above Badal be dial the dial but little blend natural lemon lime extract in coconut oil that's it I literally have done this is my third review and this has the littlest amount of ingredient in it in everything that I have been reviewing and you ingest this so it's great childproof lock the consistency goes down very smoothly I don't know if anybody else has tried CBD but usually the consistency is thick it's it's thick it doesn't taste good it take it leaves like a really gross feeling in your mouth but this does not only do the job and it makes the pain go away the headaches the muscle aches and it definitely comes your head calms your mind just remember to take it in the appropriate amount of doses okay now the negatives I rate this 5 out of 5 stars there is no negatives to this coy Naturals is exactly koi Naturals it is amazing it tastes great it does great and they have so many different milligrams to choose from please if you're thinking about or if you are in pain if you have headaches if you're having Sayyidi anything please pick up a bottle of this because I guarantee you with my life that this is gonna do the job but make sure that you get the appropriate amount of milligrams okay alright well thank you so much for tuning in like I said if you have any questions drop them in the comments below and on top of that you know subscribe if you liked the video you liked the content you liked me subscribe if you didn't like it give it a thumbs down but I can honestly say that I'd be I'd be pretty sad okay but anyway thank you so much for tuning in on my third video and everybody have a nice amazing weekend gay yay", "WMNFyC15q-Q": "hey y'all it's Cody from sleep populace and in this video I'm going to introduce you to my favorite CBD products for sleep now a lot of CBD goodies in the market promise to help folks slumber but in my opinion these four are the absolute best now what are they well you'll just have to keep on watching to find out all right first things first let's chat a little bit about what CBD is now if you haven't checked it out yet I highly recommend that you take a peek am i what is CBD video which I'm gonna put right there I think yeah and it goes over what CVD is how it feels the research that's been done into its side effects dosage all things like that basically like it's a full rundown of CBD as a compound but in case you don't have time right now or simply don't want to watch it I will give you a little bit of a breakdown right now but what CBD is so CBD or cannabidiol is a compound found on the flower of the cannabis plant it's one of more than a hundred different compounds or phyto cannabinoids contained on the flower and they range and feel and type but the two most popular ones are probably CBD and tetrahydrocannabinol or THC however unlike THC CBD is not psychoactive and it doesn't trigger hallucinations or intoxication it's usually used in oils creams and pills to treat things like joint pain anxiety poor appetite and even poor sleep I should also mention that it's totally legal to buy and consume hemp derived CBD in all 50 states as long as the product doesn't contain more than 0.3 percent of THC alright now that we've gone over a little bit about what CBD is let's get into my picks for the best CBD products we're falling asleep and I want to start with my absolute favorite CBD product for spalling asleep fast which is the CBD PM tincture from CBD MD now this little baby contains both CBD and melatonin so it is literally designed to send you off to snooze town in a flash and when I tried it myself I found that it pretty much did that within five to ten minutes of taking it I felt totally relaxed and like I was drifting off to Dreamland with ease another thing I liked about this tincture was that I didn't really experience any next state grogginess which is pretty unusual for a melatonin based product so if you're looking to fall asleep super fast and need to get up and go the next day I think this could be a great product for you another good thing about it is that a 500 milligram bottle of the tincture only costs $45 which is pretty affordable when you compare it to other see many products on the market next up is what I find to be the most relaxing CBD oil and that's the American hemp oil from American hemp and I say most relaxing because I found that this oil had a really nice sort of like calming effect all across the body within 15 minutes of taking it I felt like tension in my shoulders was being alleviated my mind was quieted and so it helped me to fall asleep at night for sure but I also found that it was really just nice for lounging around the house reading a book watching TV and when compared to other products that I've tested I found that the effects lasted for a longer time around an hour and an hour and a half so if you're looking for a subtle CBD oil that'll sort of carry you through an afternoon or maybe carry you through your bedroom time routine I would highly recommend this one as I found to be very relaxing however it's like caveat is that a 2,500 milligram bottle of American hemp oil retails for $140 which makes it one of the more expensive ones I've tested next I want to share my favorite CBD oil for general use and that's the CBD premium oil from CBD MD now you'll recognize the brand from the first one I shared with you all for falling asleep fast but this one is different in that there is no melatonin here it is all CBD oil and I like it for general use because it helps me fall asleep at night but I also found that it had a really nice subtle relaxing effect during the day you know if it was like a weekend day and I was just hanging out I could take it go see friends go to the gym you know do errands and I found that it was just a really nice Zen tone I was highly recommended for general use and something else I really like about this oil is that you can choose your flavor so you go on the website and they have like four or five different options so you can choose the flavor that's best for you and something else I like about it is that a seven hundred milligram bottle of the CBD premium oil from CBD MD regionals for seventy dollars which puts it in a nice mid range between the least expensive ones the most expensive ones and finally my absolute favorite value buy has got to be the CBD oil from some soil now here as 600 milligram bottle retails for $30 and a 1200 milligram one retails for $60 so it's definitely more in a budget friendly zone for those of you who want to try CBD but maybe we don't want to fork over more than $100 to try it and even though it's less expensive than some of the option other options on this list I'd say that it's just as good it helps me to fall asleep fast and it made me feel really relaxed during the day so I think it's a great option the only thing I really don't like about the CBD oil from Sun soil are the flavor options and either comes in chocolate mint or cinnamon and personally those just aren't tastes that I like well folks that does it for my guide the best CBD products for sleep for more sleep related content and resources make sure to go to sleep obelisk calm and is subscribe to our YouTube channel until next time happy dreaming", "pDBaK-Ba9eY": "hey everyone its Josie here with bio MD and here at bio MD we believe that education is key as buyers it's really important for you to understand what it is you're purchasing and what is the right product for you having numerous terms presented in the CBD industry there needs to be some clarification regarding the differences between the different kinds of CBD that are available now there are three main kinds of CBD available there's the broad spectrum CBD the full-spectrum CBD and the isolate CBD and today I'm going to explain to you some of the differences between these different variants of CBD and maybe we'll try and figure out which one's the best one for you now but before all of that let's talk a little bit about what CBD is cannabidiol or CBD is a compound that is found in the cannabis plant there are many different cannabinoids that are found in the cannabis sativa plant the two main ones that most people have heard of are THC and CBD the main difference between THC and CBD is that THC is a psychoactive compound and CBD is a non psychoactive and by psychoactive we mean when you smoke or inhale or ingest THC you feel the effect of being high and you feel a general change in your perception of the world the opposite to THC is CBD and I say it's the opposite in that you don't feel these feelings of high you don't feel any of the psychoactive effects when you take CBD however CBD is known to possess many health benefits and which is why we are more interested in CBD and its uses at bio MD now the sativa plant contains more than just THC and CBD there are other kinds of terpenes and there's other kinds of cannabinoids present in the sativa plant and it is the combination of all these different components that leads to a variance in the different types of CBD that we see so let's start with broad spectrum CBD broad spectrum CBD infuses the various substances apart from THC so it'll include CBD cannabinoids terpenes and other chemicals that are derived from the plant and at the same time it does meet the federal requirement as it has all of the THC removed but even though it has all of the THC removed since it has most of the other components of the plant you still experience the entourage effect now let's talk about full spectrum CBD full spectrum CBD will retain all of the chemical properties of the plant including THC now authentic federally legal CBD is derived from industrial hemp and contains less than 0.3 percent THC now this is very very low amounts of THC and it will not show up on a drug test all CBD products are required by law to meet this percentage and no CBD product that you consume will show up on any drug test that you take similar to the broad spectrum CBD the full spectrum CBD will also encourage the entourage effect to take place but if you take the full spectrum CBD you'll feel it a lot more than you would if you were to take the broad spectrum CBD just because the full spectrum CBD has 0.3% of THC and the broad spectrum has no THC finally let's talk about the third and the last kind of CBD which is the isolate CBD iceless CBD products are labeled as being the purest form of the product depending on how they're processed isolate products have been isolated down to just the CBD molecules so it'll contain nothing else they do not possess any other active ingredient no terpenes or other cannabinoids so this is the purest form of CBD that you can ingest this type of product is generally processed as a white powder and also can be included in oil now again there are many other factors that can affect CBD for example various growing seasons can cause the individual mix of components to vary like one growing season can have a yield that's exceptionally high in CBD whereas the other yield based on temperature weather might have a yield that's a little bit lower in CBD and again the variation of chemicals might be different depending on the state's climate that the CBD is produced in the weather in Kentucky is very different from the weather in California so you will find differences in the CBD that are grown in different states another difference that may impact the product is the extraction process itself ethanol and superficial fluid of co2 both have advantages and disadvantages but do not produce identical product because the extraction itself will impact the chemicals that are resulting from this process I will end on saying that choosing which CBD product that meets your specific needs is a personal choice if you want to assure that there is no THC present in your CBD I would recommend going for the isolate strain however if you want to expect an experience a feeling of calmness that is more tangible maybe like at the end of the night maybe right before you go to bed you want to experience a feeling of calmness in your muscles then I would recommend either the broad spectrum or the full spectrum and there is really no harm in trying out different products and seeing which one works best for you and your personal needs there are many coupon codes available for most of these CBD products and that is one way to save money and still try out different strands and see what works best for you so good luck on this journey you [Music]", "xAxdWdK5aIM": "data's bcn 1000 milligrams tincture is a signature natural mint flavor tincture it offers a highly effective 13 milligrams of EC and per milliliter awesome amazing for you seriously a decayed this man so good okay our unique clear texture is free of additive solvents and harsh mixers in case you're wondering ECM is it is appear Fido cannabinoid rich in hemp oil and has been refined to remove the THC unlike CBD oil which can we can see using a vaporizer brand easy and tincture it is designed for oral consumption as an end user you can add it to food out a drop to your favorite drink or drop it directly under your tongue for fast and easy consumption 100% satisfaction guarantee with all natural ingredients just MCT oil distillate of hemp and natural flavors depression insomnia anxiety drug pain etc are treated by CBD you can check out the lab results of our product below how to use the CBD take one milliliter once a day drop in directly under the tongue for faster access it can also be added to your favorite drinks and or foods [Music]", "sdrGU-TIY3I": "at everyday optimal CBD we are committed to providing you with the best CBD products on the market because we believe they can change your life CBD oil tinctures are a popular option for many people who use CBD for relief from a variety of health issues CBD oils are taken sublingually which means you place the oil under your tongue this way your body can absorb the CBD quickly resulting in fast-acting and strong effects we manufacture some of the strongest and most potent CBD oil tinctures on the market from three hundred to four thousand milligrams the more potent oils are great for more severe issues like chronic pain and arthritis while the lower dosages work wonders on anxiety muscle aches and sleep issues all everyday optimal CBD oil products are derived from organically grown industrial hemp completely THC free and legal in every state without a prescription [Music]", "l9S46IkaOzw": "this is Jes CBD specialist with Avery Gardens and we're here today talking about our extra-strength daily 5000 which is the highest concentration of really any product that we actually make here at ambery Gardens but is also the highest concentration in our full spectrum daily line now these are internally taking products you would either put on a spoon to drink down or put under the tongue and this particular one has 5,000 milligrams of CBD in the bottle if you were to take it in the amounts written right here you would have 84 milligrams of CBD per press we'll get into a little further details of how these breakdowns work here in just a little bit this is an MCT coconut oil version of our product which means you're getting a long-lasting and natural breakdown of CBD over time this is perfect for individuals that have been told by their doctor to find a larger amount of CBD we find some people as well coming to us that are addressing more severe health challenges and are wanting to take a larger amount of CBD as well everybody is different and some people's bodies require just a simply larger amount of CBD per day so if you are looking for the breakdown of this product on our website go ahead and head to the description tab of this particular product and you'll be able to find a written version of this breakdown there but let's go ahead and go into that here for you now in our dosage scale we have two units of measurement we like to use and let's go ahead and establish those now the first one we have is a dropper which is the amount you're gonna see written right here on the side in this particular bottle that is getting you 84 milligrams of CBD to get that amount we're gonna go ahead and start from a completely empty dropper so we'll just kind of press all that out of there press down as hard as we can on the top of that dropper making sure everything gets pressed in push this down in and let it go and we'll get this exact measured amount of oil that we're looking for okay now in this particular version once again that is 84 milligrams of CBD that's in a pretty small amount of oil which is why it's so dark like that it's a very highly concentrated form in this guy now if we wanted to break that down further we like to do that in drops to get a drop you just need to give a slow small amount of pressure allowing for that to form and fall giving a little bit in between each one so we can really make sure that we're consistent okay now in this particular one here one drop is going to be worth about one point eight six milligrams of CVD so one drop is actually worth a pretty you know a consistent and solid dose in in a product like this three drops is going to be getting you about five milligrams of CBD so one two three that was five milligrams right there and if we were wanting to get ten milligrams we would do six drops and for this bottle about 20 milligrams of CBD you can get from 12 full drops of oil now this particular product once again we have a lot of people coming to us with more advanced health challenges their doctors have recommended them to get a larger amount of CBD this is the product that we turn to we also have some folks that are wanting to maintain a consistent daily dose but at a lower amount of oil so you could maintain something like that with this product it has a very long shelf life looking at two years on this guy so you'd really be able to keep it in a cold dark place for a very long time to keep a consistent daily dose of CBD in a smaller capacity like that once again the 5000 milligram of our full-spectrum daily oil 84 milligrams of CBD per press so if you have any questions about this or any other ambery Gardens product you can feel free to reach out to us under the contact us button and you can find that on the support tab which is on the top of WWE Emory Gardens comm you can also reach out to us anytime on the phone its toll free 855 4 to 6 to 279 our retail centers are open 9 a.m. to 5 p.m. and we'd love to take your call if you call us outside of those hours just leave us a message and we'd love to call you back thanks for watching today and thanks for being a part of the ambery family", "QKaETKN8Qvc": "now to our new serious prescription free pain relief one in five Americans suffer from chronic pain many are now using CBD for relief google reports six and a half million searches for information in just one month and Becky Worley visited a CBD dispensary to take a closer look Melissa McCarthy reportedly uses it on her feet Gronk says it's changed his life for the first time in more than a decade I am pain free CBD lotions you rub on your skin to reduce pain the idea is that by rubbing it on it's absorbed through the skin and it could impact joint or muscle pain just ask athlete ally Stoddart I played rugby for 15 years I play soccer now I got a lot of pain Ally a cannabis health and wellness consultant says she prefers CBD the non psychoactive part of the cannabis plant to over-the-counter painkillers I weighed a couple of minutes and literally it just kind of eases away but amidst the endorsements and hype what are you actually buying and where you can buy CBD creams online but to be honest it's confusing the dosages are all over the place so I head to the havahart dispensary in Oakland California where they can explain what's being offered plus whether it's intentional or just ironic this legal marijuana dispensary is directly across the street from the Oakland Police Department co-owner Josh chase shows me the products they sell we pretty much offer every single type of CBD that one could find in any form what's really interesting to me is how few claims these products make and that may be because the FDA forbids medical claims for products we're rigorous studies haven't been done was really up to the consumers to up to the patients to educate themselves and make sure that the products that they're purchasing are of safe quality or from a reputable source but keep in mind if you do shop in a dispensary do you take credit cards so we make sure that we do everything by the book by the city and state's law and everything is cash so this is something you want to try do your homework and bring cash for Good Morning America Becky Worley Oakland California good thing to remember I thought I Thank You Becky dr. Jenn Ashton is here for more will do viewer questions today and the first one comes from Adria from New Jersey let's take a look hi dr. Ashton I've heard a lot of people using CBD oil for things like stress anxiety muscle soreness but I'm wondering how does it actually work could they be making it up Thanks great question that is a great question and right now it's really about what we know and what we don't know the bulk of the pain literature in peer-reviewed data comes out of Israel and Canada but everyone is researching this and I think it's based on this understanding George of this endocannabinoid system and if you look at the wall we have at least two receptors that are called cannabinoid receptors one heavily concentrated in the brain that's related to the perception of pain cb2 receptors located all over the body and the confusion here with respect to pain is that THC which is the psychoactive component of cannabis yes it fits into that cb1 receptor but khat CBD also fits in does not give you a psychoactive effect that is really important but it there is data that it can help you see a lot of the prices say no THC exactly okay we have another question coming in on Twitter this is from Susan she says I've seen 300 600 1200 and 2,000 milligrams how do I know what does to try and what do we know about the dosing here we see the different ones here yeah wild wild west George and here's the thing in in terms of official recommendations so far the only group that has guidelines out is the Arthritis Foundation their recommendation is to start with as few milligrams as possible under the tongue twice a day if you're not seeing an effect over days and weeks increase its slowly and if you're noticing any unwanted side effects obviously stop and talk to your provider the concept here is start low and go slow and it's a lot of trial and error it's not one side and this is not a beer question it's my question I guess is there any any concern about dependency there not as much dependency but you always have to take into account risks when you talk about pharmacology if you're getting a good effect you have to be on the lookout of any unwanted negative effects and right now those risks are low but as always talk to your provider if you are using any of these projects and thanks very much well hey there GMA fans Robin Roberts here thanks for checking out our YouTube channel lots of great stuff here so go on click the subscribe button right over right over here to get more of awesome videos and content from GMA every day anytime we thank you for watching and we'll see you in the morning on GMA", "S5hDBcSPQN8": "hey there i'm katie and i am one of the employee owners over at goodvibe cbd today i'm here to educate you on our full spectrum cbd tinctures we use a refined hemp seed oil base as our carrier oil because it's rich in omegas 3 6 and 9 and high in protein our tinctures come in peppermint or lavender flavors using a food grade essential oil our entry level tincture starts out at 500 milligrams dosed at 16.6 milligrams per serving that ranges all the way up to 14 000 milligrams which is dosed at 233.3 milligrams per serving check out our product descriptions to see what tincture works best for you", "wRuY6JSRoME": "oh yeah I got caught smoking weed at universities I had my girl bring my kid away and I was outside of the Jurassic Park I didn't get called by the police but I was outside of the jurassic park ride and i was like all right you know bring him to go get a soda or whatever i'm gonna sit here and smoke my vape pen and there's like one of the handlers they have a thing where they have a velociraptors I get person into costume but it's again i'ma try to cost ya and they're pretending to be like a velociraptor and the the trainers like trying to calm him down it's a whole display with the kids and everyone's really excited so I'm just like how I watching it like getting stone zoning out and at one point the girls got like one of those you know microphone face pieces on she just goes she goes sir not here and that was it I went up and then I just sir not here fade it off yeah I know I wonder if they're cooler about it now now this is a year ago oh there's not that long ago Wow I was very surprised I was like this is California well not only that would it would if it was a vape pen with tobacco or CBD or are you allowed to do that probably not I think they're smoking areas that are designated but she knew what it was she saw my face my mouth was a gape watching real velociraptors walking around I was losing my mind it was all dude like get out of here stoner yeah that was listening to the radio in Utah and they were talking about how they have to re they have to figure out what to do with their drug sniffing dogs now cuz there's no reason it must be some is there a change in Utah as Utah changing their their drug policy because it was funny that's listening to this old dude on just for the for the [ __ ] of it I was listening the AM radio rock radio and this old dude was talking about how they they're gonna decommission some of these drug sniffing dogs because they'd use him on like traffic stops there we go medical marijuana in Utah could mean retirement for generation of drug canines just [ __ ] putting these dogs down well they also were worried about the police officers themselves losing jobs you when you hear about pot that's making its way into a place like Utah you know first of all you realize goddamn pot is really you can't stop it's here the genies out of the bottle it's here the revenues and Grandma feels better ya know the alzheimer the people that have all these serious issues that CBD is fixing brightest patients people with like real problems that are not finding any other solution that works the way cannabis does they just give it in and then they're making all this money but then you see these old folks that are from a different time and they're talking about it and they they look at it in terms of like how many police jobs are gonna go away bright how many dogs are gonna be one of them smoke weed so they're like it's not really my problem and interesting to watch them look at it as an economic issue the problem is you have pot heads that are leading the charge so it's it for a long time it was difficult to take him serious yeah you needed straight-laced guys to come in and you know there's a lot of money there there's so much money in it that you're getting that but when you have [ __ ] hippies playing hacky sack and you know you know weren't puka-shell necklace is is sort of hard to take them seriously when the reality is they kind of want to be legalized for recreational purposes and you know yeah I don't like for I don't I don't use we SS doesn't try to I do take CBD I did literally during that fight I was using topical CBD the whole time so I guess you take whirl - I do I take CBD excellent daily but I don't know infinite CBD sponsors are our podcast and great festivals well they're also I'll get you a bunch of products is there a really great company that supports comedy they sponsored my tour when I was prepare for my special they're [ __ ] dope but I take it daily I take the the oil just because you know apparently all of the the benefits that it has with getting your body back into homeostasis and making you feel better and getting back in line I don't know the [ __ ] effects I smoke weed every day as well so I'm sure i'm getting CBD effects as well but in my mind I'm going to I have a bunch of this stuff I know that since I started taking it i weirdly feel better but i can't really connect you said before you take CBD and you go into another realm well I was taking one and one it's like one gram of CBD - one gram of THC like it's it's one part well so whatever milligrams you have it's Bo like it's ten milligrams CBD it's ten milligrams we as well its Pope yeah I take regular CBD too though I take oil I feel like it's it's very beneficial and much more potent in terms of its anti-inflammatory benefits then just smoking it smoking it does something for you definitely reduces inflammation makes you feel better I was taking sore joints a topical I was using topical is good too but I think the real combination is topical plus the oil you don't have to say but people a lot of people find that they have better pain relief from one versus one plus one like one part THC one part so it's like edible like you know marijuana mixed with CBD a lot of people find great benefit in that for some reason yeah I had a trick my aunt because my aunt so anti drugs and if I told her that CBD was derived from hemp shoot she wouldn't take it was just bad arthritis and I gave it to her for for that and she loves it and I told her after the fact but it's grabbing dude it's just a plant folks and if you just get straight CBD it has no psychoactive properties there's no it's not gonna the only thing it's gonna do is for some folks and it works a little bit left wave with me it alleviates some anxiety just relaxes you yeah yeah that's uh that's why I smoke weed - yeah I smile and I've been arrested probably ten times in my life and every time was for smoking a joint in the street every single time dude the arrested they take you in yeah New York Turkey [ __ ] cell it's crazy still there still do the last time I was put into a cell for smoking weed was a year and a half ago me and Dave Smith two years ago maybe me and you tell me you were Lewis J Gomez guy told me Louis calm eyes that's when I start using the middle in - I was like you know what it's problems election [ __ ] Lewis Gomez's must have rap sheets doggy every time I come back into the country I'm pulled into a room and they [ __ ] they look like they're about to fist [ __ ] me with a rubber glove every time have you been to Panama honey ton recently sir yes come right this way every single any time Bolivia sir but yet dude when in New York City the way it works is you its dude it sucks it's happened so many times it's the worst because it's just a major inconvenience you know pay me ask to get into Canada I can do it now cuz they changed the laws but I didn't go to Canada for like three years because of weed for being arrested for a joint we're not talking about like I have an ounce that I just bought from my dealer and they found a large amount on me a joint smoking on the street what they do is they they at first they they take the weed and they go all right we're gonna give you a ticket just hang tight relax we're gonna put cuffs on you this is just keep you calm and just to [ __ ] get you in the paddy wagon this is all a process then they put you in a paddy wagon they used to have sweet nights in New York where all it was was they would go and try to find kids smoking weed kid drunk kids college kids pissing in public public intoxication and the entire night they would just pick up everybody and fill up paddy wagons and create criminals just create criminals out of teenagers you know kitten they were targeted that's why the stop and frisk law has happened in New York they changed it because they were just targeting black and Hispanic kids", "7t7Jkz8Iu7k": "as part my daily routine I always take stevedore I use it before bed and I use it in the mornings when I wake up we've obviously launched the range impact sport see video you can see the full range here of oils we've got we've got the 1600 or 400 for men designated by the red boxes and we've also got women's range 400 and 1600 in pink now I take them oil every morning as well as in the evening Chloe has been taking the 400 for quite a while but she's been taking an increased dose so I've got the 1600 so what a special surprise for it she doesn't know it's arrived and we're both going to take it now before we go off the gym smash a workout Chloe oh really laughs yeah that wasn't a slam void if you wanted that entrance to be was it I've got you this is 1,600 living banging on about we've had it custom-made for you so you know because it's 2019 and everyone's equal we wanted to make sure you've got full what sixteen hundred the Chloe speche we know we are I supposed to take five drops but I ended up taking a little bit more I think you can be a little bit nipple and that's under your tongue and you can talk about this and you're ready to go training you can talk properly funny so as I said we've got a female range but the male range if you want to find out more than head over to Deborah impact sports dot UK [Music] I'm so testicle I'm really excited to announce that I've launched a new company called impacts first that impact sports is a CVD oil company you will have heard a lot about this I have teamed up with my teammate evacs legend and double World Cup winner Ben Franks who is a man absolutely loves his training and nutrition we've been working on this for quite a while we've teamed up with a company from SciTech who are renowned in the CBD oil business for their company profit Camden's launches first separate products got to oil two men and four women and we have a bomb and we've also got a Anneke van which is fantastic post a hard workout you want to find out in the and head over to impact sports UK", "f-f9s6EYGRg": "listen I'm limited on time so this is gonna be a quickie we sent coin naturals to a lab to see if it's real plus I've got a review the good and the bad you're gonna want to see that part as much as the lab results let's get to it okay they claim two hundred and fifty they don't even say milligrams or what that is our independent lab found a hundred and eighty-seven milligrams of cannabinoids including a hundred and eighty four ish milligrams of CBD not two fifty they're missing like a quarter yeah jaw drop let's continue this is a broad spectrum extract meaning no THC but should have other cannabinoids but this is solo it might as well just be CBD as always here's the official lab test links below this is just one lab tests there are knowing guarantees that all products will test this way and things change price price is pricey twenty-two cents per milligram it's pricey go look at my other tests and you will say oh that's pricey ingredients it's just CBD oil and coconut oil that's good I usually don't mention subjective things like taste but since this review is so harsh I'll give it to them it tastes really good okay Noli your breakdown they claim it has eight point five milligrams of CBD per one milliliter dose we found six point one milligrams their serving size also adds up to two hundred and fifty milligrams it's a 250 milligrams bottle get your math straight coy of course we only found 184 milligrams of CBD Quin Naturals is a California company we tested it before it came up 19.3% short on our last test news for san antonio also tested it they found it was 22% short our last test was 25% short they are consistently a bit short a couple lawsuits some woman claims she lost her job because of the THC in their product but she had no proof of that and we also didn't find THC so I couldn't tell you for sure and they have accusations for false medical claims like many CBD companies do you say anything like it's anti-inflammatory and it's a false medical claim for CBD even though it's true links below to this review hit the subscribe button to see more legit CBD lab tests and reviews thank you so much for spending a few minutes with me see you next time", "waCbh8qv8tw": "hey Jimmy here with holistic magnified doing a quick product comparison with our salvation 33 that's a thousand milligrams south this one is a full spectrum this one is only CBD so cannabidiol full spectrum there's over a hundred different cannabinoids in the hemp plant and the marijuana plant we obviously get our self from the hemp plant so we have all those cannabinoids in here that does include the legal trace amounts of THC below 0.3% is what's federally legal so a little story about how I applied these I went ahead and put some on this one on the full-spectrum on my right knee which I had reconstruction surgery on about 20 years ago I put the isolate based on my left knee which I also had a reconstruction surgery but that was only about three years ago so reconstruction on both played about two and a half hours of basketball this morning both of these are infused with the same organic essential oils um organic beeswax as well and they are both the same price sixty five bucks so we're just we're not looking at it from any other comparison except full-spectrum versus isolate after I put them on I would say about 15 minutes afterwards both knees felt really really good no swelling inside I had full range of motion it's now been about an hour my left knee still feels really good which I used the isolate based on but my patella tendon starting to get a little bit a little bit stiff um the the swelling inside my knee is not there but as I said patella tendon is getting a little bit tight my right knee feels phenomenal so that's basically my personal use today lots of variables everyone is different but pop on over to holistic magnified check out we make holistic topicals tinctures herbal inhalers very potent stuff so love to see you", "358_hT33ZEc": "hi there and welcome to Green Valley nation my name is Jennifer Dixon and today I want to talk to you about the swiss relief 1000 milligram CBD isolate tincture but before we do make sure that you like and subscribe to this channel so what is the swiss really 1000 milligram CBD isolate tincture you ask well despite its name it's a US grown product that uses nanotechnology to encapsulate their CBD isolate thereby creating a more efficient or bioavailable CBD supplement for your use this u.s. grown product is actually proudly single sourced so on their website they use this word single cultivar and I was like what the heck is that basically what it means it's it's one a single strand of an industrial hemp plant the idea is if you use one particular type of industrial hemp it will help to standardize the results of each batch from crop to crop Swiss relief does use the nanotechnology which has been around since the middle part of the 1900s to help provide medicines into our system that we'll get through the digestive tract they've been using medicines with this nanotechnology for decades and it's still relatively new to the CBD supplement market but it's making great headway because it does provide a way for the CBD to get into your system a little bit more efficiently so that means you don't have to take as much of it to get the same benefits Swiss relief does carry a broad range of products from this team sure to capsules topicals things of that nature but today we are just going to talk about the 1,000 milligram CBD isolate tincture when you order your CBD from Swiss relief it's going to come in this in box there's one size 30 milliliter and they suggest a one milliliter dose this is the bottle that gives you about 30 servings if you do that one milliliter these are organic non-gmo and vegan friendly they are available inside the US and the most important thing is you can find a QR code here on the box and on the bottle I had to find it there for you to get a direct access to the COA the certificate of analysis there by even further I guess giving you the information to know that this product is exactly what it says to be on the front of the box and the front of the bottle let's spend one quick moment talking about the test results in VO labs in florida actually performs all the test results for the swiss relief product and you will find when you look at these test results that it comes in as NT non-traceable for things like pesticides residual solvents microbials that kind of helps to reinforce the fact that these are organic products that means that they don't put a lot of crap on the plants which could come into our system crap is my super scientific term for that by the way when you dive a little bit deeper into those COAS you're gonna find that in fact there's a little over a thousand milligrams of CBD in this product it is truly a CBD isolate product because it tests non-traceable loq a lower quantifications for THC and all the other terpenes and cannabinoids so if you're genuinely concerned about having the THC in your system this could be a really great product for you I bet you're curious to see what this looks like when you open the bottle you will see it comes in really dark it almost looks like a full-spectrum product when in fact it is a CBD isolate I don't usually take a full dropper of this product because I don't need it so I'm just gonna take about a quarter of a dropper you put it underneath your tongue and you wait about thirty since if you can wait up to two minutes it's even better but I have a really hard time doing that because the stuff doesn't taste great let's talk about your life supplementing with the swiss relief 1000 milligrams CBDT share so when you get this in the mail it'll come in this nice green box and on the front it's clearly labeled exactly how much CBD is in the bottle and you can find the QR code along the other side you can also find the ingredients in the suggested serving size and all that on the the box as well on the bottom of the box here on that back corner as well as on the bottom of the bottle you'll find a lot number and an expiration date the lot number is generally used for the COAS however in the case of Swiss relief they put all of their cos based on the product itself not the actual lot number so the very first time I took this product was at the end of the unusually chaotic day chaos is kind of like me and modified if you looked it up on the Urban Dictionary you'd probably see my face in it my life is always a thousand miles an hour so it was a particularly busy day and I tried some of the CBD I went ahead and took a little bit more than I normally do because it was an isolate I think it took like a half a dropper and within 20 minutes the chaos that is the squirrels inside my head were finally calm it was really great I was able to fall asleep my gosh I think it was in record timing my husband was making fun of me because he looked over and I was kind of like drooling and and completely out it's really really awesome so this product did work the thing I will warn you about is it's sort of woke me up as tired as I was getting because this does not taste good okay let me preface that with I do not love the earthy flavors commonly found in CBD tinctures my sister on the other hand loves it so if you love the earthy flavor you are going to love the swiss relief 1000 CBD tincture because it tastes like you are going out into the forest and eating pine needles i don't really care that it tastes that bad because it works really really well it helped me to relax and follows quickly but beware this definitely has a very strong earthy flavor I've continued to use this product for the last several weeks and every single time I come to the product it works I generally don't take more than a half a dropper because I don't need that much but every single time I take it it will help to reduce any pain that I'm having like a crick in my neck or in my low back I know a crick in my neck made me sound like my grandfather this stuff works every single time you take it whether you take it first thing in the morning to help reduce the pain that you might have right when you wake up or the last thing right before bed you're gonna find that you have reduction in pain and a reduction in stress anxiety you just kind of it kind of helps to melt all of that away but if I do take it in the middle of the day it doesn't make me sleepy I can take it in the middle of the day and I'm able to focus I'm able to not get distracted by the beeping phone and things like that so I can get a lot of stuff done as I supplement with the swiss relief 1000 milligram CBD by now you probably guess that I actually liked using the Swiss Relief 1000 milligram CBD tincture other than the fact that it tastes like Tinkerbell serve me dinner so it works and let me give you the three reasons why I think you should try it the first is it's a very very simple product all you have in this bottle is a CBD isolate and hemp seed oil the second reason why I think you should try this product is that it uses a advanced technology commonly found in really really really good pharmaceuticals it's the nanotechnology where they break up the CBD into tiny little particles that's like three zeros it's point zero zero zero that's how small it is and they envelop it into a lipid which helps to make it through your digestive tract faster which makes the CBD more bioavailable for your system so the biggest reasons you should try it is the fact that it's very simple and it has this advanced technology enabling your system to absorb more of it which leads to the third reason why you should try it the fact is is this stuff works if you can get over the flavor you will be pleasantly surprised with how well the Swiss relief 1000 milligram tincture actually works I only have two beefs about the Swiss Relief 1000 milligram tincture the first one is this stuff does not taste good it tastes very earthy very earthy and for a CBD isolate product I was actually shocked about how earthy this stuff tasted the other thing is because it uses that advanced nanotechnology you're going to end up paying two or maybe three times as much per milligram of CBD as you would a traditionally or conventionally manufactured CBD supplement so definitely keep that in mind it is earthy and it's a little bit more expensive however you get what you pay for this more expensive more advanced technology helps you to get more of the CBD into your system your digestive tract your digestive acids don't kill it before it gets to you right so you you do end up paying a little bit more for it but you might have to use less of it because more of it gets into your system one more thing you should keep in mind about the swiss relief 1,000 milligram CBD tincture is that it is an isolate since it is an isolate you don't get the full benefit of the industrial hemp plant when you get all the cannabinoids all the terpenes all of the whole plant working together oftentimes you'll find the entourage effect helps to magnify the overall benefit of the plant so keep that in mind if you are looking for a full spectrum product this would not be for you just to cover everything up really really quickly the swiss relief 1000 milligram CBD tincture is a CBD isolate that is grown and manufactured right here in the US you can get it here stateside it is organic non-gmo and vegan it comes in one size this 30 milliliter size and the suggested serving size is one milliliter because it is created with that nanotechnology it does cost a little bit more per milligram of CBD however it is much more effective in my opinion at creating the sense of ease and reducing the pain so it's worth the little bit of extra money in my opinion thank you so much for watching the review today again my name is Jennifer Dixon with greenvalley nation I hope you learned a little bit about this really cool nano emulsified CBD isolate product and I hope I encourage you to try it it does work and it is a very very very simple natural product so if you don't like the sugars and the other kind of artificial stuff found in products on the market these days this could be a really great product for you I'm curious have you tried it did you like it I'm also curious to know if you thought it tasted quite as strongly as I did it's it's definitely a acquired taste perhaps but it's effective so let me know drop some comments down below and don't forget that you should like and subscribe to the Green Valley Nation channel so you can stay up to date on the latest in non-biased CBD reviews and information that you can find on the internet I can't wait to see you again soon take care bye bye [Music]", "KjC_DuOMEGU": "hey friend I've got a review for you it's a good one med Terra CBD most importantly I sent this to a lab to see if it's real we're gonna go over everything I found on the company good and bad plus the lab results starting right now med Terra claims 500 milligrams of CBD in our lab report shows 564 milligrams of CBD or twelve point eight percent more than the label states and that's considered accurate out of more than sixty products that I've tested this is the only one to have CBD and only CBD most of the isolates even have a little CBD v it sneaks by this is a pure pure pure c video you can see the official lab test here this is an independent test paid for by me purchased by me for retail I have no affiliation with this company cost it's eight cents per milligram of CBD which is excellent especially at the forty five dollar range and at the quality of this product the dose is about 19 milligrams per milliliter dose some people start at five milligrams others go to 15 to a hundred researchers use doses in the hundreds this is 19 milligrams this is just CBD so it'll have less side effects than a full spectrum extract with THC it's also good for people that get drug tested because there's no THC I don't need to say much about this company because everything's good and it's one of the most trustworthy CBD companies on the market they made hemp history a few months ago when CBS agreed to sell CBD products their CBD products across the nation u.s. hemp Authority Ward a rating by the BBB no negative reports this company is solid and they're one of the few companies to receive my CBD examine authenticity award it's one of the best awards a CVD company could ever get and I've only given a few that's what she said yeah yeah again I've got no affiliation with this company but I am a fan now that's the short objective no fluff review subscribe and like if you want to see more of this I mean the the lab results if you want to see more of the lab results subscribe and like see you next time see you soon comeback please subscribe ok", "l66VIVxVkSU": "well hey guys welcome back to my channel it's Adrienne the naturalist and I have a special for you guys on a CBD cream by a company called CBD oil biotech and this is their thousand milligram extra strength pain relieving premium quality CBD cream and not only have I tried their thousand milligram which is a recent thing because they were sold out of there that's right I originally started out with their 1500 milligrams CBD oil bio tech biotech premium quality CBD cream now these creams are both non genetically modified organisms they are organic with natural ingredients each one has 4 ounces per jar and not only than that that says that about our cream from CBD oil biotech company says on the back CBD oil biotech premium quality CBD cream is committed to creating the highest quality and most innovated CBD skincare products support the health and wellness of people like you who that's cool CBD oil biotech premium quality CBD cream is a powerful pain relating I can advocate to that and we'll talk about in a second cream that deeply penetrates the skin to soothe aching joints and muscles specifically with what I have fibromyalgia arthritis pain it's made with our proven pain relief formula and boosted with high quality raw hemp oil the screen provides relief when you need it the most and both of these creams are from a company I get called diamond CBD and I'll link down below the website but to be honest with you I started out with the higher strength one the 1500 milligrams and it knocked my socks off with pain you guys I mean I get joint pain and every joint specifically my hands my knees my back my neck and yeah it's crazy I get a lot of pain from being and chronic pain from fibromyalgia and with my arthritis in my my right hip and my lower lumbar which is my lower back it gets irritating so I put on a little dollop of this and I'm not sure if these both have the same ingredients but they might be very similar but let's talk about the thousand milligram one because that'd be a good place to start out they do make 500 milligram ones as well and this one right here is on sale right now plus if you sign on to their website and sign up if you're a teen or years or older because these are THC free CBD creams then you get 35% off I'll link down that coupon code - I believe it's welcome in all capital letters and then the numbers three and five but don't quote me on that but um yeah the ingredients in these and this is why I like them the first ingredient Halong coffee break delicious venti iced decaf nonfat latte with three stevia's and extra light ice that's my drink of choice industrial hemp cannabidiol or CBD menthol purified water we've got alcohol mineral oil we've got stearic acid we've got glycerol aloe vera powder another alcohol EDTA we got la Vera gel some things I don't know how to pronounce some other things we've got camper which is a good cooling agent we got tea tree oil that's another good cooling agent for the joints and muscles in vitamin E and there's a couple of ingredients all packed in there and I'll link it all down below for you guys THC free lab tested made in the United States of America made with industrial hemp non GMO like I mentioned and no pesticides and thousand dollar grand one is great and it says for the instructions to not apply more than four times a day massage is not necessary just apply it to the skin smells nice and soothing it's really nice and creamy it stays in there but be careful when you open the jar I've already done one application on my hands but as you can see I'm just using a little gulps worth I'm gonna put it in the areas that hurt the most and we're gonna rub that in for some relief pain relief and then I'll let you guys know what I thought about this side of a 10 star but yeah if you're just trying out I'd say if you have pretty extreme pain like myself like a 9 out of 10 10 to the 10 on your worst days I would go with the high strength 1500 milligrams because that's just like the best option and it's worth the price I believe right now it was normally it's a little pricey 199.99 for the 1500 milligram illustrate the milligrams strength one I can't dog forgive me and it's on sale right now for a hundred and $9.99 and then this one right here I believe is normally a hundred and something and it's on sale for $60 and I'm not sure if that thirty five percent off coupon on top probably applies do you get it for even better deal my I stocked up and got two of these since they were on sell for sixty they were sold out like I might have mentioned on the 1500 milligrams they have these back in stock but if you're just looking for something more affordable and you're just like I got a pain here in there thousand is more enough you guys so what am I gonna rate these on a 10 star being 10 plus and 0 the worst luck job well I'm going to give him a solid 10 a 10 they're both amazing I mean the 1500 milligram I was like wow this is the most soothing moisturizing effective cvd cream for my joints and my muscles that i've experienced and then i was like they're out of stock so I'll try the thousand milligrams got to these and I've had it for a few days and I am not disappointed I'm literally just gonna stick with a thousand milligram one is perfect for me so I just want to talk about that 10 10 star rating for sure on both of those products from diamond CBD company CBD oil biotech and they have a website as well I believe maybe it's not listed on here not sure but they are out of Fort Lauderdale Florida that's where they're distributed so check out this CBD cream and you won't be disappointed and sorry I'm a little not too energetic today I have another chronic migraine I'm trying to figure my way around these if you guys have any suggestions out there or any treatment plans that work for y'all on chronic migraines related to whatever you can think of please let me know I'm looking into doing some neck exercises not just like that but some pole bar in kind of exercises at the gym I'm sitting across from my dream right now I was gonna go in but wasn't feeling so good today I got sick again going off a new medication I started a couple months ago that's been giving me a lot of nausea and migraines and so it's giving me more Naja and more migraines going off of it there you go on pharmaceutical drugs people hmm that's why I love CBD it's all-natural no side effects going off it for a while no side effects getting on it it's just a beneficial plant so just bear with me while I'm making my videos here lately but if you have any suggestions like I said on treatment plans for migraines please comment down below I'm desperate for anything natural but yeah the guy at the GNC in town here the other week said he used to suffer from chronic migraines and he pumps it up at their gym y'all do do or do it funny huh he wasn't like that and I wasn't like that with him but um basically he said to do like the polling Robo kind of motion ones towards the chest ones up above the head and if you can do it with your lower or your upper back ones behind pulling up like that machines and that'll strengthen the muscles in the neck which connect up to the head which go to the blood flow which can cause migraines or not migraines depending on if you strength those muscles so I'm definitely gonna look into that I want to make some updated garden videos before the garden has to be kind of harvested here at the end of the summer and I'm seeing a lot of videos pop up on YouTube about plants that can be grown in productively and survive through fall time so I'm gonna look into that some videos for you guys on that and other than that I'm just thinking to take it easy with my migraines my nausea the next hour long and just get it through this with my CBD and my supplements and I'll make a video here soon on the supplements I take there are people going out to their cars and I feel like a nerve because I might youtuber and people don't know who I'm talking to I could care less what people think but I don't really have much else to say if you guys have any suggestions for videos besides reviews if you want to see I know one of you mentioned a comment if you want to see what I eat in a day overall ideas I can post a video on that I could make videos on grocery hauls if you guys want to see exactly what I buy the grocery store that's healthy low-fat options is a vegetarian and yeah I can do a view on my new supplement regiment because I did start a new CBD capsule that is CBD isolate from diamond CBD website as well as where I got these two creams from and they have 5-htp which is a natural supplement for the brain for anxiety and mood disorders and I've been trying that out as a supplement itself so I thought why not get a CBD capsule to replace my other CD CBD capsules I'm almost out of and try the one with a 5-htp add it into it kill two birds with one stone and also I am taking l-theanine but I can make a video on that I started some ginkgo which is a plant that's been around for centuries since prehistoric times basically it's good for brain functioning so I'm trying that for memory and my migraines trying to think what else I started in vitamin D I started a caffeine supplement despite what doctors say they don't know everything every body like body of your body is different and I started a supplement that is all-natural I can show you guys in a video one day when I'm home that contains yerba monta in it which is a good caffeinated natural drink from the yerba mate a plant and it also has natural caffeine from green coffee beans I believe it is and a little bit of rhodiola rosa in it for some energy and it's all good combination to do treatment for my ADHD because I am no longer on adderall I was on that for a month or two it didn't work for me and the alternative to adderall the non-stimulant pharmaceutical medication for ADHD is just too many side effects not good for you and I'd rather take the Supplemental form in life the natural approach if I can so I'm gonna sign off and I have a lot of great videos coming up just bear with me on my migraines my nausea I'm trying my best to pump through these migraines last nine months a bang basically every day all day and I'm doing my gosh dang best so thanks for bearing with me and sorry if I haven't been very my usual energetic self you guys I know you guys like that part of the Adrian Naturals channel and if we have anyone new out there that wants to join the Adrian the naturals family please do I am just over seven hundred and twenty five subscribers and when I make it to a thousand I'm going to do an herb big contest giveaway and I'm gonna start collecting things hopefully we can get there by Christmas time so let's get some subscribers on board with the Adrian The Naturalist family and if you guys like this video please like it and comment down below I haven't been getting a lot of comments I appreciate that let me know how you guys are doing what you think what you want to know about me and I guess I'll be making a couple of videos here to come soon one on my new supplemental regiment as well as one on my garden harvesting things I can show you guys I'm drying out some skullcap right now I grew this season the summer and spring and I got a lot of mint I harvested I've got some rosemary to harvest and dry out I dried out my stevia plants and I'm going to boil that in water and make a stevia steer up for sweeteners just a little drop here and there in a tincture bottle I have but I can clean out from a CBD tincture I had I like to be reusable but minimalistic at the same time if that makes sense so okay guys I'm feeling a little better and I'm waiting for my mom to come out so I'm gonna finish my coffee okay guys this was Adrian the naturalist and this was a little review slash chat vlog with me I'm the parking lot this morning on some CBD oil biotech thousand milligrams CBD cream as well as their 1500 milligrams CBD cream okay bye guys [Music]", "fubjwyacLqM": "hello and welcome to Green Valley nation your source for independent CVD reviews and education my name is Cameron the female finder and today I will be reviewing some green rose CBD products um but before we get started we would love it if you would go ahead and like and subscribe to our channel down below to stay updated to all the stuff that will be known so I have a couple products dauer will be revealing today one is the CBD gummy it's like a little frog gummy right there and then we have a syringe with CBD oil in there so first off let's go with the gummy so pretty much get the package is this very nice I mean in really nice thick plastic so you know it's gonna stay fresh that's always a good thing but um on the front this is it's a little confusing I'm not sure what I mean I'm maybe they meant to say no THC but it says indi THC so I just wasn't too sure what it meant mom assume it means no THC because none of these products you see him um CBD froggy 25 milligrams they part should've just called it froggy and said 25 milligrams of CBD or some like that cuz I don't know like it it looks good but like just these little things I feel like making difference um let's see we got so it's 25 milligrams of CBD like I was saying um we've got some flavors on the back so this little thing is in the way of the ingredients was just not issue obviously let's just take it off so I can see Audion greens cuz you know my biggest thing if you see my other review is that you know ingredients is the most important thing because you're putting that in your body you know just like the CBD promoting the CBD for us to put in our bodies and for it to you know help us become healthier and stuff like that so like I feel that they should definitely be putting you know products that help do that as well other ingredients besides the CBD right so just one kind of you know this is not my these are my favorite ingredients I'll just say that corn syrup sugar gelatin citric acid natural artificial flavors some different colored eyes red yellow yellow blue with numbers according to each one or whatever so um yeah I'm not I'm not I'm just it tastes good I hate the red one yesterday it was like a cherry taste but this one I'm not the biggest fan of you know just in terms of the flavors and stuff you know I'm sorry in terms of the ingredients it sounds of the ingredients I'm not I'm just not the biggest family but I'm going to eat it I'm still going to eat it so like I said it I mean you can check it out this is like someone's scary like he's like I'm gonna eat a frog but but hey I actually do love gummies it's a solid um no just candy so like that's the other thing so I get y'all my own perspective on it not think about it like this it's candy so like how much candy you know eat a lot of candy so what you shouldn't eat a lot of candy so this obviously is not go ahead that much you know I mean how much yellow down you actually ingesting if I just eat this now by II like 40 of these wrong you know but my thing is you know what do you need now I found that CBD doesn't really give you an effect like smoking weed or take an edible that's on my dad um it's more so like what you got going on to helps your body this is what I feel like is how I feel about other people may feel different but if you have something going on you're stressed or you just worked out or you headaches stomach aches a bunch of different things you know it can help it can help with all these different things it just depends on the person I mean like maybe you didn't find the right simi D product maybe didn't you know you ate somebody was supposed to and that's also affecting you as well I mean like pretty much my experience with that was that well I had a lot going on this past week just in terms of like getting back to being busy a little bit and um you know doing some different things doing some different things so that gummy was nice for me because it kind of held me to take everything in stride and just relax so like I'm doing a lot and I ain't a gummy and I still have more to do that kind of held me to not stress about what I had done and worried about what I got to do in the future and just kind of like you know relax in the moment like I said it's no really it's not really an effect it's more so it takes away from like the issues you got so if you got something going on anxiety just an app it might help with that yeah I mean like my experience is that it has helped me see me just help me sometimes with you know relax it's like a big thing you know just this world they guys moving so fast man they got it's moving so fast like we gotta protect our minds ourselves so any any any product that I can give to help me relax de-stress cuz always a good thing so next up so that was the gummy the other product I'll be reviewing some rounds like I said earlier no I'm gonna check it out again your is from Green Rose this one you might need scissors for I kind of messed up the perforation and I missed so like I said the plastic really thick it's good quality in that regard so I had to go get some scissors this is a thousand milligrams of CBD right here in this here syringe I know a lot of people I remember the first time I seen this over uh what are we doing with that on they do this with cannabis and other things as well so I've been working in dispensaries in I remember the first time I saw it I was like uh you know I mean he's just a little taken aback but it's just a syringe it's not a needle on in it's just to push out oil so honestly this is one of the best ways I would say to ingest CBD so as I was saying I'm very careful with this make sure you push it real slow cause it kind of will come out like liquid it has been sitting around on you keep it in the fridge and keep it you know a little bit more solid like that so pretty much all I'm gonna do is take little bit onto my finger my asthma sit now for a little bit was a little more you got a bun of your tongue but that's okay it's a little bit extra get it up under the tongue that's the fastest way to get it into your into your system sublingually so this one this is gonna be a lot more powerful than the gummy if you need more relief I will say go to this if you're in more extreme pain go to this that would be my recommendation you know once again none of this stuff is proven to work a hundred percent or anything like that these are things that we are just trying and research is still finding out more about yeah so once again Green Rose is the company and this syringe is what I'm using right now it definitely has a taste to it it tastes like him with a little bit of like cantaloupe rides like I don't know what that is but there's definitely a earthy herbal taste too and you know that that came from him for sure sure so um yeah that's um you know I talked to some different people that use this Ella books like I said this is one of the best ones that you can get because you can do so much with it you can cook with it like I say you put it right up under your tongue you could probably even mix it in like tea or some of my dad like you know you can do a lot with it and from my experience and people I know that use syringes like this they they and me you know I would say use it you can use it in the morning to just set your day because it's so strong and potent it'll last for a whole day or for you know depend on how much you use once you figure out your dosage that's another thing doses is depending on person so you know there is no like you know you can say 10 milligrams of CBD 5 milligrams of CBD there's no really exact number that people need or that we know that people need you know personally I think the way this works especially with herbs and plants and stuff like that is that we're all different and you gotta listen to your body like you guys do it and try it a lot of people are afraid to try it so get that out say hey don't be afraid to try to stop I'm saying it's just I mean some oil right it's not gonna take you to another dimension this is just CBD so help you relax just feel chill so yeah I definitely recommend you know playing with it and finding your dose so that you can know how much to take and what time today and then you can play with that you know okay I took a little bit this morning I don't think that was enough let me take a little bit more at two o'clock okay oh I took too much yesterday I'm not gonna take that much today you mean all these things you gotta monitor and learn about yourself as you go so maybe I recommend writing down if if that's just something that's easier for you write down how much it took what day what time and then later on in the day right if that helps or if that wasn't enough or if you needed more if you need the less you know but I know a lot of folks say some CBD can make you a little bit sleepy if you do take too much so you definitely don't want say too much and this is is this is probably the easiest thing to take too much wit just because you know it's very concentrated the gummy you know that the whole thing is 25 milligrams so when you go to eat that you know that you get now this one you gotta like look at the little lines right get up there and look at the lines and be like okay I wanted to squeeze out two lines today yeah or you know a big chunk you know from now in an hour or whatever so yahwea try to probably yourself um definitely quality stuff right here like I said I'm not a biggest fan I'm not the biggest fan of the ingredients on the gummies but this one is just straight-up oil so you know it's not really anything ingredients in this yeahjust hemp seed oil kosher grade vegetable glycerin unless it then and a proprietary terpene blend so I've definitely a bigger fan of the syringe as opposed to the to the gums but the gummies do things good though I can't fake the gummies tasted good so I'm gonna go ahead leave y'all with that if you have used this product we would love to hear what you thought so go ahead and comment down below in the comment section leave us a little bit of you and let us know what you think pass on that knowledge maybe somebody maybe you give us some insight that I didn't give and somebody else wouldn't could you better enjoy that so we would greatly appreciate that we will also appreciate if you like this video and subscribe to our Channel I'm gonna head out peace", "DmBZCdjmUsY": "hey guys Sam here welcome to OD reviews in last week's video I covered the basics of CBD you guys a little background info about my story coming off of some super invasive antidepressants and talked about how CBD has helped me throughout that process and did a demo dab of the CBD isolates lab from Sammy distillery and a little review on that so you haven't already be sure to check that video out this last week and a half since that first video went up husband incredibly unproductive for me so I'm sorry that it's taken so long to get another video up but to catch you up I went down to zero milligrams so I am completely off the antidepressants that I was on I assumed that going down from five milligrams to zero would be somewhat similar to the ten milligram to five milligram drop which wasn't quite as bad as some of the other ones along the way going down 30 40 50 milligrams at a time but I definitely assumed wrong on that one when you're on such a high dose of a drug as invasive as pristiq is for as long as I was which was almost seven years I think that coming down to zero is just a total shock to the system no matter how fast or slow your weaning off of it I don't know if you guys could just tell I just had like a big chill go through my body yeah I could tell my body was pissed off and looking for higher doses still when I was on the five milligram but now that I'm totally off and there's no SSRIs or SNRIs in my body whatsoever that's like my system is just revolting and every way possible to get my attention so these past four or five days have been especially brutal to say the least my body's not really regulating temperature the right way the nausea has been pretty unbearable that's the worst part for me the zaps I think I mentioned in the last video at this point I've become pretty much non-stop I guess the best way I can describe them is it's what I imagined it would feel like if you were to stick your finger in an electric socket a dull electric socket but for the entire day or something it's a really bizarre feeling yeah not sleeping a lot not eating a lot my back and my neck are locking up a lot more than they were when I was still weaning down so some rough days but all that being said I got a couple more grams of the CBD isolate and some serendipity terpenes from the Seabee distillery a few days ago and I was planning on doing that as a review for my second video but I've been having a lot of trouble actually getting on camera to smoke anything with the level of nausea I've been having and when I do smoke it's feeling pretty tough on my body right now like the actual act of smoking so I was really really excited today to see that this package arrived with a bottle of 500 milligrams CBD t-shirt from this distillery so I'm going to review this instead could not have come at a better time I'm really excited to see how it goes um I've never tried any tinctures so this review is for you guys but I'm also pretty pumped to see what I can do myself so why don't you guys to be able to experience the whole process with me so yeah this is one of the CV distilleries new full-spectrum 15 milliliter teachers they carry at 250 milligram and a 500 milligram this one is 500 I've been getting a lot of questions about tinctures whether or not they actually work do I like them are they better or worse than dabbing and the truth is I've never tried them so I'm gonna go ahead and drop a couple probably a good number under my tongue so we can get it kind of into my system let it sit for a minute or two and then I'll come back and talk about the product so even here and just go right under my tongue okay so it's been about a minute and a half um first impressions first of all I like the taste a lot it's subtle but it has a pretty distinct hemp flavor to it if you've never tried him it's just pretty earthy and like I said though not too strong um the ingredients on the back just CBD extract hemp seed oil and MCT which is with coconut oil so we've got a high quality product here no [ __ ] you know I love that about the Seabee distillery I feel like a lot of the products that I see out there they're fun you know I mean like they seem like fun products which is cool but for me I want something that really is gonna do the job and CV distillery has not disappointed yet so far it's actually I'm kind of surprised at how fast it's working it's been about two minutes yeah and I already my nation is starting to go away which is always what amazes me about CBD and see the color of it is kind of a green Brown comes in this little glass bottle with a dropper top the size is perfect I like that it's something I could just have in my pocket or my purse in my car in a backpack super convenient that's a huge plus you know I love the isolate and it's my go-to but especially having this issue that I've been running into with not being able to smoke lately and also just not always being at home or somewhere where you can smoke I think this is a really really wonderful alternative so I like that it's super discreet it's quick it's easy to use you guys saw you can just put a couple of drops under your tongue yeah and now I'd say it's been four or five minute it's um I was shaking a lot before and that's gone down a lot I was sweating before I don't feel like I'm really as hot my body is kind of regulating a little better the knowledge is not totally gone you know don't get me wrong it's not like you use two drops and you're not gonna be sick anymore but I am interested to see if over the next half hour or hour the not completely subsides that would be cool to check out and I'll definitely let you guys know how it goes in the next video I'll probably start off with a wrap-up I guess of this team sure but um so far I can tell you that I already recommend this product coming from these past few days of not being able to actually smoke CBD and knowing how much it helps me getting this product today has been really really exciting and yeah I hope that this review helps you guys out if you guys are looking to buy some tincture or check out the CB distillery please check out the link in the description of this video and as always if you have any questions feel free to hit me up in the comments have a great one", "WOzIBpjXnSs": "guys welcome to try healthy first time here awesome awesome get a chance subscribe to our youtube channel like us on facebook twitter instagram google us try dash healthy tri dash healthy.com guys how did you sleep last night [Music] guys if you're not sleeping well shoot me a text eight four four ninety nine tempo h e m p o four atm po hempo guys we need to start sleeping good i got some answers for your questions so shoot me a text you get a chance check out our website we've got a great selection of delta eight products you guys don't know about delta eight thc guys shoot me a text you know the number eight four four ninety nine tempo atm po you guys knew that also online five dollars off cedar bombs and rose bombs even the little guys normal price 20 we're taking five bucks off use promo code happy free shipping guys if we're not sleeping we got a great product i've been using it now for about two months um it's our steel valley nights our melatonin oil cbd thousand milligram plus melatonin great sleep aid guys shoot me a text i'll get you some more information or just go to our website today we're talking about a thousand milligram steel valley cbd oil lemon lime flavored guys lemon lime so looking for some serious relief uh that that only a full spectrum changer can provide but can't stand the crude hempy taste that often comes with it well look no further guys steel valley now has a lemon lime t-shirt 1 000 milligrams guys we got to go all the way to florida to get inspired to make this lemon lime super smooth containing 1 000 milligrams of full spectrum cbd in the whole bottle which means there's 33 per dropper full which means if you have a half a dropper you would have 15 milligrams so 1000 milligrams in the bottle 33 milligrams for a full dropper if you take a half a dropper 15 milligrams i can be effective when dealing with ailments such as pain nausea insomnia and much much more the oil is flavored with all natural terpenes that when blended together create a topical a tropical blast of sweet citrus and a tart lemon lime flavor that's sure to mask the uh the possible unsavory and earthy taste of natural hemp oil um i learned this with medicine guys and when you're a kid if the medicine doesn't taste good not having it nope no thank you as soon as they switch it over that bubble gum flavor first in line i'm taking as much as possible because why it tastes good guys the lemon lime is super smooth super sweet with a little bit of tart to it it's good guys really good 1 000 milligrams get it online try dash healthy we're selling them for 75 dollars now you can buy any three oils and we're going to take 20 percent off so take a look at that we have three great locations we're in niles ohio boardman ohio and of course venice florida you can use our promo codes chris jordan christian nick or happy and we're gonna take five dollars off your order guys go to trideshealthy.com or shoot me a text eight four four ninety nine tempo lemon lime guys florida inspired it's good check it out", "ojx4dexUt8o": "[Music] welcome to the organic leaf we take freighted manufacturing premium quality CBD products we believe in 100% transparency with our customers and affiliates that's why we provide third-party testing documentation and QR codes on every batch of product that leaves our facility I'm sure you have already heard about the benefits of broad-spectrum CBD on your overall health but choosing the right company is essential in assuring you're getting quality product what makes the organic leaf difference we use minimal organic ingredients when available to ensure freshness our products are grown and farmed by one of the top USA producers for consistency and quality control due to our specialized co2 refinement and purification process the THC compounds are removed this means you can enjoy the maximum benefits of CBD without the THC side-effects the organic leaf brings the purest premium broad-spectrum CBD products to our customers our flagship products are our hemp oils and tropical CBD balms that come in a variety of strengths the organic leaves soft gels and fruit gummies providing measured amounts of CBD for everyday use but we didn't forget about your furry family members we also offer CBD pet treats and hemp oil as well experience our difference for yourself visit us at the organic leaf", "ACxtu7oITow": "midnight in the rain Sarah's on everyone at Ivan kabocha calm hitter bring you part 3 in my series on the uncanny full spectrum CBD oil relate to the party this is me basically finishing up my experience with the unque on a full spectrum CBD oil this being my second bottle start this journey probably a good two months ago so why did I start it one looking into things like CBD oil with respect to you both kind of stress anxiety trying to limit that in my life as well as something to maybe help me sleep better to the end for me personally I've just been a better father for my boys that were being rested as well as not having as much stress that in turn honestly I think leads to me being a better father for my boys and that more patience for them and stuff like when you're well rested things are easier to deal with or just with less stress so to that end that has kind of been the premise of me getting into full spectrum CBD oil with on canna how has it worked for me kind of over the last two months I will say something changed it up between my last video part two and now in that as far as dosage wise the first like month basically for the first bottle I was taking about half of a dropper which come to find out since it's not marked is about half a milliliter well per the directions like recommended serving one milliliter is one serving so it's basically taking about half a serving in the morning for that first month or so for the first bottle and for this bottle I'm like you know what the second video I'm like I'm gonna go ahead and take one serving in the morning one serving in the evening which equates to basically one like recommended serving unbeknownst to me at the time I will say about three days into that for whatever reason again sample size of one but taking that second half a dropper full at night before bed those next three mornings actually woke up like kind of groggy previously I'd been getting to the point where I was actually getting really good sleep and then for whatever reason when I started taking that second dose in the evening for me personally I was waking up kind of groggy and that was leading right into me actually heading back east to go do some filming with kalashnikov USA and then immediately following that going to compete in the tackle games and I'm like nope not gonna do that maybe this will you've been itself out and it'll be a non-issue but I'm not gonna go compete like waking up feeling groggy so I was like we're going back to one in the morning and call it good so basically for the duration of my experience aside from those three days I've been taking half of this which is about half a milliliter I will say moving forward with respect to the company they had since Mark these so it actually shows you like gradations on here so you know exactly how much you're taking which i think is awesome I'm really glad that they did that with all that said what is this done for me as best I can looking back over my experience again there was kind of that first two-week period where I don't know if it was a matter of getting this into my body to a certain level like a threshold where I started to see beneficial effects but I will say this is absolutely helped with respect to getting restful sleep at night and also kind of I think lowering kind of stress and anxiety mind you there's always going to be stress in people's lives from sources outside of our control and same with sleep like there are nights I've slept in an airport like there's no fixing that like it sucks to sleep in an airport like on an uncomfortable bench but traveling shoestring budget like making it happen and yeah like you can't get away from experiences like that that will end up affecting your life and the other thing quick side is I think there's a some really good benefits with this mind you try and find the solution so there's certain things that are chronic for people whether it's like chronic like issues with sleep or some other thing but then there's also hey why am i having trouble sleeping is it because of my lifestyle because of diet like whatever it may be same was stress like in my stress because of these external factors in my life did I actually probably have a little control over because from like a wellness standpoint it's way better to actually address the cause but having said that you also need a just a stopgap measure like you need to be able to come over here get some rest have reduced stress levels so that you can maybe figure out a way to achieve that in your life as far as lifestyle design whatever it may be so don't necessarily want to use something that's a crutch but if you have chronic whatever it may be and this is a solution like yeah but gets chronic it's going to be there forever find a good solution for it or on the other side maybe find something create some breathing room so you can actually deal with the root cause but I will say this has absolutely helped one with respect to getting restful sleep in addition to that kind of reducing those stress levels overall for me one of the things brought up in the comments of one of my videos was hey have you heard anything with respect to CBD oil and tinnitus and I said I haven't heard anything but now that you mention it I can't remember the last time that I had experienced tinnitus and I do have tinnitus so if you're unfamiliar that ringing of the ears and so I'm like okay like when was the last time started thinking about it I couldn't think about it like period I'm not sure when the last time was so I was like okay I will make a concerted effort and to that end I did went ahead kept a log in so probably around I don't probably less than a week after I started the second bottle and started keeping the log I first experienced it on the 16th of March when I was down tactical games I noticed some of it then I also noticed it on March 30th again on April 14th and on April 19th I will say all of those times to the best of my recollection in my notes it was all pretty pretty dim pretty mild it wasn't I don't know that I've ever had it like really severe but it absolutely was like I had to stop and like okay yeah a little bit of tinnitus right there it wasn't it wasn't pronounced at all and how often did I usually experience terrible test subject I don't know so I do feel like there may be some credit to that again over that span of probably about a month and a half had four instances that I could actually like notice and moving forward as I stopped taking this which I will revisit in about a month or so and let you know where I am with stress as well as sleep in tinnitus I'll continue to log that stuff revisit it now that I ran out of my two bottles and see where I'm at in about a month from now but to the end of tinnitus don't have a solid answer I will try and get you wanting something else I did probably about three days ago as of filming this as I was winding down on this very last bottle is I went and took a drug test went in I was like give me that Cup I got a pee I've been drinking a ton of water and I ended up getting the results back keep in mind sample size of one taking this full spectrum CBD oil from on kanna which has 0.3 percent THC mind you only taking about half a serving once a day for the past like two and a half three months now I guess two bottles of it came back negative then show up then showing up for marijuana or anything like that THC and in my saying you're gonna get those same results absolutely not if you have a job where you have the potential to pop probably I don't know you're a big kid like you make that yourself that was my experience though with respect to taking a drug test after taking about half a serving a day for the past two plus months so should you take this I don't know ma'am you do you I will say definitely helped with my sleep definitely helped on a certain level with just kind of stress anxiety for me and it's been it's been said to help with a lot of other things again not a doctor that's just kind of my experience after the next month I will check back as far as where I am with sleep stress levels to include tinnitus and let you know but yeah I definitely have found value in this is this expensive yes no I don't know on the one hand when you start looking at things like CBD oil it's not apples to apples so yeah something off CBD oil but one where is it sourced is it verified by a third-party all these different things I think uncanny really solid company one they do actually like third-party verify all their stuff additionally their stuff it's pure ie it's not like doused with pesticides and stuff like that which is important especially when you condense something down and the other thing is these bottles of their was it full-spectrum aller twenty five hundred milligrams of CBD in this entire bottle so each serving full serving one milliliter I guess it is has eighty three point three milligrams of CBD well why is that important well you might have mind you this bottle right here cost about one hundred and forty bucks you liked 140 bucks you're like I'm gonna get this other see video it's only 20 bucks it's like alright cool and so that other bottle of like CBD oil for 20 bucks has like 50 milligrams of CBD oil in that entire bottle you know what I mean so when you look at it actually try and make apples-to-apples if you're actually looking at getting some in that what is the price per milligram of actual CBE pretty good metric actually look at it at that point this starts to become a lot more cost-effective versus a lot of other different brands of CBD oil out there as far as the actual volume the CBD oil you are getting for the price that you're paying the other thing with price to keep in mind is it's like damn 140 bucks when you wake up from a bad night's sleep like how much would a good night's sleep be worth for you at that point or the other way is like you'll balk at spending like 140 bucks on potentially a good night's sleep for let's say a month but like no issue paying for that five dollar latte every day for a month like 150 bucks right thirty days I don't know it's kind of matter how you look at it you decided to pick some up there's discount code for you to use save a little bit of money on it and let me know it treats you I'm curious on your experience with it if you choose to go ahead and use some if you guys appreciate my content I greatly appreciate the support whether it's liking and sharing videos or picking up stuff over at Kipp agile comm stickers patches maybe badger than access and especially all you that support me over on patreon thank you guys very much all of that means a lot helps me get out create more content for you guys but as always thanks for joining us to keep badger calm look forward to seeing you next time [Music]", "sZSFPmw1Cp8": "[Music] our teachers are a great way to add hemp extracts to your daily wellness routine and they come in different potency options we have a 500 milligram a 1000 milligram and a 2,000 milligram each option contains a specified amount per serving so for instance our 500 milligram will contain 16 milligrams per serving our 1000 milligram will contain 33 milligrams per serving and it does specify that on the box and on the bottle and our 2,000 milligrams bottle will contain 66 milligrams per serving it comes in original and vanilla flavors [Music]", "q5k0bftNBp0": "hey good afternoon everyone jason here again frontier hemp co-founder uh really appreciate you guys taking the time to watch our videos we're here to help we're here to teach you a little bit more about the cannabis plant and how we can all benefit from her wonderful healing powers that she has to offer us and really quickly i wanted to just go over a question that we get quite often because a lot of people don't understand is what does full spectrum mean and what does an isolate or thc free mean and i'll try to touch on them as quick as i can when it when you're looking at choosing products whether that product is something that's going to go into your drink or something that's going to be a tincture that goes into your mouth or a capsule that has great absorption your deliverable is going to be dependent upon what works best for you and what we're finding is different deliverables work better for different people so outside of what way you want to take your cannabinoids you have a more important question is do i want to take a full spectrum product versus a thc free or an isolate based product so a thc free and isolate based product is a very simple way to say that everything from the cannabis plant has been extracted out of it and the only remainder is a pure cbd molecule that molecules in a form of a very white crystalline powder um and it's it's 99.9 pure cbd so there are no additional plant molecules there are no flavonoids there are no terpenes there are no other cannabinoids that or other ingredients in addition to the cbd purely cbd so why would you take this versus any other product since this cbd isolate based thc free product doesn't have thc what you get is the opportunity to experience cbd without the risk of drug testing people are still taking drug tests for all sorts of different things and cbd isolate is a way that you can experience products without having the concern of a drug test so if you don't have any concern with drug tests um especially dealing with a hemp based product i would say go full spectrum because with full spectrum you're going to get a larger profile of cannabinoids that have their own healing properties you may get terpenes you may get flavonoids you may get some different plant material that's also very chlorophyll that's very good for your body and the way we look at it is the more of the plant that you can consume the better so when choosing a full spectrum product you're going to get a little bit of thc in that and so thc sometimes provides a little bit of a sedative effect it's relaxing if you take multiple droppers you actually might feel it but it's always under the legal limit for hemp based products of 0.3 percent thc which basically means less than one half of one percent a third of a percent is all the thc that's allowed to go into any hemp-based products to be legal and compliant so uh you have a couple of different options when choosing products from our website a cbd isolate base which is just purely cbd and nothing else and then a full spectrum product or a full profile full plant product easiest way to remember full profile full spectrum isolate one isolated cannabinoid so i hope that clears up a little bit of why you might choose one or the other and we look forward to hearing your experiences from taking both because we're hearing feedback that both are very helpful all right so let us know if you have any questions shoot me an email give me a call all you most of you have all my direct number from our direct communication so let us know if there's anything that we can do to straighten it up or if you have any other questions let us know all right until next time", "_tuPV7PyqY4": "[Music] hi this is Ron Roberts from CBD top ten calm and what we do here is review CBD products making sure that we get informed commentary and solid information for people like you who are looking to buy and use CBD we find a number of products that we pre qualify and make sure that they are good quality we check them out we find out what's good we tell you about it and we hope that we are helping you to learn about and to make use of this great product CBD and all the companies that are offering it to you now before I get into the specifics on today's review I'd like to go into a little bit of how we evaluate the products here we have five metrics that we use and they're all important for you as a consumer to give an idea of what it is you'll be buying using what you can expect it to do for you and we use a system of five metrics looking at the qualities that we think are important for you and those qualities are taste delivery potency effect and price then we combine those five metrics we divide and we come out with an average score and that fits us into the scoring for our system today we're going to bring you our review of CB distilleries 1000 milligrams CBD oil and it's a product that has held the top spot in our oil reviews for several months now and so you know it's a good one and I'm going to talk about it today and how we evaluated it to give it that high ranking we usually start with initial thoughts on the product and our initial thoughts for this one or that this company is a strong company they're very very high on education for their consumers and so you can read a lot on their blog they make a like an e-book available on the fundamentals of CBD it's a really good helpful source for you to learn as the product so after we make our initial thoughts we take a look at the different metrics that we use to evaluate the product and the first one on the list is the taste and when you open the Seabee distillery a thousand milligrams you can smell the hemp smells very authentic and we found that it was a pleasant aroma followed by a pleasant taste it's a mild smooth flavor with us like vegetation tastes like you're going to get with most CBD products no aftertaste to really bother you it's just an all-around pleasant experience so for taste we gave this one a 9 out of 10 the second characteristic that we evaluate is the delivery experience for a user and in this case we found that the oil was light and smooth and easy to take easy to swallow easy to have in the mouth it's administered by a dropper which is probably the most common method it's not one we're wild about but it is a common method used by most CBD oil producers and so this one we found with the dropper the smooth taste and we've impacted in the pleasant aroma again it's a nice delivery we gave this product and paint out of 10 the next thing we look at is potency and in this case we're dealing with an oil that has a thousand milligrams of CBD and a thirty milliliter bottle this is not the highest that we have ever experienced but it's higher than most of the oils you're going to see in general use and therefore you're going to get a pretty potent crunch from this a dropper or less will give you most likely the dosage that you're looking for so for potency we gave this one a 9 out of 10 [Music] for effect our review team found that this product brought on the desired distressing that you look for when you take a CBD product comments range from relaxed to stress-free it delivered on what you look for from CBD and perfect we scored this one eight point five out of ten and our last metric is price now this will vary there are very frequently sales from CBD producers and CB distillery is no exception at the time we bought the product it was $60 and that works out by a simple calculation to six cents per milligram which is an excellent price so with the many things that we liked about the product and this price it was a great value for us so for price we scored this one a nine out of ten for the overall score we take all five metrics divided out and get an average in this case CB distillery came in at an eight point seven out of ten that's an excellent score from our CBD top ten review team and we think that you'll find this is a very good product for your CBD regimen so thanks for watching this video please come to our website CBD top ten calm you can read the full review there you can compare to other products you can check out our blog for information about CBD and about various products you can check out some infographics that will help you make decisions on selecting and using CBD and be sure when you read our reviews to take a look many of the CBD manufacturers like to give our readers a break and we have discount coupons for many of the products that we reviewed so check it out you can save some money you know you're always going to see good products from the ones we review so thanks again for watching the video subscribe come back and watch us and stay in touch thanks [Music] [Music]", "BWU5Azbio1E": "[Music] enjoy an organic and natural boost of energy with hemp work CBD plus coffee berry extract coffee berry extract is a patented formula derived from carefully selected and hand-picked Arabica coffee cherries which are known for their antioxidant properties and naturally derived caffeine plus it's sourced from only Rainforest Alliance certified farms for an extra dose of Wow each softgel also is infused with neuro factor a unique profile of polyphenols that has been shown to support the production of brain derived neurotrophic factor BDNF a key neuro protein involved in overall brain function and performance coffee-berry neuro factor and CBD is the perfect mixture for the healthy energy levels in brain function you're looking for no jitters more energy overall well-being there's nothing like a healthy boost of energy from hemp or CBD plus coffee berry extract [Music]", "OUXC-oNTPfo": "[Music] alright thanks for stopping in with down the road show here today to talk about CBD and more what's the more for ringa the Moringa tree everything on the Moringa tree is edible and good for you good for your immune system good for your stomach good for your skin helps with edema and then on top of that it's got the CBD why am I talking specifically about this brand because I'm having a really rough day with my nerves and my my neck it pinched something about half an hour ago and my I couldn't stop the shaking in my head which was minor and you wouldn't be able to see I have two bottles of CBD and more one is 1000 milligrams now there's lots of companies out there that make 1000 milligrams - guess what sometimes a thousand milligrams isn't enough to stop your pain or the nerve damage or the shaking that's going on even in my hands kind of currently right now so but that is the life I have to deal with and what I have to deal with now so when a thousand milligrams isn't enough five thousand milligrams is what I have to turn to is once again this is CBD so I'm not getting stoned I'm not getting high I can still function like a normal human being and go about my day but if it wasn't for the 5,000 milligrams my CBD and more I wouldn't even meet in my truck right now riding along with my sister to go run errands I'd be stuck in the house in a ton and ton and ton of pain so I I love backing lots of different CD CBD products and telling you all about them and whatnot but as far as I'm concerned this is one of the better ones out there the top of the line if you have a CBD product and you think it's better than this well prove me wrong send it to me let's talk because right now CBD and more 5,000 milligrams that's that's it that's that's the stuff that's the ticket and so when when I'm having my worst days and the things are just beyond my control and no other CBD product on the market can touch what's going on with me or my pain nerve damage this is where I turn to CBD and more so go check them out and tell them down the road show since you thanks for stopping in", "Df_-7-wBpoM": "[Music] our broad spectrum line takes the flavorless tinctures you love and supercharges them with natural terpenes and minor cannabinoids this combination helps provide a powerful entourage effect to deliver strong relief cbd lion tincture oil makes a great complement to your favorite foods and drinks just squeeze a few drops into your daily routine and get back to feeling your best self", "s0Mm9QCanMs": "hi guys and welcome to the great hemp best CBD oil brands of 2019 we've got a lot of experience in the CBD market and we want to share with you the knowledge that we've built up from testing these products and these are the best products that we found in 2019 so far three things that we'll always look for in any CBD oil is we want third-party lab testing on every batch that just ensures that the company takes their quality seriously and we know exactly what we're getting in each bottle we want the co2 extraction method to be used so that we know that there's no solvents and contaminants getting into the oil and that's the best extraction method that's on the market at the moment and then we're also obviously looking for quality and price as well as effectiveness we want good quality at a good price and we want the products to actually be effective so you can rest assured that the top ten on this list I don't want to give you all those things so let's get right into the listener number one on our list is new leaf naturals new leaf naturals have a 100% focus on CBD oil if the only product they produce and they do that to make sure it's of the highest quality it's grown using US hemp from the world-famous hemp fields of Colorado and it's full spectrum which gives you the entourage effect for wool Ealing its co2 extracted and we've got a lab testing on every batch they also offer free shipping in the USA and new leaf naturals our go to a brand for full-spectrum CBD oil don't forget to use coupon code grant hemp to get a 20% discount number two on our list is joy organics joy organics are the gold standard of TAC free CBD oil and they offer a great broad spectrum product range which is made from max bioavailability so that means that your body actually uses the maximum will to CBD that are in the joy organics products there is lab testing readily available on every product it's u.s. grown hemp and they offer free shipping and it also got a money-back guarantee joy organics are the top broad-spectrum brands on the market in our opinion and don't forget to use coupon code thread hem to make some savings at the checkout CB distillery are number three on our list and they offer great value CBD once the company was founded because the founders thought that the CBD market was overpriced and they wanted to introduce quality products for a lower price they offer full spectrum broad-spectrum and CBD isolates to suit all users and their members of the u.s. hemp Authority the hemp is grown in Colorado in the USA and CB distillery are on a seed CBD mission to produce the best quality products at effective prices they also have quality customer service and you can use coupon code great hemp to make some savings and check out number 4 on our list is green fluorophore tanika's and they offer strain-specific CBD oz so you can get OG kush lemon skunk and ac/dc strains which all have different healing properties so they offer a full spectrum and THC free products and they also offer pet products and skin care products so they've got a good range there's third party lab testing readily available on all bald products on the site and they offer free shipping and a money-back guarantee in the USA once again use coupon code hemp to make some savings at the check of number five on the list is CBD MD and this is the first public company that's made our list they offer great value see videos that are THC free for a diverse product range so you can get anything from edibles to oils to skin care products even products for your pets they offer a range of different strengths of flavors to suit all leads and this is one of the best broad spectrum companies on the Mac you today use coupon code bread hemp to make some savings at the checkout coming in at number six is CBD FX and CBD FX are a veteran of the CBD game having set up in 2012 they have one of the largest product ranges available on the market today and they offer THC free and full spectrum products they're known for having some of the best flavored CBD with MCT oils on the market and it's made using us grown hemp and we've got third party lab tested on every product use coupon code great hemp 15 to get a 50% saving thanks for watching our best CBD oils of 2019 and don't forget to check out our site at WWF or all the info you need hemp and CBD", "6BzXtfa_z84": "[Music] okay this review is on a very popular product it's our 3,000 milligrams oil tincture this is a full spectrum product our customers tell us it really helps them relax helps them sleep it helps with any kind of inflammation or pain that you've got going on one dropper should do it under the tongue let it sit for 30 to 45 seconds the sublingual gland underneath the tongue is how the medicine gets into the bloodstream so you don't want to swallow it too quickly or else it goes through the GI tract and then some of it gets eaten up by the liver and you don't get exactly the dose you were looking for the effects so best case is leave it under the tongue for a while fantastic product you don't have to worry about getting buzzed or high because the THC levels are well under the legal limit of point zero three this comes in a 1500 milligram strength as well very popular product I encourage you to give it a shot [Music]", "hQ8lxpUZTHc": "hey friends Dustin here I want to take a minute and just shoot a quick video and let you know a little bit about our year as a family this last year haven't really said much about anything and it's not that we're trying to keep anything a secret but just really haven't said much and I wanted to use this video to kind of come out and let you know about are you this last year cuz I might think you might think it's interesting so 2019 we became farmers Fiona told me a year ago that I was gonna be a farmer so I thought you were crazy but here's the story I my day job is in digital marketing and one of my digital marketing clients is a CVD extraction facility and so I told Rachel early on you know it'd be a lot of fun if we could firm him this year so we reached out to our friends Albert Kelly who have planned pitch the idea to him they said let's do it so we jumped in and we farmed nine acres of industrial hemp this last year and again you might be thinking this is incredibly crazy Dustin farming and Dustin farming hemp I'm gonna just tell you right now this isn't marijuana the genetics that we use are bred for high CBD they're below the legal limit for THC which is the psychoactive property in marijuana the genetics are below 0.3% THC so yeah that's more used for things like aches and pains and people use it for sleep people use it for anxiety there's lots of different people use CBD I'm not going to really get into that because the FDA doesn't a hasn't approved CBD for treating hearing or preventing any diseases so I'm not gonna say anything about that no makin any claims but that's the reason that some people take it chances are you or somebody you know uses CBD so anyway let me tell you a little bit about the farming thing it was really a fun time for our family to be honest kids are teenagers now so it was a good time to be able to teach them about hard work at their hands dirty and there was some real invaluable experiences in the last year we got 12,500 seeds and we propagate those seeds in a greenhouse and when they were ready about a month later we transplanted those seedlings and about three or four inches tall into the field about a hundred yards behind me and about four months later we harvested the plants and at that time the plants were five or six feet tall that's tall as me they it was amazing to watch them grow be honest it was just a great experience and so yeah in the barn I don't know if you can see the barn I think see the barn behind me we hung dry about 9,000 plants and those in the barn and when we were done we combined the plants into a biomass form kind of a chipped kind of form and filled up about 45 super sacks that can hold about 350 400 pounds of this biomass we ended up getting 16,000 pounds of hemp biomass took it down to the processing plant that I worked for just down the street and processed that into CBD distillate and then we ended up making these tincture bottles out of it so we've kind of gone the distance with this whole CBD thing and so I kind of just wanted to tell you about that it's kind of a fun story but we've been up to this last year like I said chances are either you or somebody you know is using CBD right now and so here's my ask if you don't use CBD right now I'm not trying to convert you if you do use CBD I want you to buy it from our farm and here's why I'm gonna give you two reasons first of all we farmed processed formulated bottled and labeled these bottles right here ourselves so we did the whole thing I can tell you exactly what's in this bottle if you're using CBD right now CBD tincture CBD oil whatever chances are you don't know what's inside your bottle is it made from crude oil it's made from distillate made from isolated is it is it THC free or is there any CBD in it at all you can buy a bottle just like this says hemp oil on it and it's actually made from hemp seed oil there's no CBD in it whatsoever you can use it for cooking so you're paying a high premium for something that doesn't even have the medicinal qualities if you want to call it that not making any claims again of CBD so I can tell you exactly what's in this bottle because it hasn't left a 20-mile radius of right where I'm standing right now we've done everything ourselves second reason is because we've done it all ourselves it's just Albert and I doing all this we can offer it for about half the price of what other premium CBD brands sell these bottles for and so you can save some money so we offer it in two different doses there's a 1,000 milligram bottle and a 2,000 milligrams bottle both are under the legal limit of 0.3 percent THC that's less than one third of 1% THC so it's a legal product in all 50 states and you can go to green method Farms calm and purchase is there we'll send it to your doorstep free shipping maybe you don't want to buy CBD but you want to learn more about the farming maybe this is kind of interesting to you and you want to learn more about it at green method farms calm you can go check it out I made kind of a documentary video of the whole process from field preparation all the way to harvest so if you want to hear our story and kind of see some of the images of what we did this last year go ahead and and check that out if you have any questions by the way go ahead and message me you have any questions about the farming process if you have any questions about the products or what's in the products or whatever so anyway green method farms calm thanks for watching this video and we'll talk to you soon [Music]", "ekuzrt6nrXk": "[Music] [Music]"}