{"udKE1ksKWDE": "well we got us attention what the hell step 2 what's the story of since the policy rounding the cube is impenetrable doors right you got to deal with these guys how do we do this at the team I have unfinished business with Loki yeah get in line save it Loki's gonna keep this fight focused on us and that's what we need without him these things to run wild we got stark up top he's gonna need us so this all seems horrible I've seen worse sorry yeah we could use a little worse stuck we got him banner just like you said then tell him to suit up I'm bringing the party to you I don't see how that's a party dr. banner now it might be a really good time for you to get angry that's my secret that I'm always angry [Music] [Music] [Applause] send the rest [Music] guys call it good all right listen up until we can close that portal our priority is containment Martin I want you on that roof eyes on everything call out patterns and strays Stark you got the perimeter anything gets more than three blocks out to turn it back or you turn it to ash and give me lift right later clench up Legolas Thor you got a try and bottleneck that portal slow him down you got the lightning like the bastard tell you and me we stay here on the ground keep the fighting here and Hulk smash [Music] you you", "_Qq6dQwLh1s": "Loki's gonna keep this fight focused on us and that's what we need without him these things could run wild we got stark up top he's gonna need us so this all seems horrible I've seen worse sorry yeah we could use a little worse stuck we got him banner just like you said then tell him to suit up I'm bringing the party to you I don't see how that's a party dr. banner now might be a really good time for you to get angry that's my secret captain I'm always in hold on", "vdcDRn_3p54": "[Music] too many thoughts on my mind i can't sleep at night so i just keep writing i don't need no help i don't need opinions so don't waste my time then i just been living online my city don't show me no love and that's fine but local radio stations", "TSHlXdMadIs": "do you live with a rage monster do you have a middle school-aged kid in your home who seems ready to explode that's what we're talking about today on majoring in the middle I grew up in the late 70s and early 80s I remember the Hulk being a much different character than he is depicted now back then Bruce Banner was always trying to manage the big green guy and get control of him the newer movie seemed to paint the Hulk in a slightly different light today he's more like a superhero who's in control often share a picture of the Hulk and Bruce Banner with my students and ask them if you had a brand new Ferrari which one of these guys would you trust to take it for a spin without fail they choose Bruce Banner he's kind of a no-brainer he's the one least likely to end up with the new car in a ditch if we think about the Hulk and how he functioned back in the 70s he would emerge when Bruce Banner lost control and smash everything later Bruce would call back down and reassume his normal demeanor the problem is at that point there would be so much damage Bruce would look around and see all the destruction than he had caused when he lost control and he would have to deal with it I mean the man was constantly having to buy new shirts if memory serves me right it really is no different for our kids when they don't know how to self-regulate and they lose control they end up saying and doing things that they often regret once they calm down this is why it's so important for us to help them detect self-regulate and get a handle on all of that rage here are some tips for your child to control their inner rage monster the first step toward regaining control of emotions is to notice talk to your child about recognizing their physical and mental signs our bodies give us clear signs when we are in danger of losing control our hearts start beating faster when our breathing gets more rapid it can be hard to think straight discuss the physical check engine lights that appear when your child is losing control and take note of them the second step to regaining control is pause just as we press the pause button on the DVR when we want to stop the action in a movie we need to pause the action in our own lives when we're at risk of losing control discuss a signal word with your child that could represent a pause button some examples are stop chill relax but it's best to let your child choose the word or phrase that they have ownership of the third step is think twice often our first thoughts are just emotional reactions they're not the result of thinking clearly and they are often not the best ideas when your child thinks twice they ask themselves questions they tell themselves what they need to do to think clearly and they name their feelings modeled aloud it would sound something like this wait a minute do I have all the information here what assumptions am I making am i looking at this from the other person's point of view I need to take a break and breathe for a minute I'm feeling angry practicing these strategies over and over until they become habitual is the best way to equip your child to deal with their anger in a way that's a lot less destructive than that big green guy well that's all for now but please check back next week for more information on helping your child to manage their emotions don't forget to like this video and subscribe to be notified of new content about life with your middle school child I'm Andy Stewart and I'll see you next time on majoring in the middle", "_xnaoZx1Q2o": "I guess the best he could do is some massive anger management program I would think anger management is not about managing the anger once it comes on it's about managing your physiological state so it doesn't come on so he was a perfect candidate for anger management he needs to know that the adrenaline dump that most of us have before we yell at their wives or drive too fast is somewhat Cavalier to us and somewhat yeah what a big deal I got anger I all that her new study shows it over he can't afford that the holiness does a guy that needs to be hyper-vigilant whatever good things are his personality keep them but I would suggest a intense course of psychoanalysis to really find out what his triggers are well why is his ego such that he gets triggered this way does he really hate it so much these yeah he puts no work and the funny thing I have managed anger he drags it around like he's a martyr to this condition well but you know why you know there's Eastern philosophies there ways to Zen down your intensity and all kinds of stuff in what you can do show out I won't say him going after that he's like the alcoholic instead of going to a meeting keep searching for the cause of alcoholism meanwhile he's got a liver with alcoholism whoa liveth rage so destructive that if brought about a killed maimed and collapsed structure at that loved you", "jgC8y0ksrRg": "okay my turn I am the whole lab abomination oh look I'm so sad I don't know how does it bend myself right now at Burger King you can go like all sets Incredible Hulk toys one for kids meal Incredible Hulk toys are now at BK", "qmG-UmiY0vQ": "[Music] should i neutralize them they'll do anything come on [Music] [Music] [Music] under control general I'll let you know if we need you unacceptable unseat your asses down there immediately I want a full court evacuation now I'm shutting you down god damn it did you hear with the general sent I said down [Music] [Music] locked down the entire facility immediately target still moving towards below evacuate the main hall sending backup heavy weapons issue General Quarters [Music] [Music] gemination sir system readings a red line [Music] shut down all power to the main hall show them the way out would fight him outside [Music] [Music] you", "z9Jg2GOEgQk": "ah is", "A_jijBTbfnE": "[Music] that might be a really good time to be getting you wanted to know who I am that's my secret [Music] amazing you're smart you're Bruce Banner", "IZmbM787F3s": "t-h-e what is up my tac family it's been a minute since i've talked to you guys um if you follow me on instagram you probably already know why but if you don't go ahead and follow me right there thc dot re but um anyway i was just telling my instagram people that uh i wouldn't well i can't make any uh marijuana content because um i had a drug test so yeah i had to get clean for a little bit but uh today i took the drug test so now i'm free to do what i want and uh i went to mission dispensary i picked up two things two things uh i think i'm gonna just do uh one thing for this video and then the video after this i'm gonna do another video explaining the other item but i wanna let you guys know mission dispensary that's on 85th and commercial mission dispensary in chicago was great service great experience i love the setup of the dispensary um the prices were good like everything about this dispensary gave me good vibes and you know i got to let you guys know how i feel about the dispensary so you guys can see for yourself and i wouldn't just you know let you guys know if it wasn't true uh but yeah let's check out what i got today no matter of fact let me show you guys the inside of mission dispensary i got a little footage right here reported online and um yeah i was in there like five minutes you know that's the best thing about it so right now what i'm going to review is a brand that i've never had before so it's my first time reviewing this brand and we got some igm pre-rolls ibm stands for i believe i'm not a mistaken illinois-grown medicine um let me see if it says that anywhere on here yep it does it look illinois-grown medicine and it's a pre-roll joint these are one gram of a strand called sunburn i'm gonna give you guys a closer look you know how i do it um by the fact i'll give it to you right [Music] now [Music] but yeah back on the sunburn um this is a one gram pre-roll uh coming in at 25.01 thc uh you ask how much this cost because usually illinois at dispensaries pre-rolls like for just one single one gram pre-roll you're looking for anywhere to 18 to 30 bucks probably this maybe 16 bucks too but this ten dollars ten dollars for a gram so it had me kind of skeptical like why is it only ten dollars you know and i've seen the strand i mean it looks you know sunburned 25 percent thc i mean full grand prix roll you know it looks nice um you guys seen the inside it smells amazing sunburn wow pre-roll it looks nice it looks like i wrote this myself because this is how i close the uh close the front of my my joints you know i don't do the normal twist method like most people and um it's a little space right here but you know we can just burn that off or cut that off snow no biggie i'm pretty sure that's the full ground though because the king size raw and um oh man it smells great actually smells great nah like it has that funky that funky aroma to it for sure um i get some some good some good stuff whoa why is that joint doing that i don't think it's supposed to bend like that i hope i didn't just do that okay let's see how this um let's see how this smokes let's see how it burns you know let's see if we get that white ash you know i love that white ash um now there's all that's left to do is to spark it up you guys know the rules we don't just burn and flame it up we you know burn it you know gotta let it burn a little bit you know so we get that that red circle so we can know it's like burned evenly you know smoking sunburn on g you know i think it's og but cheers to you guys you know just cheers to you guys for anybody that's watching this you know i appreciate you big time heavy especially if you support me on a regular like man you don't know how much it means to me uh like it means a lot seriously so this one's for you guys for sure thanks wow before i even start reviewing first things first you guys see it you guys see it that's the white ash beautiful that's what like that turns me on man like [ __ ] the money [ __ ] the sex like when you know when someone passes me a joint with white ash or i flame up with joy white ass that's that that right there that's what gives me you know [ __ ] gets me gets me going and i'm just [ __ ] with you guys i'm [ __ ] with you guys but look seriously though uh our first rips um it's a very weird taste i'm not gonna lie to you um i never had sunburn before this i say the taste is weird because i never tasted this before um it's actually not a bad taste though it's a weird taste it's just like because i never i wouldn't expect this taste i'm trying to find out how to describe it bear with me let me take another poll honestly guys this is a tough tough review because it's not bad it's not a bad you know um strand i know it's been a while since i've smoked but i know weed doesn't taste like this i'm gonna try to describe it as best as i can it tastes uh like a fruity you know um fruity weed basically that's what it kind of tastes like it has a sweet taste for sure um it tastes very good you guys see the stacking white ash man i'll see how long it goes too i'm not even gonna ask it i'm just gonna see how long the white ash is gonna go for but um yeah quite feeling the effects though the effects aren't as heavy as you know normally when i give you guys a review first few pools i feel the effects um i don't know if i mentioned hold on what is what is this i don't know i don't know if this is a hybrid or or indica or what you know i don't know or sativa oh i asked it on accident [ __ ] okay i guess the effects are coming in um that very sweet weed um it tastes very good it's just a weird you wouldn't like i don't know like someone passed me this i'm like damn what kind of weed is this you know never like you know because the taste is just like you wouldn't expect it you know would i buy this again yeah for sure would i recommend this yeah for sure so what would i have to rate this pre-roll with the beautiful white ash the beautiful taste um the mellowing effects not too strong i'm still able to function um i would give this this sunburn i'll give it a nine you know um i was gonna give it a uh eight but i i find no reason to give it a eight you know i'll give it a nine out of ten for sure oh i recommend you guys trying this for yourself maybe somebody will be able to explain it better than me sorry about that um but yeah it's it's fire that's what i like one word to describe it's fire for sure wow it's like just like that a sweet aftertaste that's all i can explain like imagine if you just ate a piece of pound cake that's what this weed tastes like damn i just described it for you guys thc re hope you guys enjoyed this video if you did please like share subscribe head over to my instagram follow me i post there daily um and you know we can connect personally you know i can personally connect with you guys on my instagram so if you have an instagram i do recommend you to follow me thc.e once again and i hope you guys stay medicated stay high stay positive stay blessed thc man i love you guys i'm out of here", "ETFwUdDxAbI": "So, they think they can just\nthrow you away as they did me. What's wrong with me?\nWhat did you do to me? I got a visit today. A very unwelcome visit. I'm afraid\nmy hand is being forced. What did you do to me? You so much wanna know,\ndon't you? But I think no explanation\nwill serve you half as well... as experience. In any case, I still don't\nquite understand it myself. If they'd only\nlet me work in peace... Of course, my betters\nwould have none of that. So, you experimented\non yourself, didn't you? And passed on to me.\nWhat? An alteration. Genetic. A deformity.\nI guess you could call it that. But an amazing strength, too. And now, finally unleashed,\nI can harvest it. No. You'll do no such thing. I will isolate it\nand treat it myself. I'll remove it and I'll kill it\nbefore it does any real harm. Oh, I'll bet you and your Betty\nwould love to destroy it. But would you really\ndestroy part of yourself? I don't think so. And as for Betty... I'm sending her a surprise visit from some four-legged\nfriends of mine. You see, I've managed to culture\nsome of your very own DNA, Bruce, and the results are tremendous. They're unstable,\nbut very powerful. What about my DNA? Let's just wait and see\nwhat Betty makes of the results, huh? No. You're crazy.\nI won't let you. Get your hands off of me.\nTalbot, what's this... Inside, asshole.\nI wanna talk to you. Listen to me,\nmy father's going after Betty. What makes you think you can go behind my back\nand get Ross to cut me out, huh? Listen to me!\nBetty's in trouble! You pathetic freak. Betty's in danger.\nI swear to you, she'll be killed. I can state the obvious. Something tells me\nyou aren't in much of a position to be making\nstupid threats to anyone. - Talbot.\n- Yeah? - You're making me angry.\n- Oh, am I? I got him! Open fire!", "dHSxQ2RRD9o": "anything about this creature it is your duty to report that to the police you're letting your imagination run away with you now I have never seen this creature that you're talking about forgive me doctor but I am calling you a liar mr. McGee mr. McGee don't make me angry you wouldn't like me when I'm angry", "XbUr98Z7MII": "[ __ ] video on hello rso sosa and today i've made it up the granddaddy dances and i've done a [ __ ] video i've come up here we're falling everywhere we're falling everywhere right we're gonna go for this topanga topanga called it's rob carter the [ __ ] [ __ ] it's a [ __ ] chopinga cannon i didn't want to touch the blue sushi i didn't want to touch the apple fritters i didn't want to touch none of it i just thought let's have one of these ones first on it i can enjoy them once later you know later later these are for now come on right so diamonds are forever this was [ __ ] fireballs we had the blue sushi when it was in the competition actually did it have to be that's why i don't want to touch bluetooth smells nice zappy let's have a look then [ __ ] shitty away from me don't [ __ ] work does it yes it's like a proper proper [ __ ] how you want every [ __ ] joint you smoke to be like be a poor man be a poor man right that's hit me straight in the face straight in the [ __ ] face [ __ ] now [ __ ] killed the [ __ ] joint i have killed the [ __ ] joint every toke is a full blown look at the shine come off you see my face shining more it started oh i've put the the devil's back six six six or something in someone's comment down down the bottom of the last video that's the instagram for these people all i can say really is is it frozen but every toke is a pleasure it's hitting you it's [ __ ] hitting you i think it was 250 quid for 10 of them but art luca said once you try it once you think get 10 of them play that rich i've gone after gravity go on people", "z26rYPr_oUg": "is about um we will discuss the dyno sheet in the future um if you guys get this video to i don't know what's a good light goal maybe a hundred likes next video will be me going over all of my dyno results and and showing you guys finally what this car put down [Music] [Music] first of all i want to apologize for the non-flattering camera angle i'm actually not back in california with the car right now i kind of have a setup for today's video that uh is very unconventional and i haven't done it before on the channel so hopefully it kind of works and actually in order to kind of avoid this awkward camera angle i'm gonna go ahead and share my screen really quick so on my last video i set my first ever light goal i asked for a hundred likes and i would reveal to you guys my actual uh dyno results and you guys absolutely obliterated that light goal at the time i'm making this video i think it's at over 300 likes which is you know obviously three times what i asked for obviously i'm gonna keep my promise but i know in the future that i need to raise that goal a little bit higher i didn't have a great way of presenting the results to you guys so i went ahead and i'm taking a page from you know the teachers that have had to do this for the past year and i'm actually using two computers and zoom and a powerpoint to go through some of this stuff with you and the reason why i'm not just throwing the number out there is because there's a lot of nuances and a lot of things that you need to consider when looking at dyno results so they need some context okay so for the mod list um the car obviously i've documented this stuff heavily on my channel i have a video for every one of these mods and people still dm me with what's done to my car so i have it all listed out here so obviously it's cam's now it has the upgraded valve train to support the cam as jba long tube headers with catless mids a 309 limited slip differential of course that doesn't add power just changes the power delivery um i have the 392 intake manifold cold air intake from jlt i said i had a frankenstein stein borla type catback that basically just means it's only the mufflers and the rest of my exhaust system is stock with also e85 with hellcat injectors and a dyno tune from full bone performance uh through zh tunes and it actually was through uh spankin time performance first so we're gonna go through those results as well a lot of people don't understand that their every dino reads differently they like to compare apples to oranges there's things like mustang dinos and dino jets and they all read differently and in addition there's also a bunch of different like correction factors that people don't take into account um for example there's sae and std i believe it's society for automotive engineers and just standard people like to advertise the standard correction factor numbers because they typically read higher than sae and when i mean they read higher they base it off of atmospheric conditions that are more ideal so like lower temperature better air density etc so i'm going to make a couple assumptions here so this car has been on two dinos one was at md automotive and the other was at full blown performance in la this isn't necessarily a great assumption but i'm gonna assume that they were calibrated similarly very confident actually the md automotive dyno likes to read torque a little bit higher than the full-blown performance dyno with that being said one reading isn't better than the other unless you like to advertise higher numbers and as you can see here i put an example from one of my dyno sheets you can tell what correction factor it's using it'll say sae or std right here so before we jump into the cam results let's talk about what the results were for my full bolt-on car so the car was full bolt-on on 91 octane without a cam [Applause] and on the md automotive dyno the video i made the standard correction factor was used so this is where it gets a little bit confusing um so i'm going to show you the standard results here on the next slide so the car put down a little over 370 horsepower and over 400 foot pounds of torque these are standard correction numbers moving on from that obviously i got it dynoed at full blown performance however before i got it dynoed at full blown performance i actually had an email tune on 91 octane from one of the big hemi tuners um he was one of the biggest guy for hemi tuning and i still see people like going to want to get tuned by him for this cam you guys know how many issues i had and i guess it's kind of you can lead a horse to water situation because you know people like i i showed that that you know didn't really work and i documented how many issues you have but um of course people don't like to listen when the proof is all there but i'm gonna show you guys a clip of the car on the dyno when it had the email tune installed when it had the email tune installed um on full-blown performances dyno it put down about 400 horsepower and 383 foot-pounds of torque sae corrected so as you can see there was a dip in how much torque the car put out of course since they were different correction factors i don't know if it was because of the correction factor changing or if i actually lost torque on that email tune so have the converted s standard correction factor numbers here so like 413 horsepower and just shy of 400 foot pounds of torque obviously still not great to be honest the air fuel ratio was absolutely horrendous i think alex said it was near the tens alex is the guy at full blown performance if you're unfamiliar by the way got that shirt on right now yeah that email tune it just it wasn't good i didn't have an afr gauge in the car so it made it that much harder for the tuner and it was just running way too rich stalling issues etc when i first got tuned by full blown and the actual tuner was spanking time uh obviously i switched to hellcat injectors that i could run e85 um just for reference alex estimated that e85 added like 10 to 15 horsepower it's not a super large gain as you see on like the 392. the 5.7 is a lower compression ratio car uh relative to those so it's like in the nines whereas i think the 392 is at least a compression point higher and then plus e85 also very much benefits boosted cars because you can run a little bit more timing because of that higher octane rating you're less likely to get knock and just for reference alex told me that a stock 392 on his dyno put down about 405 horsepower sae corrected i didn't include it in the slides but a j green tuned bolton 5 7 put down 345 horsepower sae corrected so about 60 horsepower less which makes sense my previously released numbers post i posted the dyno sheet before actually these were also sae corrected and it was about 425 wheel horsepower sae corrected now that's the number i released before i've said this number a ton of times that wasn't the final number of course but if you're curious it's about 437 horsepower standard corrected so this is that dyno sheet here as you can see there is a nice linear part of this horsepower curve um there was an issue i guess with the dyno or the software and i don't have the torque curve here but we'll talk about that more in the future as you can see it's revving out to about 6200 rpm making peak power just shy of 6000 rpm so uh yeah these were the numbers i've told you guys about multiple times [Music] moving on to the final results the car put down 338 horsepower and 448 torque sae corrected now if you're curious the standard corrected numbers would be 452 horsepower and 455 horsepower now i think that's pretty pretty impressive given that the car is naturally aspirated relatively low compression and only pretty much on e85 so we estimated that this tune and and the cam and the e85 added around 80 horsepower which is on top of what i already had with all the bolt-ons which is pretty good because as you guys know the numbers don't typically just add on to each other like one thing i do want to show you guys and this isn't my final dyno sheet but this does compare like the sixth revision to my email tune um so the blue lines are my email tune and the red line is the spankin time performance tune so everybody likes to look at that peak horsepower number and i always talk about this i always criticize it because i think it's a really dumb thing to do people just look at that peak horsepower number and think that's how much power the car makes in reality that's not how these motors work so you're also you also have to focus on the power that it makes in the mid-range and in addition to putting down 60 more foot-pounds of torque at the peak and over or actually around 40 horsepower um i gained close to 100 foot-pounds of torque in this mid-range and you know around 50-ish horsepower in this mid-range as well all the way through you're looking at 3500 rpm where there's a gain below it as well may i add 3 500 rpm way past 5000 rpm and this is something that people don't want to look at they want to just see that dino tune or they want to see that email tune they want to rev the piss out of the engine and make less power still so this car my car now is making significantly more power at a much lower rpm than it was before which is good for reliability reasons and just shows how screwed up my email tune was so the current state of the car the car is now tuned by ch tunes um still full-blown performance great drivability i don't have a photo of that dyno sheet because apparently there was an issue with the way the dyno was reading the numbers so i have to take the car back to full-blown performance in a couple of weeks here and i'll also have a new announcement when i get back there so everybody keeps dming me you know what's next now that you've canned it and it's pretty much good to go um on the left here you can actually see uh tires that i purchased off of a buddy on instagram a few days ago so there's 17 inch race stars on some 305 mickey thompson's um so i'm ready to make this car boogie um there's like i said there's a lot of stuff i want to do with the car in its current state before i do anything else or i get rid of it um so yeah expect more content expect some track days and you know just having fun with the car and i and i do want to do want to add a little conclusion to this video you guys saw these dyno numbers you guys saw the torque curves now you guys saw all this stuff um don't expect that the car you know performs amazing or performs bad based on dyno numbers as everyone says as alex emphasized a lot while i was there dynos are just a tuning tool they are not uh they don't indicate anything else other than air fuel ratio and how much power that car decided to put down on that day it really depends on how consistent the car is how it runs at the track etc so um when i take it to a track it's probably going to be some pretty slow runs at first because i've never been to a track and it's going to be a learning experience for me but that's you know all part of the game so with that being said i hope you guys enjoyed this video now you guys can stop blowing up my dms asking how much power my car is making um to be honest i never planned on actually releasing the numbers at all um i i just wanted to tell you guys a ballpark number but i was starting to get tired of the messages um so here's the video um i appreciate you guys tuning in if you stuck around this long um i i really appreciate it subscribe to the channel if you haven't already and i'll see you guys next time peace out [Music] you", "R8v7IQXN0rk": "this insane glass grenade is actually holding an 8 gram joint hi friends welcome to that high couple where we explore and discuss our passion for cannabis we are celebrating the holidays here in the dab and cabin and we are going to treat ourselves with one of the most expensive joints we have ever showcased on this channel this is some uh you made it to the end of the year you deserve this today we are going to be showcasing a hundred and fifty dollar joint this is a joint ladies and gentlemen this insane glass grenade is actually holding an 8 gram joint yeah what napalm's original grenade pre-roll seven grams of their premium gelato cannabis so you get a quarter all ready to start with yep then they add a gram of their live resin diamonds that concentrate component that extra like punch to it and then if that wasn't enough they wrap it in lift tickets yup lift tickets i love is an infused rolling paper we've seen them around since like the pre-legalization medical days so it was super fun to see that that was the paper that this was used for and we need to give a big shout out to mj one of our favorite delivery services here in los angeles we were able to get this luxury pre-roll hand-delivered to us so we didn't even have to go out and visit a shop during the pandemic yeah all right so let's get into the actual pre-roll itself oh i love it how insane is that yeah it just comes right out of the grenade i kept pulling this pin thinking that it came out but like not what you would think it's just the tag oh here we go pull it out and i love that the crutch itself is glass to make sure that it burns evenly honestly it looks and feels like a cigar it really does this is eight grams this is heft especially with this glass tip on the end of it this is impressive ganja marks groucho mars there we go that's what we're going for this is just a normal like standard run of the mill you can see look at that difference got some girth to it this is like maybe just over half a gram and this is the eight gram mega drink she's a big girl use something a little bit more serious than a bic just to make sure that you're getting it all the way across but cheers everybody this is insane we've never smoked anything like this before there's no way we are finishing this all in the channel in one setting we are not about to consume eight grams of cannabis but uh we're gonna get nice and stoney though oh man it's so it's it's so smooth because i've never taken a hit out of a pre-roll that has a lot going on with it the wax interacting with the cannabis yes oh my goodness it's got so many good chirps in there flavors are insane on that thing we should do something kind of special one of our favorite smoking devices yes does she smoke let's see oh my god guys she smokes we are going to be burning through this now oh okay that got the train out of the stations oh man this joint picked up the pace i'll say that oh my god there we go oh my god oh she pulling it just gets so milky so fast cheers everyone cheers [Music] wow forget all that is it december 25th because this is a holiday right now treat yourself you made it through 2020. this is fun for a birthday this would be great for new year's eve absolutely pick up one of these the next time you're in a shop or if you're just like in the la area amj.com is going to take care of you one more let's do one more okay well as we take this final hit if you want to see more insane cannabis product reviews like this all you have to do is hit this button in the corner to subscribe to subscribe bonus content from us like more videos click this button in the middle oh my god more videos from us right now either the thumbnails over there oh my gosh best ending ever thank you so much for watching good vibes", "crynw8hb1tg": "hello i'm tyler this is the imaginary axis and a few months ago in virginia a man by the name of eric heffelmeyer ran into a serious problem he was working on his truck in the family garage when suddenly the jack slipped and pinned him underneath the vehicle to make matters worse there was an explosion soon afterwards as leaked gasoline had caught fire and ignited several nearby propane tanks the fire started spreading all over the garage at an alarming rate and eric thought he was going to die until his 19 year old daughter charlotte arrived on the scene and despite standing at only five foot six and weighing about 120 pounds she managed to single-handedly lift the five-ton pickup truck off of her dad rush into the vehicle while was still missing a wheel and drive it a safe distance away before spraying the house down so her grandmother and niece could escape our bodies are capable of incredible things and as the situation becomes more and more dire those things become more and more incredible if you or something you love is in serious danger your body's natural response is to pull out every trick it has to try to eliminate the problem for most humans this activates something called hysterical strength but for bruce banner of the marvel universe it activates something incredibly different as a child bruce was abused by his father a lot the man was a raging alcoholic and he hated bruce his mother loved him but that just made it more devastating when he watched his dad kill her in front of him and this repetitive agonizing terrifying home life caused bruce to suffer severe psychological damage and eventually develop dissociative identity disorder if you're unfamiliar with the concept did previously known as multiple personality disorder is a rare and incredibly controversial psychological disorder that the scientific community barely knows anything about dissociation is the separation of normally related mental processes something literally everyone experiences like when you're driving down the road and suddenly realize you don't remember the last five minutes but sort of zoned out and autopiloted your way through the last three streets but dissociative identity disorder is when this phenomenon gets taken to the next level and you take up an entirely different personality because of the surrounding situation so instead of zoning out on main street and waking up at burger king you're a quiet bookworm who plays too much minecraft and writes pokey-shipping fanfictions one moment and in the next moment you're a hardcore skateboarder who likes to get drunk pick up chicks and party until the cops come bruce banner likely developed this disorder as a coping mechanism to deal with the way his father treated him one personality was meek quiet solved problems with his brain and didn't want to cause any trouble while the other personality was childlike and savage lashing out at the world for the happiness he never got to experience bruce's brain naturally severed these personalities to protect himself from his father shutting the hulk identity deep within his mind so he didn't foolishly lash out at a man so much stronger than he but later in life when he was caught in an experimental gamma blast the hulk identity emerged to save both of them and this was the identity present when a mysterious genetic factor in bruce's dna absorbed the gamma radiation and developed the ability to draw ambient gamma energy from the surrounding universe to become a massive and powerful monster it's understandable if you find that a little confusing banner actually has at least four different identities inside of him but we won't get into that today studies concerning did have discovered the mind and body really do treat each identity as a separate person for example if one identity is allergic to something but the others aren't the subject's body will really react to the allergy when that identity is present or if different identities have different levels of vision optometrists can really detect the changes in eyesight similarly when bruce banner is in control of his body he can't activate the gene that absorbs ambient gamma energy to provide him with ridiculous strength but when the hulk is in control he can't deactivate that gene instead he can tear through nuke proof doors hold a 150 billion ton mountain range on his back shatter an asteroid twice the size of earth support the weight of a star without being crushed and even punch through a time storm and what triggers that strength anger the hulk identity isn't the same repressed facet he was when bruce was a child he's strong now he knows it and he only gets stronger as he gets angrier just like we do when we need to lift cars or run away from predators but how strong can the hulk get humans are limited by what our muscles and adrenaline can sustain but if the whole can just draw gamma energy from anywhere in the universe he should be able to get stronger almost infinitely right it's a big universe out there i'm sure there's plenty of gamma radiation to go around well not quite not only have we seen in the comics that his cells eventually get so saturated they start giving off gamma energy but you just can't get angry forever it's psychological while marvel's best and brightest might agree that the hulk can theoretically draw upon infinite energy that's assuming he just gets angrier and angrier until the end of time which he can't when hulk gets angry it takes time for him to get stronger and he's been defeated in the past when his opponent manages to knock him out or kill him before he gets strong enough to stop them and therein lies the problem in many ways anger is a survival instinct we get angry when something doesn't go our way someone stole my food someone's keeping me from my destination something's trapping my dad in a fiery building it's your brain pointing out that something needs to be taken care of for you to continue living ideally the emotion exists to rally us up against things that could endanger us and as a result studies have suggested that it kind of has a time limit adrenaline cortisol hysterical strength these mechanisms exist to help us fight for our lives or escape predators or defeat competition for food it's only supposed to last until we can overcome an immediate threat and that's why if you deal with a threat that you can't overcome for too long you eventually grow apathetic after you've been angry and stressed for days on end your brain just kind of stops you don't care anymore it can be depressing or relaxing but you don't have the capacity for infinite anger and neither does the hulk his strength is very impressive he has a limitless resource of energy but he can't draw on it all instantaneously and after enough time has passed if there's a threat he still can't beat he won't care enough to get angry anymore as far as instincts are concerned why should he this thing might be massively more powerful than him but it hasn't killed him yet so is it even really a threat the hulk will never beat galactus in a normal fight because he'll either be dead in the first second or galactus constant toying with him will make him apathetic but what does it look like when the hulk has been pushed to the brink when he's as angry as you can fathom and right on the verge of apathy they call him world breaker hulk this version of the hulk is from a storyline in which he has lost everything he was banished from earth to a savage planet where he became king he was taught to focus his anger and concentrated on a target he made friends had a family and then it was all taken from him along with his wife and unborn child and hulk was not happy this hulk managed to hold together the tectonic plates of a planet larger than earth he nearly sank the eastern seaboard in a single footstep barely any hero on earth could match him at the time and he was still holding back to protect innocence when the hulk reached this level of power he became so dangerous that he kind of voluntarily banished himself to the dark dimension with red she-hulk a few storylines later a world where there are no innocents he's always been afraid of his own rage but here he unleashes his absolute strength against a true equal for the first time ever he finally lets it all out and even the bruce banner identity begins to fade letting hulk finally do what he wants the result well he charges at red she-hulk she charges at him and in one clash they destroy the very planet they were fighting on even though it was only hit by a fraction of their total force so if you're ever feeling angry remember it's okay we've all gotta let loose sometimes and anger can even be really constructive it puts you at the top of your game and makes you stronger but it's a defense mechanism nobody can get stronger forever and eventually you're gonna hit a wall so try to calm down or find someplace safe to let it out before that happens hey everyone if you're still with me thanks for watching a video where i explore the hulk psychology and biology all in one how great is that your view is plenty of contribution but if you really liked this video feel free to smash the like button or maybe even the subscribe button there should be links to other videos i've done on the screen right now so if you liked this one why not check those out you might like them too and for everyone who didn't get the memo here's a final reminder that there will be a live stream held tomorrow on this channel at nine o'clock pm eastern standard time we're just gonna hang out talk about comics fictional universes fictional characters probably a little q a show up if you have the time if not i hope to see you in my next video until then", "Ypwyt4QjyaI": "see befriend this [ __ ] let's get it let's get it what's the deal to the cnb frank gang i'm back in the youtube video today i'm about to go link up my man ryan t baby you feeling i know i'm starting like already dressing everything i have to go shoot a music video and i didn't bring my camera because i forgot i didn't know what time i was waking up i just shot a music video and shooting an intro for y'all you feel me a new youtube intro because i know y'all tired of my youtube intro so yeah i'm gonna go liquid with them right now because they wait on me i have to come all the way back home and grab my camera i don't know i shouldn't have left y'all right now i need to go get some gas low key i ain't gonna cap two y'all look nice and little freight kind of low on a fuel no cap i need a line up too everybody don't look too bad but this might be for my gas so we gotta get some gas real quick and then we finally gotta leak up with uh t and ron like comment subscribe because it's gonna be a banger like always it's gonna be a banker like comment subscribe and we're gonna have way more stuff coming soon no cap y'all ain't gonna want to miss none of my bangers from now on it's flat out bankers from this bankers that's the bankers okay i'm gonna hit y'all let me get there [Music] got that premium and [ __ ] you know i'm saying i'm about to get the glow in there but follow me on instagram seeing me on the scroll little fray nah i'm saying no capital yo we making movies no cap we're coming up so i need y'all like comment subscribe all right [Music] 10k plus appreciate it thank you appreciate it he asked me uh how much do my car run for and tomorrow when he grew up he want to be like me i'm like dude he already grown my god gotta be grounded no cap ground do not stop oh i won't look at sexy out there this camera is like oh captain y'all know how much y'all know how much [ __ ] but damn i'm on my way right now i know catholic oh around the t and i'm hitchhiking will get there no capita all right we just linked up my man around the teen on there right there and i'm saying [Music] me yes sir you got the five spokes on here yeah that doesn't look heat i'll count [Music] i've been yeah on capitalistic because i can see we look a tip full of already t is food t is full of art [Music] oh [ __ ] oh we got the toys out yes sir why rhyme riders have some i don't know don't ask me don't mind my break because my break seems a little annoying but you feel me we is what the game you feeling me no cop look on my brakes look y'all don't hear i think i need to get a new brake pads i'm going i don't know bro i think i need some brake pads because why do my car do that oh they bout to crash i don't know where we going so we just want to go real quick from the gun i'm saying yeah i'll meet y'all let me get wherever for the gun this is a container [Music] all right see you got that waiting manual no cap yes sir my man running i don't know right on the side of me [Laughter] it's quick you like that [Music] hey all three oh [Music] every time i take off i get sideways i'ma try i'm trying to go too crazy to the pedal game like if i'm doing a 20-year stab up i'll still get less always just a little bit good morning good morning you have to know how you doing man yeah goodbye [Laughter] you gotta hold it yeah you can click it turn off but it'll be turned off all the way down though there for sure hey you can tell each one of the ships too they don't just goodbye all right [Laughter] [Music] [Music] real quick oh hey let's see if we get a little bit of this sauce right here is live uh there's one thing i like about that that's why i missed my hood bro you can actually see this man yeah that's our heart goodbye it almost got me with it it'll fly off the freeway i was sick about that hey i color rebusted right now this camera i swear to god look at look how good it look on the camera though like all right that would just be busting like extra wet for no reason i can't wait till my rap because i said rap coming for that soon stay tuned probably come like next week or something awesome oh i just hey i just said that in the video today i'm doing a it ain't like a full car wrap though but it's gonna be something you know he'll be yeah something nice you know what i'm saying once i get the bumper straight i gotta go take that again get it painted yeah get defenders straight i'll say we'll come slight rap slight rap it's like no two major not too amazing you coming around all right guys stay tuned go subscribe to him right here i'm saying shouldn't be wrong you already know him for real we here next we're here next question we're here next question mark we're [Laughter] we might as well do a takeover right here three srts we'll just start a slide right [Music] hit a little harder [Music] uh [Laughter] look moral of the story if y'all want to own three srts all at once you know what i'm saying just stay dedicated you feel me like i'm sick i dropped three i didn't pay for two of them but hey man i got three srts you feel me oh no the man will be messing up in here i don't know what to do yeah you could try though shoot hey you know this for me see we uh you said it messing up y'all i don't want to mess around oh is that one see there we [Music] trying to give us a good pull in here you know what i'm saying all this all these cars [Music] screaming like whitney okay that's a lot i don't know i'll be doing that that's the thing when you changing i i ain't changing like i was gonna change them now i looked at them it just looked all right like you know like a knee tank [Music] are we right here where you going i ain't a lot of y'all from like me driving like i drive my 300 you all know the suspensions on the cars like different stuff like that this car feels way different than like in my 300 cups he like who owned that i don't know that's a backup car that's secured all right oh he got security on why oh look how my god give me a camera it should be nice as hell might feel professional yeah yeah you know you're like ugly hairline [ __ ] awesome who i thought i need a lot of though no [Music] [Music] oh he crazy he tripping he's drifting [Music] all right you know i said i hope y'all enjoyed that little part now saying letting t drive but for the srt youtube draw the charger wasn't really much of a big difference though i know i got cnb ron go subscribe to this channel he got more torque because he's still got his mufflers and stuff on him oh this bit bumpy they took me up a back row no cap what did big bumpy his dog oh my god a bit terrible oh look at look at this road look at this road look at this road all right now for all my shoe heads look at full locker man for locking for action kids blocker and i'm saying these brand new jordans they just just dropped today you feel me everybody in my mess up here this is the fullest i've ever seen this parking lot though no cap are you two so right now we're getting a new intro done you feeling me got the drum up in the air no cap it's right there right there y'all i think as famous as him oh there right we just got the new intro and all cabinets and so y'all gotta stay tuned for that people been going on my intro because it was booties so you're gonna make it do what i do baby you feel me all right gang that's the end of youtube video man i see that lineup you feel me know the cap or something something like not too major no capital like comment subscribe we come back with more bankers just stay tuned i'll see and we gonna be back with more bangers our game [Music] you", "4n__TRVpBeI": "Stewie Griffin scientist inventor infant searching for a way to tap into the hidden strengths that all humans have then an accidental overdose of gamma radiation alters his body chemistry and now whenever Stewie Griffin grows angry or outraged a startling metamorphosis occurs myself changing the style the creature is driven by rage and pursued by an investigative reporter mr. Tucker don't make me angry you wouldn't like me when I'm angry the creature is wanted for a murder he didn't commit Stewie Griffin is believed to be dead and he must let the world think that he is dead until he can find a way to control the raging spirit that dwells within him", "0ix43KHEfb8": "[Music] okay on the table these are protect you from yourself and you have a strong reaction [Music] your father strike oh come on graduate students [Music] you this will be a somewhat novel sensation we have begun the dialysis machine will mix the antidote with your blood so the antidote will only take hold once we've achieved a full reaction okay we are comprehensive Oh [Music] all right we said to Papa I take your hands off it [Applause] [Music] [Music] wait wait there's more wait we have to do do it now [Music] Oh God Bruce Bruce can you hear me Rosa [Music] Oh he's fine so fantastic I'm gonna turn that man's whole body of US Army goods get as far away from did you can go there are aspects of my personality that I can't control it's very dangerous to be around government hopes he's going in pull back now there you go they want it as a left and if we let it go we will never get it back so I feel taking another crack at him I want him I could probably arrange something like that you ready yeah that's even the playing field are you telling me another one bio force experiments is going haywire like that it's in me you", "CSaz1dXgG0E": "the number one pick and shovel play in the marijuana sector stay tuned you really don't want to miss this one hi guys in today's video i want to go over a company that we went over before but i'm heavily bullish on this company i want you guys really to take notice of this company maybe you're not you're not familiar with the marijuana industry um maybe you are but this company here i feel like it's the best pick and shovel play for this industry and i'm gonna break it down for you and i'm gonna tell you why within this video very important you stay to the end because i feel like this video at this price range where this stock is at right now can really can really benefit you guys in terms of making some profits long term okay everybody focuses on when the marijuana sector everybody focuses in on companies that are producing that are producers right we have companies like tilray we have companies like sndl we have all kinds of different companies well within those companies there's gonna be a lot a lot of competition okay so that means the market share for each company is getting reduced and as time goes by there's gonna be more and more companies more and more competition right so i'm gonna i'm gonna describe this company too i'm gonna go over it real quick we already did a video before if you didn't if you missed that video click here and you'll be able to see that video okay so the name of the company that we're speaking about is silver spike acquisition which is a spec but they're merging with weed maps weed maps okay guys um currently trading at 1964 which for me presents a huge buying opportunity this stock has ran up all the way to about 30 okay high 20s currently we do have 300 shares on this stock now i was invested in when i made that video i think we got in like around 12 bucks we ran it all the way up guys okay i cashed out i i was selling along the way because i had a lot of shares then i went and got opportunities with these facts you got to know that you got to get rid of some of your shares along the way because they do run up all the way and they do come down we've seen them come down however within the last couple of weeks you've seen that this company silver spike acquisition weed maps has really held its ground compared to many other um spacks okay so this company here i think i think has a great potential and i'm gonna break it down for you okay currently invested uh 300 shares at an at an average cost of 2091 i want to get that average below 20 and i want to build up anywhere from 500 to 700 shares and this is gonna be the perfect time to do it guys okay um let me let me get into something real quick for those that don't know weed maps is a online advertising platform for mj okay guys it's an online advertising platform now they're not just an online advertising platform they're the number one online advertisement platform okay in the whole us so just think about that their competition is very minimal the next big competition i think is ease but they have no type of market share like what weed maps does now i want to show you if you're not familiar with weed maps i want to show you there when you when you go on the website you usually get this this image here which is a map of where you're located and it tells you uh every pin that you see here on the screen is basically a pin of a certain company that pays weed maps to advertise on their platform guys to advertise on their platform so every single pin you see here in the la area every single pin is paying an advertisement fee now that advertisement fee can range from 500 all the way up to five to ten thousand dollars depending on how much advertisement this company has now if you multiply that within all these these pins you see here you're gonna you're gonna see that it's a lot of money guys a lot of money so that in turn will continue to grow within the next couple of years as weed becomes legalized in other states okay so in my opinion this company is just getting started but just to give you a little bit of history on the revenue and the revenue growth i'm going to step in this um this chart here which is which is an amazing um chart that shows you and breaks you down everything okay there's um i'm going to read off a little bit of information so you can get a little bit of more information okay cannabis advertisement advertising giant weed maps hopes to boost its revenues over the next three years by a whopping 175 okay and investors are wagering the california based company can deliver on that goal guys i mentioned before in my other video that i have been involved in this sector for quite some time and this company here is the number one company guys don't sleep on this company it's the number one company and you guys will see within the next couple of years that this price that you're seeing right now at 19 will blow up okay i'm just giving you this advice i'm connecting the dots for you i've already been involved here i know this company i know people that work at this company it's a very solid company okay and their ceo is great too let me read this off to you the stock which trades under sspk on the nasdaq climbed another 22 after the company filed a form ss4 with the u.s securities exchange commission that includes the audited financials and more details about the deal and the company operations okay this is important in weed maps investors see a profitable high margin fast growing and tech and software business that happens to be tied to the cannabis sales but one that does not touch the plan why is that important i'll tell you why that's important not touching the plant allows the company to enjoy higher trading volume on the nasdaq be owned by the traditional investment institutions and avoid irs section 280e to pay typical business tax rates you get that guys so what does that mean that means they don't touch the plan therefore big institutions can go ahead and load the boat on these guys and not fear that you know what one day you know if if anything happens in the future with the laws and stuff like that they won't be influenced with that okay that's very important now this is the most eye-catching information for me and i want to pass it on to you okay we're going to go over revenue growth from 2015 which was before cannabis was even legalized as as anybody can use it right recreation or anybody can use it okay back in 2015 their revenue was 43 2016 61 million 2017 90 2018 we got jumped to 101 2019 now we're getting more closer to the recreational 144 guys that's a 43 year overgrowth okay 2020 160 okay and in 2021 they're estimated to go from 160 all the way to 205 but look at these numbers guys 2022 as more states become legalized as more states open up to this and i'll tell you what because of the situation we're in with the coven i'll tell you what more states are gonna be open we just heard new jersey new york they're open for this okay why they want to generate tax they want to generate income okay so they're going to be open to this sector now we see 20 22 300 million estimated and in 2023 we're going to 440 40 million dollars guys this company at this current price you're getting an awesome opportunity to jump in in this sector if you're not involved yet i would suggest and this is not financial advice that this is a wonderful picks and shovels play because why the competition is minimal the sector's competition when we're talking about mj we're talking about competition within a bunch of companies they got a lot of competition okay a lot of growers out there a lot of sellers out there but weed maps comes at you from a different perspective and they're collecting money from all the competition their platform offers advertisement for the producers for the big companies like stizzy okay and people buying it okay so if you look at it you're saying wow you got an opportunity to own this company at this price very reduced right now and it has great uptrend okay that's just my opinion guys with that i wanted to conclude the video i just want to give you an update on this company i think it's an awesome opportunity to buy right now um if you found any of this information informative please like and subscribe also hit the notification bell that way you get all the videos when they just come out okay also if you haven't followed us yet follow us at twitter investing og on twitter okay guys with that guys you have yourself a wonderful day god bless and i'll see you on the next one [Music]", "OsDl_joAx8I": "fine you see I've managed to culture so many very own DNA pros and the results are tremendous they're unstable but very powerful what about my DNA let's just wait see what Betty makes of the results no you're close i watch you Maskull Ellen essentially my father's going after Betty what makes you think you could go behind my back and get Ross to cut me out you pathetic freak but isn't due to our audience you can help I can stick the office something tells me [Music] [Music]", "jYQEQXxMAFc": "[Music] [Music] I will never lose them Oh baby I'm about to let loose unleash [Music] you beat me to submit that you're gonna lose highly improbable have a seat okay Peter but you are the truth I got a temper had on strucker's adventure not a contender hit you at midnight you Bridget November do you surrender when I coppice mode I don't you can maintain you were not killing me I see your jealousy you turn the key like a big chair I'm turn the cleanness of procare's get a couple punches put in phone last don't try to run them a catch the country is only home get it real low let me lose some Amina yeah see me coming you better move barbarian just get it forward [Music] me me anger that's bad car you wouldn't like what I turned into swing your body like a ragdoll you were puny car that were murdered did it ever occur to you if you keep talking you might see this band Rage skyscraper is my vertical no escape when I rampage took you down with a side punch you pen until you see through you need an army to face me be thoroughly beat you so go get you battle troops when you hit me and laugh at you I will simply just tackle you I see this is an absolute quit quit quit I'll let you win you're a better coach and when it goes down put them up again we can anybody get in together with a guy never do you wanna make a little spa the bigger they are the harder they hit and guess what I'm the biggest on the block don't gonna be a monster yes I am your champion won four schools will cost you put them in front of me out damaged um so I hope you got a plan because anybody here gonna tame me when they know my secret [Music] this is doing now [Music] so what is going on everybody this is your boy NIM from nerd out we just want to thank you for listening to this hope song make sure that you Hulk smash that like button and Hulk smash that subscribe button should we do more songs like this for individual characters leave your suggestions in the comment section down below we'll see you guys next Saturday holla back at your boy pigs", "jHXJXDtXdSE": "is there anything that anger is a scientist more than when somebody uses up all the pipette tips and doesn't replace them yes anal rape hi I'm Joanne and I'm a scientist today we're here to talk about sci-fi superhero The Incredible Hulk what happened during that gamma radiation blast that turned mild-mannered Bruce Banner into a giant green rage machine to answer this question we employed the help of a microwave and a corrupt monkey and the results were delicious so we decided to ask a different question instead just how effectively could Bruce Banner really avoid being stressed or angry a recent study found that the combination of deep breathing meditation guided imagery and cognitive behavioral therapy significantly reduce the levels of stress hormone cortisol and participant saliva though not quite to baseline levels I could explain that in simpler terms for some of you but I didn't have time to pick glitter on to my sock puppet bottom line while Bruce Banner could meditate and breathe away some of his stress he'd still have quite a bit of residual anger to get rid of the awkward truth about being the Hulk and so constantly having to repress your anger is that it would turn you into a kind of passive-aggressive ass hole between ignoring the other Avengers and going nothing I'm fine when asked what is wrong Bruce would probably be running around leaving passive aggressive notes giving backhanded compliments and generally being a bit of a jerk so the Incredible Hulk would be the incredible sulk and that's the awkward truce you", "KQCEDUAwvro": "hey you guys is your girl Casey coming at you live with another video if it's your first time tuning in to my channel don't forget to hit that subscribe button so you can stay up to date any time I upload a video if not welcome on back in this video today as you can see by the title I am going to be smoking my very first pre-roll now don't get me wrong these are the pre rolls that I have don't get me wrong I have something pretty well before but I personally have never owned one like I've never hey let me go get a pre-roll let me go cough a pre-roll you got rules no I'm not doing that I've always had trust issues with pre rules but I don't know what's really inside of it and I don't know who ruled it yeah so I got my two free pre-rolls last night at I aim weed pop-up shop if anybody doesn't know or if anybody lives in New York hit me up cuz homegirl got connections they're always underground we'd pop-up events that happen and it's basically a party where you could just go shop for [ __ ] weed you know you get all the exotic things that you've never heard for and never like really get around your neighborhood things of that nature you get to get that you get to get edibles food good music like accessories things of that nature like I got this rolling train oh it's all dirty I had this rolling train from one of the events that I did go to so yeah so I have to here I got this from the entry as you can see it's a little loose they were kind of being whatever and then I got this with the purchase of the bud that I've got from a table so I've already smoked the bud that it's already enrolled in this one and this is a mystery weed so hopefully all those will lighten refocus let's party let's party let's party my god I'm so yellow okay there we go a spark joy oh this is cute they even did a little a perfect em can we get that and focus I can't I can't get it in focus there's a perfect um there's a little piece of weed at the bottom but I like who did this voltar [Music] okay this is smoking good this is tasting good so far is good but um last night I'm at a good time going to the event kind of sad that I should go by myself actually a couple my friends my friends like mean I don't want to go me I'm me I'm like [ __ ] I'm going so I went I got me a couple Apes as I told you or we got me two free pre rolls and I got edibles so I'm going to edible first these are there you like these are the thickest edibles I've seen like and I got three for 25 I ate half of one last night yeah quick story so when I went to go buy the edibles last night at the table the couple that was there was nice enough to let me try their THC infused food so they had rice and like a car you chicken I'm not going to pass up free food so I thank you very much so that [ __ ] was my hit spot I'm gonna just say that it is by tasting wise it didn't taste that great but it sure enough got me smacked I give him that so moving on to the fuzz they don't die I got three different bugs as you can see I got two from the same table present both wicked green and then one from a different table boom so I got sugar cookie purple pie and apple fritters I'm gonna insert a video clip of it Oh sugar cookie was definitely a fan favorite of the ladies last night so that's why the vendor recommended it to me and that's what's in the second panel oh yeah it's really sweet smelling like it smells legit like sugar like candy and then we have purple piper if I definitely cooked my I personally pissed I like her I don't know why it's just so pretty so you got the purple part yeah then we got the apple fritter the apple fritter smells the best the best so sugar cookie was definitely a fan favorite profile looks the best and Apple Twitter smells all of them so also the positive thing that happened to me last night at this event was when I went to get the sugar cookie and purple I was only gonna get one I was only gonna get the purple pie but then the guy told me about shooting you something since you mentioned before I deal at your table was like two for something why they bother he's like I can't do two 460 I'm like okay cool so I got an eighth for $10 less just to get another one with a free I feel like a good deal because rather than spend 80 for two days I got anymore and a free pre-roll whoa sounds have you with that kind of made up for the fact that I went by myself but I did the most novice mood ever I didn't have any problem when I waited I don't know what happened like I swear to fall I had papers in my bag or whatever but I had nothing I didn't have papers I had fun so I didn't have a rep I didn't have nothing so as soon as your girl got there you already know I went scavenger mole I would like so where is the photo they pointed me to a table phantom blow me some paan so I kept it push it I found somebody I was rolling up I'm like I gotta look for somebody smoking not finishing like just starting to smoke or like rolling up at this moment so I was just looking around scavenger room and I found somebody I was like [Music] - oh so I got some papers I like I bet got my phone so got my papers I started to check my pocket no lighter mind you I went to this event right after work so I was so eager to smoke you didn't even know how to smoke I was I was like I've got this I'm on it I'm about to smoke about to have some good weed in my system I ain't never had before oh boo boo nah nothing so I'm so glad I'm part of the stoner community as we're stoners are very nice I asked the couple even though I've kind of felt bad that I was kind of like raining on their blue loving parades this is it we're definitely going back on and I had to ask them for you know a lighter they sure know tells me and homegirl huh huh and then we'll make up [Music] yes I did all in all I could have a good time and I wasn't upset about going by myself after the fact that I walked in the door I was mad walking there I was like oh yeah I'd make a stun pull my friends suck I went on with friends yeah it's like um I always want to blow me off of whatever [ __ ] them well no not [ __ ] them but bump them forget about them they want to have fun let them have fun and let me have my fun too but yeah yeah hope you guys didn't write this whole video about me going to the Vida vent last night and seeing some brand new bud that I got going on and I definitely enjoy this pre-roll because I [Music] have no idea what kind of but it is it was cute it was cute if you like this video thumbs it up if you really liked it comment down below other than that peace and love say hi you guys [Music]", "XHq8UmoKuqw": "I'm Paul Casey your coach and growing forward in your life Bruce Banner The Incredible Hulk used to say don't make me angry you won't like me when I'm angry could the same be said of you first of all anger is just another emotion and it's wired into us by God in order to rally against injustice sometimes this is known as righteous anger it should spring us into action to right those wrongs in a constructive way anger gets destructive when expressed out of selfishness and pride not getting our way or when our goals are blocked hey use your turn signal already when we take out our anger on a person or a thing around us destructively and it makes matters worse for ourselves like with high blood pressure and for others family our team tension and barriers go up something or someone is going to make you angry this week so figure out more positive ways to express that emotion like exercise and healthy conflict resolution and you've got your best chance to grow forward hey you can contact me at Paul Casey work to stay in touch and I want to offer you this month a free 45-minute lower your stress strategy session we can do that by phone or if you're here in the tri-cities we can do it in person because I would like to help you get solutions to whatever is causing you a high stress at this season of your life we'll see you next time", "YyeYeKGCpD8": "[Music] we'll then start by initially going very slowly and turning machine up and as you do this you'll start to hear a little bit of electronic sound initially coming to machine as you can see here we're starting a very low vibration and building up that you can see here the butter medium setting with the machine this tends to be the area in which beetles start loading a lot more material in and working that material this is going to start initially packing down and vibrating that material in there now if you start to have an issue with things floating at the top and not packing down properly there's a nice convenient function of this machine which is at the high function as you start turning it up the vibrational difference and what we're doing here this will initially have your product vibrating on top and sync it down that knowing that it can't over pack your free rolls if you have so much waited product on the top so always staying conscious of how much material you're working with at all times will keep your p rolls from being over packed or under packed and occasion from here if I feel comfortable enough with my three roles in pack I will turn the Machine down and off to this low-end all function for safety purposes you can't turn the Machine off as well afterwards so I'm just gonna be moving this machine up to a very good tampering speed here to where we can actually start introducing the product and three rolls I'm not looking for an aggressive speed by any means just something very light to make a nice movement on there and as you can hear that's kind of the sound we're looking for on this very light as I'm moving my material into this I'm stirring it maintaining a good consistency of product if it separates with the Keith on the bottom there and we started getting a lot of big material on top it can make for a very uneven pack and it will make it a very major struggle for you as far as getting all of your joints evenly packed as you so desire as we're going through this and getting an even pack you can see that not many of these are vibrating and moving which is meaning that they're not sinking into the pre-roll any further than what we have it so this is when we're going to step up the motor a little bit and see if it can sink them in as you can see they're starting to rotate further and further and the center ones are starting to have a much more dense pack we want to make sure every single one of these pre rolls is capable of moving on its own to get the pack we so desire I'm not pushing these in by any means but slowly rushing them over across from each other and as you can see a lot of the seeds and the stems are pushing their way to the top through this vibration to do one last finishing product I am going to give it a high volt and as you can see they sunk at his best it good there from there I feel rather confident in my pack and I'm really curious to see where these pre-roll sets so I'm going to unscrew my locking screws here out of convenience and just keeping your parts and pieces together again I highly recommend just keeping these with the tray if you have a container next to you or anything else like that feel free to put the locking nuts in there however do not worry about the washer so much yet until we get this top tray out the top tray I'm gonna move on over to a reclaim Abul bucket over here in which this product is completely viable and ready to go for another run or any other process that you're wishing to do we can set it down here or a nice easy way to get these out is make sure you grab your washers set it aside and tip it upside down as you can see here all these are kind of full still so you can proceed to give them a tap and go forward some of these may be rather densely packed in there so I highly recommend having a ballpoint pen or even metallic chopsticks is actually a very useful tool we use around here as you can see we're ready to go and the material is packed and ready to go right there for another run or whatever you desire to do with it from here I'm gonna be taking out the base the bottom tray pulling it out making sure I'm not hitting any of the pre rolls we're gonna look at those crunches just to make sure and see how even those are going down on the bottom making sure that all our papers are completely even the same size now different papers are gonna have different specifications as far as their tolerances go and being made manufactured so keeping that in mind when we're working with these can give us a lot of different variables so now that the machine is not going to prevent that from here we press down and as we see here before us all our papers are pushed up and forward and ready to go from here they're gonna need a pack as well as a fold on them depending how you like your product you may need to insert a tiny bit more material in one or take out other material and others but then 10% variable is what we're saying with our machine here and you're next a little free roll", "hDj2iV3IK0Q": "hey guys welcome back to just for fun 290 today we're gonna be opening up the Incredible Hulk rage cage alright let's open this toy up and check it out so here's the Hulk he looks a lot different than the other hulks we've opened up and if you press his lever adapt back here his arms go up and down now let's build a rage cage now he's going to destroy the rage page for me I need your help you need to find the Hulk I need his superhuman strength I built this cage to put him in we must find out his strength now go go get him hope not going anywhere good job Grundy all right put him in the cage ha ha ha no I'm gonna be the strongest man in the world ha angry whoa how do you get bigger hope anger you butthole can change Hulk smash Oh Oh I'm trapped Oh there no you know how Hulk real Brande Brande thanks for watching and if you like this video be sure to give it a thumbs up also don't forget to subscribe we'll see you next time bye you", "_VilD2f4PE0": "Incredible Hulk is a sativa hybrid stream crossed from green crack and the well-known Jack Herer with THC levels of up to 24% it is recommended for the more experienced user this strain is jam-packed full of terpenes in it you'll find levels of mercy carry awfully near Liddell humulin limonene camping and pining users describe the effects of the Hulk strain as being happy uplifted euphoric focused or relaxed medicinal users find this strain helps with stress depression fatigue pain and lack of appetite thanks for joining Mary Jane strains I look forward to seeing you next time thanks for watching", "jxQA4YQz6tY": "[Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music] [Music]", "-6YokAVuR0I": "hi hello everyone my name is donny and tonight i will show you my feet look this is my feet do you know doing do you know my feet can transform whole field okay you are ready look one two three oh my god i failed to transform me to who i failed you", "7dlQLVaGFcI": "[Music] [Music] [Music] [Music] so [Music] [Music] hmm [Music] [Music] so [Music] [Music] hey thanks for watching like and subscribe for more content like this from celebration studios [Music]", "Hnbo7mUfCEI": "[Music] guys welcome to the CCC I'm Shane I'm Dan and we're back for another stray interview today we're checking out some Bruce Banner number three yep one of the many females of Bruce Banner that's super bomb yeah see we're both there's five right yeah this is like I said be note number three is this is definitely the most Oh G heavy end of the three yeah it's cross between OG and strawberry diesel supposed to supposedly is the ghost OG two from from my knowledge at least which is you know really fire og and not one that is easy to come across you know the real thing and then it's Kyle Christman's strawberry diesel which is strawberry crop Strawberry Cough cross was sour DJ and you definitely you definitely get a little bit of both looking at it here definitely taking a look at the nug structure straight oh geez I mean especially when you compare to the strawberry diesel which in my opinion is about is different as you can look as far as nug structure from an OG plant this definitely looks like og it smells like Gucci but there's a little bit like fruitiness in there I get it's not in just regular OG you know kind of yeah like you're saying when you break it apart you kind of do get that fresh fruit smell the lemon pine-sol yeah but with that classic you know dinky fuelly og smell we've always really liked the sour I mean the strawberry diesel because it has that really fruity refreshing not so much like a great be perky fruity not like some of these like lemony Fruities not like the orange e fruity like a lot of other weed it's more it's difficult to put your finger on but it's sweet it still tastes pretty cushy though which I'm not complaining a lot of OG definitely definitely got that citrusy we like your saying we're all suited up today for the playoffs as many of you guys know if you watch football the Broncos and the Niners are still in the playoffs what if they make it to the Super Bowl live it's gonna be crazy a couple of [ __ ] weeks themselves one of us sitting on one end of the couch each one of us sitting on the other hand I mean we're both great we're pretty much die hard fans to the point of ridiculousness people come over and watch us and watch it or games they don't like watching the games with us at all because we get too hyped up live and die with every play and screaming at the [ __ ] camera i won't even do it right now we could just to save you guys at home who are trying to watch this [ __ ] on low while you're [ __ ] people you live with or trying to sleep or whatever but if we were to reenact it we might blow out your speaker's I'll be up there about two feet from the TV yelling screaming oh yeah go Niners and I'm giant like you know um Bay Area born and raised so like you know anytime the Broncos are for the Niners playing anybody other than the Broncos yeah I'm you know for the Niners to win I like to see the Niners day when they're in the Super Bowl last year I wanted to win but I went up against the Broncos you can do it Scott well it's kind of funny how that happened because my dad lived in Denver for about eight years too so I actually do have ties to the Broncos but just nowhere near the Niners I do like the Broncos though they're my second team so it's definitely gonna be interesting that's the hit best of luck to you this week I'm not in the Super Bowl go [ __ ] yourself as well yeah we're gonna be sitting on this couch one person every time of nine years make a plan B [ __ ] yeah good vice versa that will be interesting if it happens we may have to make a video out of that anyways we are back to this man drew and some weed here believe I hit that twice this train is from Colorado I don't think we mentioned that it was huge in Colorado it still is you know but as far as like when the medical market really broke out in Colorado banner has been a staple over there since day one pretty much one of the most popular Bruce banners probably more popular over there than most of the other oh geez combined as far as straight oh Jesus sure sure we tried some chips Bruce Banner - and I loved it super guilty so - made from the Bruce Banner yeah the heavy try and I believe that was Bruce Banner number 3 - yeah definitely you know a nice plant it combines two strains that we've always liked that are so different yeah so I think that's one of the reasons the first time I tried it that I wanted to go for it was just because you know strawberry diesel I like that oh gee love that makes them together see what happens I'd like to try some of the other females like I believe number 5 is like that super heavy strawberry Dino you know number 2 and for supposedly lost at least from what I've researched and heard around the industry except for like a really close circle of growers in Colorado they might still have it nobody knows for sure this is by far the most popular color you're gonna find yeah number 3 it tastes really good out of this joint I'm like you said I'm pretty much only getting the og tones off this day if I if you just handed me this instead it was a joint emoji I believe it there's a tiny bit of fruitiness but definitely OG dominant as it starts to set in its kind of racy but like a mellow racy I feel like it when I first ripped it kind of got me you know a little reason why we smoked of it yesterday kind of got me like yeah it kind of hit you initially like you said a little bit racy you definitely got that forehead punch but it wasn't like a real long lasting the buzz was long lasting but it was kind of more of a mellow relaxed thing for the next hour so after that Dan's trying to know the bomb we finally got water oh that was so harsh oh all right those are always nice that was nice no y-you gotta finish your milk now who would even call that is that milk if it's not wet I'm gonna get some water for my bonnet and we'll be right back so was that enjoyable no I looked over and saw your face like midway through the [ __ ] is going on I didn't realize there's no water in the bone yeah my bad not very pleasant it still honestly tasted all right though it's a pretty good we got one homey that comes over here every once in a while and he likes to hit the bongs but he'll grab a bong that has no water in it and he'll hit it a couple of times like that on purpose before he'd like and then he'll put some water in it and bring it over us so we can try I like those dry foam grips man you better flavor trust it yeah tell us that if they're flavored but I took the yeah I couldn't even like clear the whole thing my lungs are already kind of bad so that didn't smell this weed is not insane when you cracked well we got those nuts just laid out on on the table now but when we cracked that jar initially yesterday it wasn't the strongest smell but I was pleased to see that as you broke it up the smoke a lot stronger yeah I mean obviously I would say it tastes better out of doing it but that might just because I got such a shitty dried longer yeah I don't know it kind of switches back and forth I don't know if there's a strain depending if it's just depends on what day it is or whatever but I like this weed out of joint credit [ __ ] this bull peace oh do you burn your finger on that tube yeah there's like no handle anywhere to grab it this was I went down to the smoke shop the other day ten millimeter bolt piece this is the only one I could get and it came with some like you know shitty China glass pieces the dude was just like I'll just hook you up with one of these you know it's like $10 wool piece or something but we can hit this bond now that we have it kinda yeah but that [ __ ] suck no definitely feeling pretty medicaid from mr. right like it like I said it feels like the same same way hit us yesterday and that's generally good sign when you can smoke a joint in the same thing two days in a row and get high both times yeah I would say I'm starting to mellow out a little bit more now trying to get you a sativa at first but now it's it's more common I might need to smoke a lot of this today because I'm gonna need to be as mellow as possible in this game good luck I'm looking forward to reading if Peyton loses another one to Brady yeah I'm kind of nervous and Seattle is pretty much the hardest place to win so what's sorry for boring all you non sports events today everybody else thank you guys for joining us once again for another stray interview I'm Shane I'm Dan and you're gone [Music]", "HZbwqO6bpaY": "all right today we're going to be reviewing the alien labs one gram pre-roll strain angle 41. let's get into it all right so just to give you guys some information i got this from um pcf it's dispensary around here in the 209 in the valley in california um i got this 14 out the door and i've been seeing a lot of comments on my other videos from my cartridges specifically uh just because i get them for so cheap out the door from the dispensary it's not just me like i'm not cabin you know you could go to the comments this is these dispensaries they're known around my my area like for being really [ __ ] cheap um alien labs the eggs they used to be 52 out the door but they recently bumped it up to 72 out the door so basically just like any other area now um but we do got like marathon g for like 52 out the door we got a corova for 29 out the door um a lot of cure come just the marathon of g just because it's like nipsey's weed rip nipsey man but uh it's not that good bro 52 bucks that's the only reason they made this [ __ ] 52 bucks it wasn't for that all the other care company aids their um 29 out the door and the indoors 25 out the door the light depth which is greenhouse 20 out the door outdoor 15. i'll make a video on on um on the dispensaries i go to so whoever cares about them um you know you guys could watch them anyways i got this 14 out the door okay but anyways i got this 14 out the door um i already tried one it was a scherbassia one that my homie jober got shadow joker we split it between three heads got me pretty lit so i'm kind of curious to see how lit this will get me smoking into the dome and although i think the other one was like 24 or 23 percent csg this one's only 19 tsp 19.38 and 0.04 cbd it was manufactured 51120 and package 60220 um and yeah that's it so one grand p roll uh let me know how much you guys get this for out the door where you guys are from i paid 14 out the door and let's get to it man oh so honestly i was telling my homie i was like um i was like bruh hella dumb the alien labs ace now go for 72. you just get three of these [ __ ] for like what 36 bucks you know fourteen dollars each 40 bucks whatever you know get yourself an eighth right there and three three p rules but uh all right let's open this [ __ ] see what the [ __ ] is about i'm already smoked like i said i already smoked it so i know it's good but um just give us a little little review and also crack the seal crack the seal [ __ ] sings bait that [ __ ] pisses me off bro cause i spend my hard work my hard-earned money on this [ __ ] just a [ __ ] just from [ __ ] i call it fake bro hmm [ __ ] all right mmm you see the weed pop out in labs one grand pro sick comes in raw cone like i said if you guys are if you guys been sticking on my channel you guys know what that noise means good air flow gonna start heating up your rig right now and give you some seconds part of the video if you got a car get ready to hit a [ __ ] blinker get your lungs right let's [ __ ] do this i'll turn my ac off right quick burn that x's paper off sunday i'm about to upload this video right now play some gta i was supposed to go on the hike but um there's some family [ __ ] going on right now so just rather be home you know just in case bro wear your [ __ ] mask she's not a joke two people in my family already got that [ __ ] so i'll stop playing around with that [ __ ] bro way different so i mean not that the shabbat show was bad and it was [ __ ] amazing this is amazing too not that this one's bad either it's just good to know that they got the [ __ ] together they really care you know making sure it tastes different oh you can see that rosin ring already look at that it's gas bro already the taste for a gelato gelato is a safe bet you know you want to get a wheatie never try you want to try a wheat bread you never tried before and if they have a lot to get the gelato it's going to be guys you go same for cards same for wax just get gelato it's always going to get you lit so it's going to taste fire that's a good thing about gelato and um this strain cross is actually uh gelato 41 hence the ariel 41 and some type of og so it's a really good mix because the gelato is there for the flavor the og is there for the high just like girl scout cookies how it's um urban poison and uh what's the other one i know it's og kush but there's like a third straight um but yeah taste [ __ ] one through ten i'll give this [ __ ] like a nine to be honest yeah that's a solid 9 out of 10 for sure for sure um the high i'll get to y'all at the end of the joint see what's see what he's talking about so i'll get to y'all when i'm about like right here about it about us turn it off and um i'll let you guys know let you guys know how i'm feeling man i'll give you my final final results but so far bro guys look at the ash though it's kind of black that could be the paper though because look the the like middle is white it could be fake raw much cones be maybe i don't know fire though i'll be back i'll be back in a bit i'll tell you guys my final thoughts so all right bruh just to give you guys an update my highest forgot my [ __ ] keys in the car [Music] no i'm not going to give it 10 out of 10 i'm gonna give it a nine just because the ash is not white and that matters when you're raising a joint but i'm being picky okay guys shit's fired if i'll give you something a nine that's almost perfect you gotta realize that like a seven is something that's like like you know that's something like you know you just smoke most of the time but once and then you'll find that unicorn and then just get you high different red so um yeah definitely [ __ ] recommend to shave you guys thinking about copying this copy it almost out of pay i'm gonna say that this is better than the [ __ ] uh cookie spiro [ __ ] that [ __ ] was 20 bucks so definitely recommend this over cookies pre-roll everything is about that everything you know about corova i recommend this over corrobor p rule i recommend this over basically a lot of heroes so i would definitely say these are my top three not number one uh pre-roll so far the alien labs period um i would recommend the scherbassio just because it's a whole different taste but if you like gelato definitely get the air before every 41. great taste um it's gonna be it man i'm live as [ __ ] put the ashtray i'll catch you on next video bruh and", "XqKg_R-ZZwo": "my father is going after me I think you think you could go behind my back and get Ross to cut me you pathetic freak [Applause] [Music] [Music]", "eiXactyeggo": "I'm sick of it they always make me angry they show them make me angry because when I get angry Oh angry [Music] [Applause] [Music] [Applause]", "m6eD8kvGuTg": "today we're smoking space coyotes five pack sativa infused joints uh first things i should tell you about this is they rotate the flour that is in these and they rotate the extract or live resin that is in this depending on what they have at the time so you can't you can't bank on it being the same flower every single time you buy it there's a good chance that that the insides will definitely change and rotate depending on what's available but i absolutely love this idea i think it's super freaking cool to just like do a package of five joints and you just brand the box and then slap a different sticker on the back for like what's in it and this is your this is like the five package joints that you buy you don't know what kind of flour you're getting or you just like ask before you buy it um in this case it is gmo root beer and lemon bean resin this was a super [ __ ] good combination of like strains or flour and extra or live resin they balance it so there's a 93 percent herb and 7 percent live resin in each joint and they all weigh half a gram each so there's five total in this package they come in a like this really nice metal tin you can see silhouettes and mountains there's a moon on the front and then on the back there's it says blazed blazed glazed blaze totally cosmic um inside if i can get this open inside so normally there's five joints i've smoked a few of them already but inside you would have all five of your joints carefully packaged my favorite thing about this or this package is i can carry this in my backpack if i go on a hike i can put in my disc golf bag if i go play disc golf i can put it in my pocket if i'm just walking around town and i don't have to worry about my packaging being squished i know that my product or my joints are going to be safe and i can't even recycle this now and put my own hand rolled joints in it and have a perfect tin for carrying those around with me they use field extracts in there as their infusion pretty sure they grow their own flour um but anyways these are our space coyotes sativa or five sativa infused joints be sure to check them out on social media follow respect my region on social media and check out all the rest of our reviews for the west coast we tour on youtube on instagram and on our website respectmyregion.com", "Ge0ORhYJmoc": "what's up guys welcome back to Kush Coast and today we're gonna talk about using your 120 sight cones machine and how the order forum a lot of people get confused on what cones to order and basically they come in different styles you can get cones Raw's these are the raw versions they're brown they're opposed to be organically made or whatever these are the basic white cones this is a company that you can buy it's called J wear and they make cones as well they're pretty cheap but when you buy from J we're compared to buying from the cones company the cones companies gonna ask you what sides you want them in small that it added a large when you're buying half grams you're gonna want the point six otherwise known as the smalls and these ones will do the half grams and then if you're ordering for the one grams you're gonna want the one point three I don't know if you can see that there gives you a size one point three that's for your actual gram if you use the gram ones it's really hard to get a gram in them so they call them one point threes or they're a hundred and nine millimeters the hundred and nine millimeter is the way you need to know if you're ordering from other companies like this J wear because they don't come in sizes point six point that it it comes in reefer King size and party size but the hundred and nine millimeter is the actual size that gets you that one gram but if not the ninety eight millimeter will do half grams pretty good but you get a lot of extra paper just so you know so basically some of the things you guys are gonna need beside your cones in the machine you're gonna need a grinder to grind the product I prefer these coffee grinders like this these suckers right here get the cannabis to the exact consistency you want for it to be able to burn smoothly you can over grind with these real easy and just make piles of Keith but if you just tag it a couple of times which we'll show you in a minute it keeps the product real consist and it helps surface stims which you can pull out later of course cones when you buy the machine it comes with one of these scrubbers and before you reload this every time you need to make sure you clean it otherwise you get Jam ups so this is a real important tool to make sure you don't lose you're gonna want a pair of tweezers in case some of them get stuck down in there and you can tweezer them out if you have problems this is a good emergency tool to go to you're gonna want a couple of different size rods or pins or whatever to be able to poke down inside of the cones and help pack them in case they got air spots in them these work really good we just got a piece of bamboo nap in we've been using them for a long time if you guys want and you guys don't have that much product you guys could cut off little pieces of card like I did here and this card will actually fit on this combs machine let's see it goes like right here well maybe over here there it is so it goes like that and then we got another one with an angle and we put it like that and you can block off holes this way and only fill in so many without losing product through the rest of the holes a couple crappy old business cards work really good for that but they also work good for stirring and making sure that you can fill all the cones so these work really good we got an old film container here and the reason why we have this film container is because you're gonna need a skel if you're doing it for shops to get them the exact weight so this helps hold the cone up and not spill all the stuff out of it as you're weighing them so you could go through and weigh them real fast like that but these are a couple of the essentials that you guys are gonna need besides some product for us we've got some gorilla glue these are some buds that work quite pretty enough to go into the sacks for people there's a bunch of smalls in here but so we're gonna make these into joints so go to waste we also got some green queen and we have a bag of pitbull and even though it's really good smoke it just it got real lar fee it didn't get real dense like we wanted it to so this all get rolled into joints it didn't make it into the bag so a couple of things you guys want to know to start you want to really clean the table really good otherwise it'll go from a one-man job to a two-man job on the bottom of this cones machine right here it have suction pads these suction pads are crucial for you to get through this once you stick this sucker down and the spot you want it at and make sure it sucked down real good to where it's not gonna come off leave it there don't keep picking it up if you keep picking it up you're gonna cover the table and keep and when you cover the table and keep it won't stick no more and if it doesn't stick you'll never be able to pick this spring up on the inside and be able to turn it like this it'll keep picking up with it and then you can't two-hand it and pick it up this spring is real strong in here so you want to make sure that it's tucked down real good so you can actually turn it okay so now I'm gonna go ahead and get out some cones and then I'll show you guys how we load it all right so to load your cones machine I'm going with these point sixes the this order calls for a lot of handout pre-rolls so most of the handout pre-rolls you get in the shop are gonna be 0.6 s or half grams those are the ones they usually hand out the gram size joints we'll do in a minute but basically you grab this stack of cones like this and then you can real easily just walk along and drop them down inside of these holes like this and it makes it really fast to go through it and dump them you're gonna pull out the little paper stints that they give you and you're just gonna go through and load this whole machine down like this until you get done so I'm gonna go through and load this and then I'll show you guys how we do deal with the grind all right real quick just you guys know we filled this in the down position if you can see here it's touching that's the down position and then when you go to lift it up that's the up position it sinks them all down to where they're down inside of there lower than the grade of the actual top so that way when you put the Cannabis on there or your material it'll go down inside there so now I'm gonna show you guys what it we do to grind it and the consistency you're looking for a couple of things that forgot to mention you're gonna want a couple of Tupperware containers we're gonna want one for grinding your product into then you're gonna want one to put the finished cones in and this one we'll use later but for now we're gonna roll with this one so basically we're gonna get our coffee grinder out and start grinding product let me get that set up so I could show you what it looks like so for me I like to go through it and try to remove as much stem as possible and get rid of all your chunks of stem those will end up plaguing you later when you go to try to tighten joint down and twist the tops those little pieces of stem will start poking through it so I'm gonna just keep breaking this up like this getting it inside of this grinder trying to pull all the big chunks that I can find anything hard real pokey you want it gone but make sure you got gloves on so you're not you know making everybody's smoke all dirty dead skinned and you don't get your hands super sticky or black this products real sticky and it'll ruin your hands real fast it'll make it tore you can't touch the papers without ruining them so you want to make sure that you get your hands covered with some kind of gloves for this process it's just better all the way around and sanitary for the product as well you don't need to fill this very full of course you don't want to be sitting here all day long doing tiny bits at a time but I mean you want to make sure that it's got a good chunk in it just not super packed to where gonna make it hard and you have to fight the lid on it so once I get it about like that I'm gonna throw my cap on and this only takes like a couple of seconds you'll listen and I'll let you hear it there's one and then I'll do one with a shake then I'm gonna open it up and you can already see that it's pretty ground down pretty fine so a consistency like this is really nice but you have to still be sure that there ain't no bigger chunks like this these little chunks like this will get stuck in there and mess you up real bad so you're just gonna go through it and break them up make sure and I move the product from one side of this box to the other just to make sure there ain't no big chunks that did get broke up like that one or any big stem that you see you're gonna want to make sure it's broke up as well any big stems but that's basically the grind right there then I take this and I slide it down and then I go on to the next one you can see all the kief in it there's a lot of Keef in that if you go too long all you will make is piles of Keef there won't you won't have any mass to it so when you go to smoke the joy what happens is this one and either gets so compacted that it doesn't want a bird or two it'll start running oil all the way down your face when you smoke on it it gets so tight that the oil just starts pouring out the end of the cone and you don't want that so I'm gonna go through this bag right here and knock out as much as I can and I'll show you guys what it looks like when I get it all browned up okay here you can see our consistency it's fine grain powder like tobacco we removed all the stems like we talked about you need about 65 to 70 grams to do 120 1/2 grammars you always want to go about 5-6 grams over so they're not light but plus you're gonna lose some even with your scale on the point system which we'll show you later so I got my consistency ground up set that off to the side say this is the area I'm working in I already threw my pile of stems away you're gonna want to take a moist paper towel and wipe this down real good and make sure it's clean you're also going to want to touch the bottom of your suction cups and make sure they're clean and moist and there's nothing stuck to them then you're gonna set it down and you're gonna make sure it's planted on the table solid so that way when you go to pick it up later and turn it it doesn't come up off of the table but now that we know it's on there and it's already in the up position not the down position where the white papers showing but up position am i picking it up and locking it into place it keeps the papers from getting destroyed now taking the old card I like to use these business cards and I like to sprinkle it on here and try to go pretty evenly and you're not gonna fill them all right the second you're just gonna spread some out across the tops and make sure some little pieces fall down in there so that way when we do the first beating you can make sure that you get it all the way down to the cones filter at the bottom the little crutch so I'm just gonna get some down inside of these like this and once I'm confident that I spilt a little bit in each one and that each one's got a little tiny bit in it I'm gonna go ahead and go through like this and if you do it light-handed don't go Bam Bam Bam just like it actually gives you a better pack than if you're slamming on it real hard then I'm gonna go through and I'm gonna add some more and this time I'm gonna get a little fuller and a little fuller until they're all filled up you're just gonna keep repeating this process and if you do it if you take the time to do it right the first time you won't have to bunch you have to fix nobody likes having to go through and fix a whole bunch of these combs it sucks so to keep the process fast it just do it right the first time and you won't have no problem so I had it a little bit and add some more product and I'm gonna do this until I know that all the paper are covered that each one of them have some to the top of that white paper in there I don't know if you can see that with the camera but you got to make sure that it gets all the way up to there it looks like I need to grind some more let me have a second and I'll be right back guys so I got more ground we're gonna get them all filled up a little fast make sure we get all of our holes filled and you can look down in them and see which ones didn't get it which ones did and of course I didn't weigh this product which I probably should have then I would have known I had enough but I don't got time I got orders to fill so I'm just flying through it as fast as I can we still have thwack sirs to do which I'll make a video on that that's where we take whacks and then keep rolling which I'm sure everybody's already knows how to do but we get so many questions why not make a video about it right and of course we don't get paid for by combs or anybody else for any of these videos we post you guys know nowadays YouTube confiscates all the money and it doesn't allow anybody to do any type of merchant handling or any type of third party marketing or anything like that for anything with cannabis on it they uh ixnay your videos monetization so we don't get paid for this we just do this out of you know share and share alike and this culture was based on that so all these secret keepers nowadays you can keep your secrets and Joe money alright that's looking pretty good we got just about all of them full some of them are a little short but they'll make up for it later as we're pulling weight out of them cuz they're always gonna be over so you're gonna be taking quite a bit out as you go [Music] alright now when you go to the turn it it's stuck to the table really good and they're gonna all stand up for you just like that right there now you're gonna go and pick through them and you're gonna throw them on a scale to see what they weigh and that's why we have this little cup here and we set that on the scale before we turn our scale on to tear it I also like to keep another cup on the graphic pass this one over here because as I pull them these way approximately for the half gram joints about 0.2 so at point two you need to make sure that this says point 7 or 0.8 and in California and Oregon to be able to say that you're selling it to a shop and it's medicine you need to make them weigh exactly so that way they're not getting a messed up dosage scale so point 7 is what they really want them to be at so you're just gonna take over here and make yourself a little pile because as you can see when we shook this thing it kicked out all kinds of product around it so as soon as we're done we're gonna clean it all to the front of us get it back into our bag or our Tupperware and clean the table again and start over again but this one still says point eight so I got to get it down now it jumped two points there it is right there that's close enough okay so you're gonna take your poker you got two different pokers you're gonna take your poker and just to get you a nice flat top to be able to grab it with three fingers and you're gonna do a shake like this and that shake is gonna tighten it up you can hold it up to the light and look through it and you can see that the product made it all the way down to the bottom and there's no big air gap here and if there is an air gap you just keep shaking it until it comes out when you crease it with your three fingers it's gonna make a little try thing like that kind of like a triangle right once you got it like that you're gonna give it a gentle twist like this and then you're gonna shake it again to help tighten that twist into place and when you're done it should look just like that right there to keep your scale from being on for long periods of time though the trick is to go through pull them out one at a time weigh them make sure that they get their weight right and set them right here in this jar fill up a jar like this first and then go through and tighten them all up after you're done it'll make it a lot faster for you in the long run and you could have multiple jars and go through the whole thing real fast but unless you have somebody else here helping you and you're doing this by yourself this is the best way to do it right here all right guys I'm gonna go on to finish it in this out I'll show you guys how many we get and what they look like when we're all done all right made it through all 120 it took me about 28 minutes 29 minutes or so and just from going from here skelling I'm dumping the excess inside of the cup dropping them in here boom boom boom until I had my cup full shut my scale off take them twist all the tops throw them inside of my Tupperware that's what a hundred and twenty look like it would normally go straight from here twist them put them in a two sticker label um and then put them in off to the side but this company doesn't need them to so there is going in Tupperware and they're gonna be delivered like that and the tough work so they stay dry and they don't dry out any further before you guys even get to this process though you guys should practically roll one see how it smokes and make sure that it burns properly before you get to this stage where you're making hundreds of them if you get some cannabis that people grow or if you didn't grow it yourself and you're purchasing it they didn't flush it properly the joints won't burn right and you don't want to make hundreds of them and hand them out and get a lot of complaints about the way they burn I mean the number one reason for them not burning right is because of the way people dry and cure it but if they don't flush properly that's another reason why to moist a weed won't grind white right or it won't burn right so you want to make sure that it's at the right dried consistency to be able to grind up nicely not so dry that it's you know turn straight to dust but about four to six percent is the average moisture level that you're going to be looking for my next stage will be after this is to clean this to repeat the process and I'll show you guys how I do that alright so real quick for you guys to clean this the simple way is to make sure everything's down in the holes first using a card to scrape all any big chunks that's leftover then you take your brush and you go through and you brush off the top make sure everything goes down on the inside like this here make sure it's good and clean then you're gonna make sure that it's in the upright position not in the bottom closed position that way this can go all the way through and clean really good I like to choose a section this is in section so find a section start at a section and roll with it and just fly through it like this right here and this is pushing everything down to the bottom and this will make sure that when you put the next set of cones and they don't stick to the walls that could be a real big problem if you get them all caked in there you can't get them out you end up breaking a bunch of papers this is the best way to do it just like this right here all right so we got it all cleaned out I don't know if you could pan the camera down here and see inside here all that that's in there so we got our tough water dish over here I'm gonna just dump my extras in there I'm gonna take this bad boy lean it over on its side like this so I could see down it I don't know if you guys can see in there and then I'll take my brush and I'm gonna go through and I'm gonna scrub this bottom plate off with the brush and get it really good and clean and try to get all that stuff out of there and onto the table it's weird holding it like this for your guys's angle but uh you got to make sure you get the thing super clean you don't want this thing getting gummed up it'll gum up real fast on you if you have to you have to clean it with alcohol or something that's fine clean it with alcohol but then make sure you let it dry out for a long time before you use it again because the key itself will stick to everything like glue if it sits there the longer it sits there it'll stick so hard it'll be real hard to get off so the trick is is to go through this as fast as you can and try to get you know all of the product back off of the off of this 120 sight combs machine so it's not stuck to it like glue then you could give it a couple of days it's clean set it off to the side out of the way try not to get the two or the three little suction cups dirty you got your tongue over here and you look at this right here see how it automatically keeps up and starts to clump up that's because it's got a lot of oils in it get your card out scrape it all right back into your tough wire and you're gonna repeat the process again and again and again so you're done with your tada but you want to make sure that you clean this table off really good I got me a paper towel right here and I'm gonna get it wet and I'll use that to read moisten the table again and make sure that it's tucked down real good because any of these little particles right here they're gonna mess up your guys's suction with the suction cup so grab a paper towel and then go through and just give it a good wipe picking up all those little green particles flip this bad boy over make sure my suction cups are clean stick it to the table make sure it's stuck now you can turn it BAM back in business time to reload and go again and basically that's all there is to how you do this 120 sight cones machine it's real simple it's made out of real hard plastic and if you can afford it I know they're expensive but if you guys can afford it this is the way to go for mass producing joints the cones works good they got crutches in them so you don't get cannabis or tobacco or whatever you're using in your mouth and these are the subway we prefer to do it if we're gonna be doing them by the you know buttload but thanks for watching be sure to LIKE and subscribe and we'll catch you guys on the flip side stay lifted and stay safe peace", "1znio80GQUY": "well I really got to get that under control welcome to another Sunday blog this is d22 with you today anger we all have it it's a natural emotion but what are some things that you get angry at me I normally get angry about things that happen in the world like abuse sexual abuse just abuse in any way shape or form I hate abuse abuse makes me angry yes that kind of angry anger is an emotion that can be expressed in viable means viable meaning positively it's like for example you can do your anger through your videos you can express your anger through art or express your anger through something you love or something that you just enjoy entirely anger can be a great emotion if you don't beat up people your question for the day is what was one thing or one topic that made you so angry that you did something you regret it or how did you use your anger today leave your comments below and here is a sudden a blog shoutout for today sorry I shouted again it is a shout out after all nobody gave me a Sunday blog topic for the last Sunday vlog so I suggest you leave us topic below give the video a thumbs up share it with your friends if you liked it get filled for life goatee my way and we'll see you next time I really got to work out my anger problems", "DIF1I-770II": "oh [ __ ] me Oh [Music] Charles the young Felipe yo what is up my youtube gang you feel me hope everybody out there is having a good ass day I'm having a good day hope you guys are staying positive but on this one we're just gonna smoke we feel me we feel me you feel me we're just gonna smoke you feel me and we're gonna get off some of this high voltage you dig reading awesome it's high-voltage pre-roll if you guys haven't seen it BAM it's blue raspberry just covered in blue key and we're just gonna sit here chill and smoke you feel me mmm what I really want to do is I'm gonna cut the tip of this off and I'm gonna smoke in my bong you feel me cuz I really want to get a bomb grip to start this thing off so let's just mmm see if you guys can see that I'm gonna cut like that much right there just like that and we're gonna smoke this in a bomb see that right here cut the tip of it off I really want to get the flavor in my bong so unravel this tip just a little bit smash this [ __ ] in here like this and voila we're gonna smoke this [ __ ] so they came out BAM put that on top some of this high-voltage pre roll out the ball you feel me what use the blue cheers guys hope you guys are having a good day I hope you're smoking along I hope you guys are staying lifted you feel me just get this bond grip cheers guys down there taste really get out the bomb [Music] damn guys that was really good that takes a super bomb went straight to the lungs that is the [ __ ] right there this might be a longer video we're just gonna sit down and chill and smoke there's just sparked a [ __ ] up and get right to it go ahead guys take a hit we got that blue keep joint from high voltage smell me [Music] hey fella good knows how the good smokes hella good you guys ever get a chance to get one of these high-voltage pre-roll joint things I'll suggest you go cop one now it was fifty bucks for this joy only if he goes worth fifteen dollars but it is pretty cool to see a blue joint blues my favorite color this looks good it definitely hits good flavor that bong rip was held it good to [Music] taste pretty good guys so back to the things man let me tell you what happened the other [ __ ] day while we're smoking this joint down so the other day I was chilly here right my bed right here if you guys can't see it I'd be sitting my bed still go a bit [ __ ] so I was chilling on my bed I went to the kitchen I went to go get some [ __ ] like somebody drink or something eat I was checking on something so anyways I had got up off my bed to go to the kitchen so I went to the kitchen came back had my lady in the couch on my bed and I went to take my slipper off so I have put like raised up my right foot and then I tried to kick my slipper off and as I kicked down bra it was all bad as I kicked down my foot caught my email cord bra oh and as you can imagine the worst happen the [ __ ] email came tumbling down the [ __ ] drop down came off the [ __ ] red was on the ground water spilled the after bath of that [ __ ] Oh bad that bucket after bath of that [ __ ] oh the custom girl rig into pieces guys it's in pieces it's in [ __ ] pieces and you know what didn't [ __ ] break this wasn't the downstem that wasn't biscuit that was the drop down that was on it this was the drop down that was on it and it didn't [ __ ] break so this [ __ ] [ __ ] was damn near set up like this in like this right oh [ __ ] me oh it cut me [Music] look that [ __ ] really cut me anyways so this [ __ ] was dammed out here like this like this and [ __ ] he came crashing down off the table boom boom bap this [ __ ] broke this didn't break I wish it did this was only ten dollars this rig came in a daily high club box that was like $35 so in any rate I [ __ ] broke a rig again check this out this this right here is my first ever piece of glass I bought it was if you could see [ __ ] if you can see that [ __ ] just diamond glass this was the first rig I bought I bought this [ __ ] off 420 in San Francisco on Haight Street just because by huh be cool ja needed add a brick to take a dab out of so I was like [ __ ] I mean let me cops up so we can take some dabs she was taking dabs on 420 with my homie cool John that was reason why I bought this piece but then it ended up breaking I didn't break this piece but it ended up breaking and it's just what happens when you have glass man [ __ ] breaks so yeah I'm a little salty that this shit's broken because it was like my best setup that I have for an email and my mom gave me just peace so it was like you know didn't cost me nothing but [ __ ] it lost me everything do you feel me because this it was tight so that's his god broke-ass it sucks this is still going it's burning just fine it's burning like pretty slow for being just one person token on it it's hella nice is burning evenly now that I finally got it going it's [ __ ] blue brah that's just my favorite I wish this was blue but my older brother got it for me his favorite color is red so that's the only reason why we're cuz my brother got it for me for Christmas so shoutouts to my brother you guys think about this area should get along whoo so yeah guys that's what I've been up to just working on the [ __ ] grind making sure my finger don't bleed out just been working you feel me putting these videos out let me know if you guys like this style here or if you like it over there where I sit on a couch I'm on the other side of the couch and this is like where I sleep so [ __ ] if you leave a comment down below if you like it this style view like looking like this to the side having to cuz I get a better lighting from here when I'm over here on this side I use a [ __ ] lamp light and this burnt out so yeah if you like that should I have to go get another lamp light to be able or a different type of light I'll invest into a better light if you guys like it on a couch better on that couch side of you or if you like it on my bed couch with the window open leave a comment down below what you guys like to see better yeah it's going pretty nice so yeah man all right Pete to the custom grow 420 really that was like to clean this piece to use on my email this because it had the least air restriction it was like a juggler you dumb you just like you can you can just take a toke on that as hard as you wanted to in you filming you was getting your whole dab unlike this piece right here because of all the [ __ ] little [ __ ] and [ __ ] in here all these little [ __ ] you kind of have to hit it harder to get more airflow this one you just and it would just come at you didn't even have to that had no restriction at all [Music] sidecar [ __ ] super slid the fuses I [ __ ] was bomb but r.i.p we got anymore come on you mentally smoke too much flour on this channel but we'll try and come out with some more content with flour I do like some open oil it's my shake that's pretty nice the ash is pretty white guys my review on this since I've been smoking it this [ __ ] got me [ __ ] loaded so it's a pass you feel me it's easy on the throat it's easy on the lungs you get fat clouds out of it and this one in particular is actually rolled way better cuz I actually if you will go watch my [ __ ] what video maybe it's not even in a video yet [ __ ] well I [ __ ] had two of these right so I had this one and I had this one which was the red one and the red would damn near was trash you feel me I didn't really like the red one now I'm not hating on it because it was [ __ ] red but like when you [ __ ] took a toke on it like for some reason it would just like it would hit like you could get a cloud off it and I smoked it to the face and I don't feel like I got loaded off it it tasted cool was black cherry but I don't really like that one but this blue one is [ __ ] bomb cuz like my eyes are already low as [ __ ] is this I'm just higher can't even it's hard to explain it it's way better and I was damn you're gonna smoke another one with you guys for the [ __ ] of it yes this one the sour tangi because i got two of these too and I still have both of them that I need to throw up and it's from the same company so they got these where's that [Music] damn cuz I was gonna put a fella forgot because I was gonna put this [ __ ] out and light one of these [ __ ] right here because one of these is tangi sour tangi sour tangi and this one is [ __ ] juice this is a good old uh and this is a indica and this one is a hybrid you feel me I forgot I was only gonna smoke half of this and then smoke one of these down but [ __ ] damn this [ __ ] just went out so this one just went out I'm actually gonna [ __ ] spark one of these [ __ ] it I'm Lexie I'm gonna just our tangi I think so lucky sour tangi this one here okay so this one just to recap really quick high voltage it was a pre-roll raw cone had top-shelf blood in it I don't even think I said this Kylie's finest og mix for life president it doesn't even say [ __ ] on here covered with OG key and it has live resin inside and I'm assuming it has you know top gel blood in it because that [ __ ] was pretty fired this one here is a premium cannabis rolled with the foot Premium Canada strolled in nature and natural leaf nature I'm cuttin hi this right here nature's combs premium cannabis rolled in natural leaf nature's calm calm distributed by Kings coast tan GOG hybrid tested 1.2 grams tested by SC labs 31.3 40 Hz so yeah there's that I'll show you guys this get it glare off it comes with this [ __ ] on the top I'm assuming that's just so just so just so just so yeah so the none of that [ __ ] did falls out I'm actually gonna keep that on there yeah yeah yeah I got that [ __ ] back on their breath okay so I'm gonna leave it on here just because I don't want this [ __ ] falling out so this was genius and idea number one [ __ ] smartest [ __ ] so this [ __ ] don't fall out it has a [ __ ] filter in there that's pretty [ __ ] dick it's got this cool little band on it to hold everything in it's a palm leaf is what they told me if I'm not mistaken you take a [ __ ] swag ha yeah so this is a palm leaf I'm not mistaken so let's [ __ ] party be spark it mother sparker yay Cheers [Music] [Music] the flavor on this is kind of hard to describe I don't know you've got a [ __ ] try this you I'll know it makes you feel like you're smoking something luxurious and I get to one of the finer things in life I don't know it feels like Titan it is smoking awfully fast then taste on it though to taste that you really came to I've not tasted this flavor with the joint or a blunt on the ball or pipe [Music] super hard to explain the flavor dish it's hella good too I just feel like I should be doing something hella cool friends rather fast but it is what it is this is awesome $15 log with all the other woods this filter is pretty cool [Music] see if I get a good one what I used to do back in the day is that blow out of oh I blow out of oh and I'd come in and pull like a good bor-ring whatever that's just called how don't forget it I can't let me try that again it was like perfect but I can't go too far down getting hella high see as I got closer to it that [ __ ] was blow it away this should taste hella good is getting [ __ ] I don't think goes on camera but I don't think it was in frame I should say you know loaded I might have to [ __ ] take it in that back for this [ __ ] it was it a strong enough Oh [Music] this [ __ ] is damn near to the Andrew filming so yeah this one wraps it up here man thank you guys for tuning in taking some time out of your day to watch this video much appreciated these high voltage pre-roll in this nature's code I'll give you some of the focus of thumbs up on this review they [ __ ] burn right dafuq smoke good got me hella high these [ __ ] are the [ __ ] shout out to them if guys ever CDs at your local dispensary or trade show event I would suggest you go check them out go try one if they [ __ ] are letting you to hit what something let's just fire I'm loaded if you guys like this [ __ ] man I appreciate you guys tuning in if you liked a man of course leave it a thumbs up if you're new to the channel man subscribe you feel me actually be awesome until next time man you guys are tight Gang Gang yeah you", "54yl_f3Gq_4": "[Music] hey guys what's going on welcome back to another strain review this time we're gonna be reviewing bruce [Music] banner [Music] this is a saltiva dominant hybrid with 60 sativa and 40 percent indica and some of these strains have actually tested up to 30 percent gac uh this particular batch is actually 27 percent you see according to the label and uh you supposedly pack a punch this is really good for like all like headaches migraines you know chronic pain illness related stuff it's also good for depression nausea anxiety this theory is actually not recommended for people there are about an either are new to the smoking world in fact if you are curious about smoking cannabis this is not the strain you want to start with because of this hype called tac content we could actually cause paranoia and anxiety instead of doing something good it's just gonna you're gonna have a bad trip and you're just gonna be like nope canvas is not for me darko's generics are bred this strain oh it's real good this is a a cross between og crush og kush and um strawberry diesel i think it is and you can actually tell because if you if i when you start when you first break it and you smell you you smell like that sweet diesel overtone and i oh i can't wait to start smoking this one though because like 20 and 27 percent gac it looks nice the woods look nice well cured orange hairs everywhere that's the one second one in a break right now i don't see a lot of trichome crystals like all those strains that we reviewed before you can say like there's not much in it actually let me show you so there's not that much to see with with the nuts themselves or like they don't have that real appetizing look the other cannabis has i mean it's not something that i chose off the counter because the way it looked it was more because of the tac content in it so there is not much to see in it so i mean it has this green and it's orange you know but it doesn't have as many trichomes as other strains that we revealed before brew banner actually this this string right here comes in three different um by areas of string which is a one three and five three being the most powerful one i think we're gonna keep this much out so we can pack the ball with it like always now let's make another one fun fact they were actually well it actually started with uh five strains of of this particular strain they had a buddhist one of one through five the then the dark holes genetic they they just drop uh i think it was three and no two and four and then they kept one three and five three being the the the most strong ones of all two of them and the more sought after so like a lot of people will be trying to get to three because they hide the content on thc oh yeah in fact this train you know the bruce banner number three ranked number one in the cannabis cup in denver and the most potent tested there too let's get grinding i got my ball somewhere oh i think my bow is still drying from the last time from the last review i always watch it after every review so every time i smoke a bow over reveal strain i get to say the actual flavor of the string i mean you you can't really taste bud or any strain or anything on a dirty bow that it just stays like resins every time you smoke nice oh wow really good taste tastes like almost like candy for like like uh like a earthy candy i know there's no candy tastes like earth but the flavor is is sweet like candy but it has like yeah it has like this little bit of a earthy aftertaste like an older sort of birthing it's not bad it's not bad it actually tastes good it's smooth it's smooth even has a really good smell coming out like i wouldn't mind making an air freshener with that smell it smells really good it smells really good there goes that body relaxation that i like and you expect from a hybrid it's relaxed enough to do what you got to do but you don't feel heavy or sleepy i feel actually quite focused like i wanna now i'm feeling like i wanna draw something like i wanna create something i like that my hand feels actually relaxed my back was a little stiff earlier i was moving my setup around it's quite a heavy table it's a handmade table so it's quite heavy i went around almost a little stiff and said what a better way to i mean one minute moment to start doing a review then i'm gonna feeling like you know stiff i can smoke some and see how and let me tell you it's helping with my back i don't feel as stiff anymore i feel actually relaxed i feel focused i want to create something right now so it's just that i'm feeling creative right now and he already started to hit me that was my second hit how long has been oh i didn't timed it it had to be minutes it had to be minutes i forgot to look at the clock when i took the first hit [Music] okay the third hitting went down so smooth as the other one actually made me cough but it's still good and now i'm feeling it a lot more that 27 percent tc is kicking in i'm starting to feel pretty high i hope this is not like that purple punch man that purple punch actually it packs a punch but it hits you at first and then i don't know a couple of minutes later not even 20 minutes later it goes away i don't like that on this canvas this one it hit really hard i'm really really relaxed i feel focused back pain gun or stiffness it wasn't hurting it was just stiff it was bothering me that's completely gone you only took three hits in a couple of minutes so so far so good i'm liking what i'm feeling let's see how is it gonna be in 20 minutes from now this is definitely a daytime strain like i already finished two bowls of this oh i'm so blasted i'm just gonna see how long it's gonna last and one side effects one thing i already started to feel is like it hasn't even been done long and my mouth is really really dry like really dry and i don't like that let's see what happens in 20 minutes so i'm back like after 23 minutes maybe a little bit more because well whatever whatever i think it's 23 minutes because naruto i just watched a whole episode naruto and um and i'm back and i gotta say though my eyes like they're really red right now really redder than usual like it looks like somebody squared something on my eyes they're not selling i'm talking about that my eyeballs and stuff they're really red such a i kept on drinking water a lot of water this drink that means i don't know if it's dehydrated or what but my mouth would not stop being dry so i had to keep drinking water through the whole episode that's a little better but i'm still feeling high i'm not i'm not like like stoned like i was after the finish smoking the boat but i am high i am not i am feeling real good still so he's lasting over 20 minutes i'm still feeling good so that that'd be purple punch that beats purple fun i like it so if i have to resume it the books didn't look that good i don't know if it's because like that's how the strain looks little buds everywhere don't have any big nugs or anything i don't know that's how i got it so the nugs didn't look that good the smell it looks it smells good it has that little strawberry diesel and i do undertone up you know what i mean and then it smokes really good it's really smooth out of the bowl it keeps its flavor after a couple of talks so like when i was burning it i like to see how many talks he takes before he loses his flavor started tasting like cannabis like burnt cannabis and this one took about three bowls i mean three hits before start tasting differently than their first hit so that's pretty good kept this flavor coming in uh coming out it had is weird though because coming in when when i inhaled it it tasted really good it tasted like that like diesel but it's like sweet actually just a little sweet coming in but when i blow it out that's what i used to get that aftertaste of like a little earthy taste to it like an undertone or the sweet but it's still good though the height has been over 20 minutes now and i'm still feeling the high so that's pretty good it didn't give me glossy or anything like that i'm able to do whatever i did i was focusing on on naruto i didn't fall asleep during it i wasn't feeling tired still don't feel tired i still feel focused so if i wanted to do some drawing right now then this whole time when i'm watching naruto i'm thinking about how can i draw that or how did they draw it or the process behind the drawing so i was like my brain would have stopped being trying to be creative even though i tried to laugh at about naruto and to his sexy jutsu i mean i was just thinking how did they did that how many frames are they animating every two frames or every frame you know i mean like and then i i could so i don't know how to call it i couldn't really like focus on it as in like the storyline goes it was more like i just couldn't stop thinking about how drawing it yeah i don't know but i still enjoyed it to the root so i still enjoyed it and i'm still fitting this so yeah if i had to give this uh a rating it would be i'll say seventy seven point five seven point five nine nine nine nine and let's give it eight actually come to think of it let's give it eight because like the only reason i mean the button look good appearance wise it sucks you know appearance why this sucks maybe it's just the match that i got but everything else is pretty [ __ ] good so yeah eight we give it eight leaves i'll probably get another half ounce of that hopefully they got better buds i don't know okay all right guys well that's all i got for this review thank you so much for watching guys i'll see you guys in the next episode don't forget twitch twitch.tv slash lyric city let's get high and play some games yeah i'll see you guys there and if you like the video don't forget to hit the like button and if you really like it hit that sub button for more videos coming up and i'll see you guys in the next episode peace [Music] you", "ObFtB_eFUcc": "[Music] hey what's up guys what's going on welcome back welcome back to Tom's awesome cannabis Channel this hoe we're gonna be doing something most different today right we're gonna be doing one he's big boy dog walkers man big boy dog walkers right let me tell you something buddy big boys dog walkers if I can find let's go big dog walkers big dog the name of this one is black Afghanistan Lennie is landrace Afghani from con Dora I believe I said I can I'm saying that right a hashey notes of wood and fruit and rich with a touch of coffee and vanilla the effects are soothing narcotic working to relax the body and mind all right we're gonna read these numbers right off the bat THC just 26.8 THC or I'm sorry THC a twenty six point eight THC 1.1 C BT a zero point four CBG 0.1 terpenes just show you guys because there's a lot of terpenes in it yeah I had to run a test done it's Monday and two days before my operation I getting getting a little nervous so if I'm actin a little a little different I'm not gonna lie every time I get put to sleep I mean there's a chance you don't wake up so like I get a little I get a little iffy about okay so um okay with that said the ins is kicking up a little bit so that's why I wanted to sit down and try to try to smoke this whole thing it's at 0.75 grams and on the scale at 0.03 houses okay I mean it's pretty cool last time I had this this the second time I had this on the channel the first time I had these on a channel I said that everyone you buy it donates to a dog in need which that is pretty [ __ ] cold so yeah this was like $15 I believe yeah not bad at all like I said Afghani man so let's just go ahead and crack in this and you can get her started all right this is a hard percent indica to by the way just bad boy all right I kind of I kind of thought it'd be bigger but it's really really really tight I'm not even gonna try to like take it apart or anything like that I'm just gonna get get to smoke into a society a little bit I'm having [Music] Cheers let me doing the comments what you guys are smoking on if you're smoking on anything yeah and let me know if you guys are having a good week so far you said it's Monday two days before my operation I did my ronan test today to cobia test they do it real quick on both nostrils man and tell you it's like you're sinking feel it like to go behind your eye sockets and it makes your eyes water up immediately is it it does it's not like it hurt it's more more just like a weird kind of burning sensation I guess behind your eyes and you can feel it in your nose like like maybe 10 to 15 minutes afterwards too you can still kind of feel a little bit but yeah let's talk about this my first initial hit it kind of burnt a little bit to be honest with you guys I'm not really much used to smoking much fire anymore man I've been smoking a little a lot of [ __ ] oils a lot of rosin you know a lot of rosin a lot of concentrates the taste is definitely a woody maybe a little fruity I don't taste no coughing but now maybe low for now but I don't taste no coffee flavor definitely little fruity it's a nice subtle taste smooth taste too like I said it has a little a little burn on my throat there and I think that's just from [ __ ] smoking fire you guys in Pennsylvania I can't buy these pre-rolls I guess and I feel sorry for you is it [ __ ] sucks but uh you know hearing good old Maryland and you're allowed to and you can smoke your flower and it's pretty [ __ ] dope I'm not gonna lie I could have bagged a [ __ ] paper flower consoling I'm getting a better taste on it now depth that one was definitely fruity like I said it's it's a hundred percent indica so definitely want to be at nighttime when you're smoking this one and it's definitely good for [ __ ] uh like like pain and and effects effects for like the body and muscle aches and stuff like if you just had a hard day at work and you just want to come home and relax and sit here and just like be couch locked a half-black Afghanistan like Afghanistan one of the strange you want for you it definitely eases the mind it definitely relaxes the body relaxes the muscles like I said it's like a soothing narcotic and it definitely is I mean I've only took him for four or five hits of it so far and I'm definitely feeling it right and I'm telling you what the taste it's getting even better I guarantee when I wake up in the morning I'm still going to smell my room is still gonna smell like just [ __ ] joint head normally does been a try some of these joints any kind of joint really good see how nice and white to ashes - yeah yeah this [ __ ] burn him beautiful yeah nice wish I could do like slow-mo if we are yeah that what only $1 works hopefully see we get that fix here but I already got a couple recordings ready for y'all so like I said I'm not just gonna leave gone hanging man like I said the first time around it won't be no videos I'm not gonna go hang a man I got a couple videos a very pretty record for the [ __ ] time when I'm laid to [ __ ] out yeah so be definitely be on the lookout for them [ __ ] man I will give you all those deep video right this disc cartridge right here I open it up yesterday and at first they gave me kind of like a little hot flash whenever I did the review but I turn my ACS I think it was a big part of that puss breaking a bacon with the liquid live resin cartridge it definitely threw me in like a hot flash but afterwards once I cool down man the bus is really really [ __ ] nice and I'll tell you from a G leaf liquid live resin cartridge FS e cartridge whatever I think I forget it [ __ ] means um yeah it was pretty good so be on the lookout for that review blueberry scone just like the porn snap blueberry skunk fire bro blueberries Conchas fire I mean literally look I killed it I killed it it was that it was that good I mean I just the oil burnt really fast and I'm not gonna lie like I mean like on a normal Cresco card the oil would last me three four days the way I was smoking it this one here that was done within a day yeah like clearly at 24 32 hours time it was done it normally doesn't happen like that like I said alive Cresco car some [ __ ] last me for at least a couple days after me I have to only doubt for about the G leaf-like reliable riser cartridge so far so far cuz I only had one and take what this [ __ ] definitely um looks even like it has some like oil in it yeah my fur is nice man and to be honest with you the throat burn isn't even isn't bad at all anymore like I guess it maybe that first initial like maybe it was just from the [ __ ] you know what I mean I don't know maybe it was you know I'm just book search anymore August 17th to be here since I haven't had a cigarette so like you know inhale [ __ ] the gas anymore so like I said I ain't been smoking much fire to be using lighters and [ __ ] so I'm try to smoke this did that cough too much right nobody wants to sit through a video and fin just hair [ __ ] hacking and coughing stuff I think I'm doing pretty good SIGCHI Finn this [ __ ] alright I'm just got it I was under 13 minutes up [ __ ] whatever time it is we're doing good see my love sign up here it's pretty cool right see ya man I hope everybody's being good hope everybody's being safe hope everybody's got to [ __ ] medication everybody's smoking right along with me and like I said earlier if you are smoking you're still watching me believe it in the comments what the [ __ ] you're smoking on and you know rich me good luck through my [ __ ] surgery - why don't you while you're down there you know what I mean say something nice to me not like you guys don't I just say it is like my fourth time being uh put down and every time you just ask areas first the thought is always in the back your mind of not waking up right that can happen anytime again put down any type of surgery I don't get but what kind of surgery it is even it was the most simplest kind of surgery there is you could [ __ ] not wake up for it something could go wrong I try not to think about it too much this my friend my friends is definitely helping it out I'm sure I look [ __ ] smacked as I feel smacked I think this one's in the book boys I believe I had a black Afghani flower before buy it makes double you see I'm not sure where the hell I had that the black Afghani fire from but I have had it before and it was [ __ ] amazing and it looked beautiful as they called purple maybe it was maybe it wasn't Marilyn Allen I understand but maybe that's whenever they first started putting in their own [ __ ] jars or packaging or [ __ ] classic however it is you want to [ __ ] all I'm pretty good boys look this thing went out i'ma go ahead in the video here I'm feeling nice imma [ __ ] hop off go to bed get ready for work tomorrow and then after that you know it's time to grind boys I can't eat a drink anything past 12 o'clock tonight after Tuesday night Wednesday morning 9:45 of them getting put down peace love you mama y'all make sure you smash that like share subscribe all that good [ __ ] I'm gone I'm feeling nice boys like Afghani [Music]", "JvmkaiMNW-U": "today we're going to be reviewing the $4 one grand prix roll with gummy I recommend buying at least two of them because you're gonna want to smoke another one for this price yeah probably why I'm keeping you around was looking for exactly when I'm and I just helped me stay damn baby girl I hope you well for me for reeling when they get this thing when you're typing and they're gonna show me probably three things are you thinking I'm gonna tell you what I was thinking Oh at first I thought bazooka bubblegum Joe you know that you know like strain that you can't really find any more bazooka bubblegum Joe tastes just like wow oh they have to get that I haven't had a strain like a year to then she's like no there's gum in the payroll and I'm like in the payroll I'm like there's little gum stuck like I thought they were all the pyro with gum inside of it like true like it don't you then I'm like then she said no like you are then the way she said it she made it seem like the mouth tip like it I could they had like it was chewable like the mouths it was Trubel because she said as you're smoking the point is to chew the gum so he'd take a hit to me chew it but she meant like you chew on the tip but it turns out it's literally a [ __ ] pillow or gum in it see that so go up here oh look I can't do it I can't shaking it I can't hearing that noise I might would it be what could it be I'm like I thought I thought it was about tip I thought this piece was like hard or something like I don't know I just I you chew it on it took a hit you know holy [ __ ] this is my first time dry hitting again and I should taste pretty good again four dollars for this full grand pure one of the guys a little little little tour of the package here I guess they're based from San Francisco 15 percent THC 17 percent total cannabinoids no CBD net worth one gram find out first let's give the gum a try I thought I was gonna be hella hard this should change special spot taste good a thousand it tastes all expired in [ __ ] for the gum ball one to ten definitely attend exceeds my expectations I have low expectations for the gum ball now let's get to the joint weird I never another think about it I've never smoked a joint while chewing gum it's gonna be sick alright can't see it on camera put the whole paper shrinks love and you hear that noise it means just good airflow that means you smoke a good joint so we'll get to it before I I'll get to it before I get all the flavor away alright ready is must about this [ __ ] up have you got a joint make sure you take a puff with me and let's get to this $4 gram bubblegum pure Fisher you guys who tell about my face not too excited then again she was four dollars out the door like three dollars after taxes like four bucks flat let me know if you guys have these few rules let me know the price that you guys paid I paid four dollars out the door so let me know what you guys paid for this because for four bucks I mean I'm not buying anything but the taste is not bad it's not bad for a four dollar Peru it's not bad taste like I don't want to see it seems like we're almost a it seems like Endor trimming so I don't know what you prefer good outdoor or some enjoyed shrimp he's way sorry I left you guys go back and look at that cookie video this ash looks way better than that cookie Peru there's like actually white in the in the appeal it's not really one of the focus but you can kind of tell it a little bit white sitting nice and even too Barty knew was gonna have good airflow [Music] do this has like a bad denial I the taste uh-huh I'm gonna just talk some [ __ ] you guys are into music I'm about put you onto some game right together before it's gone look at that hey thousands use almost 9000 uploaded six days ago June 24th this and the other one is not around I prefer vital I just can't see something better like I might just go by father did you smoke more on the session okay five-dollar smoking for $4 pre-rolls in the session I'm gonna make that immediate let me know you guys want to see that bread but for the guy that's on the budget man needs me to get you wanna give see me man I'm not I smoked indoor I smoked like not a lot smoking though most of the time there's a period of my time where I got car accidents and I was really low on money and you disabled for a car and I was buying pure outdoor nothing but outdoor or nothing to wax you know as I could get fool I resin wax full game live resident wax I'm pretty late I tell you for a full gram leverage lasts for 20 30 bucks you know two three of those glass blowing at the [ __ ] like this that I know okay see I'm hella hype bros this [ __ ] got me I wasn't even my point how what I was gonna say is like just knowing that the [ __ ] like this is dope but what I was gonna say being a consumer that knows what it is to get high for real for real in the awesome gasps gasps awesome indoor it's like you smoking outdoor you got a row like two of those [ __ ] I want to go through all that pain of the harsh shades of smoking outdoors Shane I don't know what this is this could be out though I'm pretty sure it's out bird but this she got me high as [ __ ] bro I don't know what it is only that indoor high like this bro this gets you that indoor I've had you guys seen Maya you guys seen my videos Homer you know buggy shipper name one function I review to my channel like I can't think of anything oh I can't think of nothing right I don't think of you nothing [ __ ] my channel I a DA but that's that's one thing that's one thing to show like dad like Minecraft and his bug I tell you guys love this is not fun I don't know how but the thing is I don't know how much you guys either for so let me know how much you guys get it for that little maybe I can put some sentence in the shakers $4 for this guy's road trip and he'll by 28 is [ __ ] a real for a cat yeah man still beautiful video I found the fabrics creatures went dark I recorded my Samson I don't like recording on my iphone tell me which looks better this one of the other but I have some porque ones that I record with my Samson how things could do for my iPhone before I give this [ __ ] inept endo catalyzed [ __ ] now yeah totally recommend fully recommended what I recommend when I [ __ ] up one by one I recommend buying at least two of them because you're gonna want to smoke another one for this price yeah for something that's gonna be a hopefully I got live with me and watch the videos and it's no meaning [Music]", "HiZY-nT5yWE": "[Music] what up guys should grow clean cannabis coming back to you here on channel 4 2008 today we're going to be determining is West Coast cure cured joints aka pre-rolls really worth 15 bucks a pop I think it's affordable for a pre-roll 15 books in it really bad I feel like that's how much pre-rolled should be costing across every brand alright I just depends like what store you go to sometimes you can find a 3-pack for 25 bucks this string that we're going to be smoking on is wedding cake they say there's one whole gram in here the packaging I like I like the way it's like simple black it comes in like maybe like I don't know how you guys smoke or Medicaid but if you do blunt this is like what a pack looks like for one so that's why I like it opening it up it has a really pungent smell to it like a very very strong weed smell loving the tasting west coast here I love west coast care brands you can never go wrong with west coast here whether it's a pin a pre-roll dabbing and I just really like this I cannot wait to spark this up this smells like wedding cake cookie actually so we're gonna spark this up my roommate bought me a new laptop for the channel I'm so excited so we're actually going to set up the laptop it sparked this at the same time see how highly actually okay so if you're not getting high right now whip up that blunt you've got that joint you've got that read and let's get it okay I'm gonna actually cut this pre-roll open just like the tip and then we can break it down the last 30 seconds of the video and see what's inside the taste is impeccable like this like I said the smell of the stream was fruity and pastry at the same time and that's what I'm getting from the taste to zone actually was gifted this laptop because I was complaining about editing and that's another reason why I haven't been even posting first simply cannot edit well the slow computer that I have so I'm gonna take this over and flip it over this is the Microsoft Surface go I wanted this laptop I didn't think I was gonna get it like I could literally like kiss my roommate for doing this for me like I have some great friends down he also got me this awesome board so that this is so complex like I cannot figure out open this we are in business we are in business and I'm so excited you guys are like this I couldn't leave a comment down below are you a joint person are you a boring person honestly I think I'm moving towards that's my preference what is yours again leave a comment down below I'm so into that type of stuff just knowing about you okay channel 420 so you know I wasn't gonna let you go anywhere without getting to the bottom of this print roll no I said I was gonna break it down and show you guys what was on the inside so there you have it honestly it was just a regular bud nothing special but shout out to West Coast cure for not giving us no nasty mid-shelf bud this is actually some premium bud good see those nice crystal lose nice colors and then here's your wrap just to tip a whole joint wrap yeah shout out you guys subscribe [Music]", "qWpOKPmnhJo": "[Music] [Applause] [Music] too many thoughts on my mind i can't sleep at night so i just keep writing i don't need no help i don't need opinions so don't waste my time then i just been living online my city don't show me no love and that's fine but local radio stations", "L5oNEeWSed0": "i gotta move my car to the shade real quick because it's in the sun all right so i'm gonna start off with the packaging the name of this pure is called littles flaves infused so they have the regular payrolls which is just flour and then they have these infused ones and this is testing at 30 percent the last one i had was 33 and yes that's thc not cannabinoids it's this one's 33 cannabinoids 30 thc strain of this is going to be alien sour apples gonna be a sativa period this is packaged on o six 1920. first get the pre-roll is gonna be plastic right here on top and you're just gonna pop that off and these and this is how the pre-roll is gonna come out too the tip is always gonna be different so the last one i had was purple and now it's green and i know the pre-roll looks [ __ ] small but trust me it packs a [ __ ] punch this shit's [ __ ] crazy with the wax it burns really [ __ ] slow i'm surprised how long i was smoking it probably smokes for like eight ten minutes to be honest but um let's go ahead and spark this [ __ ] up show you guys how it burns and guys when you get a pre-roll any pre-roll you always kind of want to do this just go like that around it all the blood separates and it doesn't vote or anything and it burns evenly but yeah don't let the looks for you this [ __ ] looks small but it's [ __ ] crazy guys price of this is around seven dollars maybe maybe nine dollars i'm not sure but i think it's like seven bucks you get a half gram and they [ __ ] pack a punch for the price it's only a half gram but you're getting wax in this and it burns really [ __ ] slow and it tastes [ __ ] amazing i don't know if it's because of the the wax see i already took a couple hits off of it spraying pretty slow i think it's just starting to wax if you guys have these around your area let me know how much you guys are getting for because to me this shit's [ __ ] worth it under 10 bucks you guys look at the ash the actually pretty bright i don't know what kind of papers you use maybe like some elements or something [Music] or it could be some zigzags because it looks like it has like that it looks like it has those lines that go across you know shout out to everyone that's been subbing man shout out to you guys you guys keep commenting i'm trying to show some of the bag i just keep forgetting but uh i'm sure look back to everybody in the comments and [ __ ] shout out to you guys keep grinding man try to upload every day i've been knacking a little bit i haven't uploaded in like three days or like four days but i got two videos in the vault now this one i got this one then i got one more if you guys like podcast two bro you guys gotta watch mike tyson's podcast crazy ass [ __ ] podcast bro you got some crazy ass people on there and mike tyson's gonna fight a shark in august crazy look it up great white it's worth the money for sure we need to buy more of these but i know this company really focuses on giving the best bang for their buck to see that actually [ __ ] white all right man that's gonna be it for the video overall i'mma rate this joint a solid like it's not you know lit to the max type [ __ ] but for the half gram period that it is this [ __ ] packs a punch for sure so i'm gonna cut it right there y'all hopefully y'all enjoy the video hopefully i inspire y'all to call something hopefully i'll learn something and catch you on the next one peace", "cOA_w2tKDiY": "break me out come and find me in the dark now every day by myself i was never meant to fight on my own", "tMRCYT7ubOg": "yeah I do it do whatever you see fish you feel the energy coming off of it you know the maths pity feeling actual kinetic mass rotating that's a good pack yeah but really though you can you can feel the energy but spinning everyone that sees this they come flocking to it just push it down just place it on the table it's like like a and then there's a pegboard I have it hasn't been finished coming off the factory but I'll send it to you guys with the other little accessories make life lovely house how about some vibrating machines anything I'm playing jokes to guys like the guy that", "7_5rnDn4io4": "coach Carter gets angry and transforms into the Incredible Hulk live from Houston Texas coach Carter is an incredible hope the world's strongest of danger how calm Hulk be good stupid humans hope warned you the angrier hope gets the stronger he becomes and a Hulk is very angry this time all promises he is called hope swear [Music] Hey pe boosts our David Banner puny humans you won't like even an egg blue I don't blade your eyes eyesight all my references and quote reliable sources and then I become the Hulk puny humans hope did it do it Oh found it like this oak is not afraid oak is the strongest one there is hope smash and bash don't hurt hope when hope gets hurt Oh gets mad when hope gets mad hope likes to smash things Hulk smash gains the Hulk the world's strongest Avenger is a fictional superhero with amid superhuman strength stamina durability endurance and longevity and regenerative healing factor whose alter ego Robert Bruce Banner possessive genius level into becomes the Hulk a large green humanoid that possesses immense superhuman strength and great invulnerability he becomes the Hulk the Hulk inspired by a combination of Frankenstein and dr. Jekyll mr. Hyde the Hulk when Banner first becomes the Hulk is caught in a blast of a gamma bomb ha and he invented while saving Rick Jones but YouTube had wandered into a testing range then he becomes incredible hope this time hope promises he is called Hulk swear the angrier Hulk gets the stronger he becomes and Hulk is very angry Oh calm Hulk be good stupid humans Hulk warned you ghost Carter gets angry and transforms into the Incredible Hulk live from Houston Texas coach Carter is the Incredible Hulk the world's strongest Avenger oak is not afraid focus our strongest one there is Oh smash Oh - don't hurt Hulk when hope gets hurt hope gets mad and when Hulk gets mad all clocks are crawl turns the hook both banner and the hope are pursued by the [Music]", "KY4J-2T3-l8": "[Music] [Music] [Music] [Music] [Music] [Music] [Applause] [Music] [Applause] [Music] [Music]", "K9E3jWaLJM8": "Oh yeah my Oh", "mdqV728E-ug": "[Music] what's up pop peeps in sugar I'll pop mine for 20 and we are back for another product review video before we get started popping so let's do our little thing that we call SML we need you to subscribe and while you're there I need you to hit that notification bell and also just like me because I'm pop mom and you guys already love me anyway so make sure you're going in that love but Ananya to guys today I know have been one like a total hiatus but maybe about a week or two now just because of the holiday break so I appreciate you guys hanging in there making sure you go to my videos as soon as they drop on leave Wednesdays I appreciate it I came back with something bigger this week guys I have Peck woods not to be confused with back woods this is tactless this is packwood's dot la is out of Los Angeles and I am so excited so be the proud owner of three of them I have all three pack words from LA they're now at planted 13 so you can get packwood's in nevada now at planted 13 so shout out to shot planted 13 that always hook me up with the latest that comes out I got all of these and Nevada from them they have an exclusive one called alien og so I'm excited I have all three so what I want to do today is just do a simple product review with you guys I will include all the links to Packwood's la comm so you guys can go in a site find out with new strands that they're coming up with but I'm just excited about the company so what they have done is infused rolling papers that look like blood papers and they're not they're a handmade hemp wrap paper that they put a vein into it to make it look like it was like an actual plant wrapper this guy's is special because they did three different infuse menteur this they have a concentrate in it they have a premium flower and then on outside they dust it with Keith so I don't even know how strong this is gonna be I don't I don't know how many puffs I'm gonna be able to get all I know is I'm gonna be a little out so I don't want you to judge me but we're gonna get into this I have three brands here this one is the alien OG hopefully you can see that this one is exclusive to Planet 13 once again shout out to them they are sold out maybe out of this one you guys have to call them and see this one is called GABA and this is a hybrid so is the alien og so both of these are hyper some remember hybrids want to keep you nice in the middle that way you can feel the head body high but not too high now this one the purple one is called purple punch and this one is an indica so today I'm not going to smoke Invicta I'm also not gonna smoke this particular hybrid Agathe I'm gonna go for the alien og because I am an alien and I want to get a shot off the plane 213 because this one was exclusive you might not see this one on the market I'm not sure so I wanted to kind of give my review to them as well what I thought of the one they made just for planting 13 customers so we're gonna get into this I'm gonna remove these two to the side so first of all I'm going to just talk about the packaging because you my peeps know when I do a product review I go there I go all the way there first of all I love that this can't break I do know they're going for $60 at the shop so they have $60 here in Nevada we can look up and see what they're going for Vegas but this is $60 so for $60 to Graham would concentrate premium flower and they keep one outside that does an amazing deal and I love that you can't break anything so you don't have to silver fragile because I mean your product is fragile but I love the date took the time to kind of like really design it where it's eye-catching as well and even if you see it inside of this place like it's playing 13 they have done the displays so beautifully so shout out to the pack was marketing team in LA y'all did that it also kind of reminds me in a weird way of a Kylie lipstick if y'all agree with me pop peeps just tell me that in the comment it really does it has that whole trippin thing on the side so this is really a good packaging I I'm impressed with packaging didn't even think that so you just roll it off it's a roll and I hope my camera can get to this so let me come up I want you guys to really see that when you first pull it out and you can really smell it the scent on this is I just love the smell okay so if you can see them holding my hand up you can see the key fits nicely dusted on it outside this part of it is a glass tip so it's gonna allow you to like kind of burn it evenly so you get a nice draw every time you pull that's what the glass tip is supposed to doing this is a nice sized glass citize I would say that's a couple of inches I don't know if you can see that real close up but that's like a two inch glass that's really nice to me it feels like if you had a mini cigar in a way so I kind of I love the feel of it it's nothing to it but to do it we're gonna get into it anything I like that's a blunt or the palm rolls or anything like that I like to light mines with the hemp I know this is a little piece of this is hemp rope I like to light it with that that way it gives me some type of control instead of letting my lighter control everything so that's how I'm gonna do it so choose the you pot peeps shot the Packwood's LA and let's get this alien og from shot planted 13 let's I like to inhale just to make sure I'm pulling everything I must say lighting getting I thought the pool would be happy they go be a lot heavier and it's not it's really smooth and I guess it has something to do with the glass tip now I can tell if you can tell I lit it wrong in here but it should have a nice even lip and because that keep us on the outside it shouldn't burn through fast that's what it shouldn't do if you find yourself in you lit it the wrong way just let it take its time and let they kind of like let it breathe and it'll evenly start to burn around so what I like is that you don't have to put the whole piece in your mouth it burns real light you can just put your mouth right on a tip just like my shirt be on the lookout for shop pop mom for 20 years oh I got that weed weird I like this a little dude not sure what premium flower I do know that the concentrate is nice and to keep this not even coming off on my hand I love that so let's talk a little more in depth about this back once I got my smoking hat on you know I've seen Rick Ross smoked this I've seen you waka flocka the baby little baby what's that other baby skittles baby I don't know one of them other babies they've all had this and now I'm hot moms at it I gotta do this I need a friend shout out to any of my papi friends that want to come share cuz I don't know if I'm gonna finish this this is this is a lot I might have this for the next couple days it's two grounds one person should have to finish this off seriously what did you say when you hi you just don't know what to say I guess you say that [ __ ] was good huh no I hate that y'all see me like this cuz I'm gonna be rolling I don't even know me get anything else doing this is too much this is probably not the best product reveiw to have done I'm super afraid of my life right now but this is nice you know what this would be great for like people that are having bachelor parties or bachelorette parties New Year's Christmas you can get them the people if you live in a legal state oh I can't move to this come to the East Coast Jesus [Music] Oh also Packwood's shout-out to y'all have made a collaboration with cocoanuts which some of the celebrities have teamed up to make these into like chocolate edibles kind of thing so check out backwoods la calm because they got a lot of interesting collaborations like they did a collaboration with planted 13 they're doing it with celebrities so shout out to them definitely gonna go to pack once when I go to LA cuz this is pretty cool in the light so stoned and how many puffs that I take I don't even know if somebody keep it count I wish somebody was here to play this is what they do to me pop beats they just leave me in a room with filming and just tell me to go for my own okay I'm really high seriously you don't think it too high he's just like alright I'm over it I'm like hi okay I think I hit this at least maybe 10 times which is extreme okay this is my review of a Little J first of all I'm high I'm really high and I just don't even know this hormone right now seriously I don't even I don't even know what to say I mean for once I am truly I think it's strong I for what a high grade us I feel like my body is just like somebody else came and took off really nice somebody named Adele a no Gina so somebody can come take over your body if you did a little G because I don't feel I don't know oh I probably wish I had a friend this year went that way I can have somebody to give me feedback and I know Papeete y'all wish to do that but you're not here right right here matter of fact you try it exactly it's like a calming effect but you just feel like hmm maybe I should take it slow like I feel like I can do things but I should probably take it slow I feel like if you were sharing with this this was someone you don't have to worry about them soggy enough to tip its glass so it's really like one stay sturdy you're not sometimes you you roll a blunt and then they get all saggy at the tip of it and you gotta pull it back together they've already solved that issue so this is a great cheerful I would suggest you buy it this holiday season share it with your friends you can put it out as you see I'm probably one hit just another day so this is definitely a two day if you buy yourself this is a two day situation it's no way this is no way it's just no way like I'm cool put old day I feel great about this situation would I buy it hell yeah yeah I like the alien og I do I really do and this key thing is fascinating it really is because it's not like coming off on my hands or anything Frank it don't come on that's just like amazing oh my burn my nose oh [ __ ] I feel cool this out oh I'd say that like I got a young Stoli if I put it alright guys here's my Beulah spec would if I had to give five stars I would definitely get them five pot leaves on these these is they they're the way you hold them they strung in your hand they burn slowly not burning fast I've been at this for about an hour or so 35 minutes it's a good burn if you were smoking a regular blunt you're [ __ ] we've been done so backwards y'all got pop moms 5 leaves I'm gonna try these other two catch me on instagram to see how these to turn out guys but I wanted to make sure that I share with all my pop peeps the alien og which was exclusive to Nevada packwood's family out of LA welcome to nevada planet shock planet 13 thank you for making sure that i got one of these in my hands and just to the new pack with family that's coming to Nevada I think you guys are gonna do beyond well you're really artists really makes a whole lot of sense you know I feel real bossy I feel like Rick Ross huh you know I feel like snooping them yeah shout out to the little cocoanuts and I'm should be one anyway come on pack with said pop mob some stuff Papa mama tackle is can we do something can we do something pack with come on pack would you want pop mom this is a perfect blue how much do some music coming down my head cuz I feel so good all right pop peeps make sure you watch me subscribe no put that notification belt in a like button and check out my next video next week I appreciate you Papi's check me out on IG [Music]", "1oTozjy0n2E": "[Music] [Applause] [Music] too many thoughts on my mind i can't sleep at night so i just keep writing i don't need no help i don't need opinions so don't waste my time then i just been living online my city don't show me no love and that's fine but local radio stations", "IX6uqO4HQVc": "what up YouTube Dustin guy from Hamilton coming back at you with another strain review this time we got a double strain pick up some dollar but again we got cotton candy and then we got the Incredible Hulk show you guys with Incredible Hulk looks like first because it does look really really incredible move this stuff guys will be really nice lace bugs with a really sweet cushy smellin almost hides a little hint of cheese into it and this one credible halt [Music] really really nice but super super hard like I am squeezing on that button that has no give to it whatsoever super super hard bugs that is the Incredible Hulk now I'll show you guys that cotton candy now this stuff I'm telling you guys really really does smell like cotton candy it's got a nice little hint to contact ad these are smaller buds and [ __ ] but you know what I'm not going to complain because the quality of this stuff is really really nice this is what the cotton candy looks like super super crystally extremely sweet-smelling I have not tasted it yet but it really really has a great smell of cotton candy to it so I'm really really hoping that the flavor of cotton candy isn't it as well because I would be really really cool so there you go guys there's cotton candy and there's the Incredible Hulk peace and love everybody always they've left from that freakin guy from Hamilton we out", "_PyqdvruQwU": "ready you're ready for this ready are you ready we are ready to smoke marijuana marijuana review day ready we're doing it we're going in we're going in hard we're going in fast we're going in ready we're not quite ready but we're coming in ready we're gonna get ready when we get in there don't worry about it just get ready [ __ ] do it live we'll do it live okay we'll do it live [ __ ] it do it live i can all write it and we'll do it live all right we're doing it live today's review retican readies i'm super pumped i'm super pumped reddican readies let's check out the package here red can readys pre-roll cannabis 10 rolls our net weight is 3.5 grams total thc percentage in this weed is 16.42 that's not bad this is a sativa the strain is outlaw and outlaw is a cheesy phenotype of amnesia haze that's what it says on their website um we will see how cheesy it is i do like the cheese i do like the cheese cheesiness says to me more sativa it's always kind of had the higher up more energetic lower thc great for the day [ __ ] just spin them up all day long and not have to worry about too many repercussions package date so package date is may 8th 2020. now may is not too bad we are in july today is july 14th or 12th july 12th today we'll say okay so the package on may 8th i don't know what that means because if you can make these pre-rolls in january and just have the boxes sitting on your shelf and then put them in here on may 8th and then put your package date may 8th but you're smoking january dope that's what could be happening we don't know that's just an unknown let's open it up see what we get here's that little sealy sealy sealy sealy so boom we're getting in there what do we get oh it's a little package there's a thc picture on there and then there's nothing else on this pack this is a nice little slick little pack though i do like it i'll slot right in my pocket yeah ripped off the plastic there let's go for the open opening oh some little tinfoil wrap there like a cigarette pack normally you just pull okay oh yeah there's there it is there it is pull that away and then we have ten readies up in this batch boom look at that there's your retican ready now the marijuana inside you can clearly see there's marijuana inside that's good that's good that's what i'm hoping for let's do math real quick here the package comes with 10 pre-rolls the package weighs 3.5 grams of dope so in each pre-roll you got .35 of marijuana i paid 24.99 for this package that makes every pre-roll about 250. so 250 for .35 grams of dough now let's see what's in the pre-roll just for fun that's what this is about we're recreational we're just doing things for fun i'm gonna rip this batch open let's get you open let's see what we're smoking on is it sticks is it stems is it seeds we don't know let's see it's not dry and crusty i will give it that you know you're not uh may 2nd package date the weed that's falling out is not dry and crusty there is a bit of humidity left in there that's what you want yeah yeah we'll do a little dance for that okay so there's .38 of dope in this pre-roll that's on point perfect ah do another dance you're getting dances today now let's see what's actually in here so it's not too bad look at this this is a stem here okay that's something you don't want to really pre-roll right here that's leaf okay so there's a bunch of leaf getting in there this is definitely bottoms okay this is bottoms this is the bins after it's handled weed you're going to grab all this bits and you're going to put it in your parel that's what's happening here but there is flour in there too it's not all sticks and stems it's not all leaf matter you can see the leaf matter there's chances you know when i roll my joints i report all the stem all these little bits that affects my smoking goodness these are i'm pretty slick i mean i am slick but i'm also pretty happy this is a little slick pack um i'm looking forward to getting all snapped up here it's [ __ ] 420 right on the dot too hmm not bad not bad not a whole lot of flavor there's really not a lot that stands out on that taste i know i'm smoking weed but there's nothing to complain about either right i'll just start there so good good good good in the past i've had two other radicands actually have them right here i have the waffle and the god bud done both these they were both 29.99 which is a great price and they were both quality dopes they passed the test they're rebuyable they're suggestible check them out check out redican this is gonna be perfect for me throughout my day a quick little snap snap i'll take my i'll take bowl hoots throughout the day just to get my medicine so i can keep going that's what this is very convenient actually and for 250 per joint all i need is one and then i continue on my day this one's almost going out though i need more than that so you got a second one going right away before this one goes out and you just gotta keep her going it's smokeable but it's not flavorful that's what i like to say there i smoked my second one i'm getting down there i'm getting pretty snapped up i am feeling good i'm starting to forget words here you go friends take one of those put it in your mouth later later as easy as that smoke three at once if you want whoo [Music] you can like two up and give one to a friend if you want that's how easy that is to they're quick lights that is nice it's not like uh they light like a cigarette you smoke you know one two three four five there's five more somewhere one two i lost three okay so no i have four i have four in my hand and i got five six seven eight nine i lost one when i threw one to a friend but the neat thing about these this is really cool let's say you're like boom out on the street you're like hey bros guess what i just got i got some reddit cam readies you want one do you want one and they're like yeah we'll take one and you're like boom there you go friend there you go other friend and then you're [ __ ] flying now all your friends have your own little pre-roll and you carry about your day i actually have all the pre-rolls going just a big fatty right now here that's the way just get ready if you're a lightweight one will get you go going if you're a lightweight one we'll get you going but if you need a little more than one light up seven they're they get going good now you know you light them all or you can light one all right so it is smokable weed there's no way i do that if there's no way i could do that if this wasn't smoke but we this is decent weed okay there's there's not a lot of taste there it really just falls in the sativa category that's what's going on there so there's no point for really enjoying your bud the weed needs to be better but the convenience and the actual product is fantastic straight up fantastic these are quick you want to go out on the boat you want to even [ __ ] take a rip on the sea-doo you want to go up in a hot air balloon grab these like wherever you go you can just have these with you have these in your car have these in your glove compartment i just smashed through 10 retican readies the overall smoke was a little harsh a little dry there's not much flavor in there at all but the pure convenience of having smokeable weed rolled up into something like this to just have on you wherever you are and blast away whenever you need just real quick boom boom boom that's awesome the weed probably a six five that's where i'm sitting with the weed six five the actual product the actual product get fireweed up in this [ __ ] the actual product is an eight one these are awesome okay so let's do that [Applause] [Music] [Applause] [Music] i'm also [ __ ] stoned right now too cold because all that [ __ ] like that [ __ ] smoking i'm your neighborhood roll that [ __ ] like that [ __ ] i'm your neighborhood weed man roll that [ __ ] like that [ __ ] smoking i'm your neighborhood", "kT7eVbVdVbY": "the banner now might be a really good time for you to get angry that's my secret that I'm always in [Music] [Music]", "X6yvMpHuoo0": "[Music] all around me are familiar faces worn out places worn out faces bright and early for the daily races going nowhere going nowhere the tears are filling up their glasses no expression no expression hide my head I wanna drown my sorrow no tomorrow no tomorrow and I find it kind of funny find it kind of sad the dreams in which I'm dying are the best I've ever had find it hard to tell you I find it hard to take when people run in circles it's a very very [Music] children waiting for the day they feel good happy happy birthday feel the way that every child should sit and listen sit and listen went to school and I was very nervous no one knew me no one hello teacher tell me what's my lesson look right through me look right through me and I find it kind of funny I find it kind of sad the dreams in which I'm dying are the best I've ever had I find it hard to tell you I find it hard to take when people run in circles it's a very theory [Music] [Music]", "eyQ1s0VAolk": "hi stu's reviews here i've got fuzzies again i haven't had one of these big ones in a while absolutely this is the fun part uh so we're just gonna see if they are staying up too standard totally keef covered and it's og kush uh well besides smoke going everywhere and bugging the [ __ ] out of everybody in the condo complex this is a great freaking pre-roll it's incredible i haven't had one of these in a while they are fantastic the fuzzy's uh infused pre-roll here is one of the best on the market it's good for people who have a really high tolerance so i suggest it for any of the hardcores out there well i just have to say once again the uh fuzzy's pre-roll is freaking incredible and i recommend it 100 percent incredibly strong payroll not for beginners but how are you going to be advanced you have to keep smoking right okay beginners get out there and do your thing damn it just kidding all right", "YxQBevTaczg": "attention Enterprise crew don't make me angry don't kick me off Wonder Woman I love that in don't make me mad perhaps but don't make me mad you mean like this great I'm all green watch me on me rah me TV it's super high highs Saturday night starting at seven six enter on me-tv", "bV6ZZfp4LFI": "hi Cass our way let's just stop by introducing ourselves yo ma else please alright clubs my name's have my name is bull we love it out of the stem push one NZ in Carvahall can I was supposed to gammer or sometime and yeah but don't be worried what time i get r AG is if i see guns weapons or gangster so it's it's ok it's ok oh man i just toured the My Little Ponies gangs ah look what you did look at this look incredible hulk drink your man you ain't the hook just bring in the face you guys a real jerk derp derp no papers were hurt in the making of this film except for that one all", "AO8WcLffTKM": "so see you gotta help me the History Channel after me again why did you know we keep equal parts frozen orange juice concentrating gasoline does not in fact make napalm and then adding a - the sawdust didn't do a damn thing at all huh I didn't know that neither the people from the History Channel really that's surprising to me they're really nail it on that ancient aliens thing they're gonna hurt cat Gingrich if I don't give them a napalm by the water wait what are you working on I hope this little thing is that a time machine no is that a particle display sir no is that a laser made from souls no gonna hurt me another cat Adam it's just a lawn mower I got from our neighbor Bruce Banner it's broken I'm fixing it okay I think I got it I don't hate just G and when you say things like that it hurts my feelings", "Bv09DRd4lsM": "let's go place a check when it stays on really stays on that kind of stays on Hashanah and I'll do it in yeah come on me Mom [Music] Oh [Music] maybe we'll never do this [Music] one hill and the curve goes away 50,000 fans screaming my name the pub air got prettiest aren't even out yet [Applause] [Music] I knew it [Music] - Davey Lewis don't look affair [Music] you mean yes stuff [Music] [Music] [Music] [Music] welcome things that's not fun should take [Music] I won't enter you necessarily it's good [Applause] [Music] [Music] [Music] [Music] but going to get the penalty is Cristiano Ronaldo but hold on a second he's taken the fall of Cristiano Ronaldo [Music] [Music] [Music] [Applause] you", "3QQ06pW7GLw": "[Music] what's going on sarcastic - Goldline VP our brands for making that's on it making it this would be possible so we're gonna get into their CBD joints they come 270 milligrams I'm assuming this is 90 milligrams per serving one gram per serving three servings per box you do the math yeah so these are three three gram or arms assuming that means Oregon grown hand roll premium CBD hemp flour yeah no THC so you see the pre-roll okay smells smells like tea okay so you can see inside the box yeah so let's go alright nice size check it out mmm I'm seems like the size of my finger yeah this we could get idea let me see if I'm ready then to balance so [ __ ] I don't want a balance let's try that here you get the idea yeah let's go what's going to site because on the box doesn't give you any information like I hate I don't like one company go what is in it like what is the strain of much makalah of CBD Goldline sativa pre-rolled it's nice real smooth not harsh it's real smooth is nice I just want to know what's in it we don't have no much more call it there's no QR code so I'm just so I'm going to the site no QR code yeah city like a rocket this morning time got stuff to do for me that's when I believe sativas should be taken what I mean is somebody got an era era and you can't see it was not its tried again people I don't know I'm trying to see what the strain is here it's nice I just can't tell you out what it is it's nice it's mad smooth man you says industrial hand me this doesn't give and you're like this fight I don't know why I take so long to load the same and I gotta ever again oh my god I can't get information on the guys it's just three sativa it doesn't tell you what trying for y'all trying I think their site is down because it's taking that long to load and then when it does load it's an error this is math smooth it tastes good there's no harsh taste no I could see I like this idea I wish you know I have more fun it's still not even loaded and it's an error and ever trying to I'm trying to show y'all again focus be see what I recommend it yeah you know and I mean it's hard to go take a recommendation you don't know the straining I'm gonna try to find some information again and put it as a pin comment but I like it it's smooth I'm feeling it above my eyes yeah it's a t because I'm like yeah this is nice just can't tell you what strain is FC BB you see having coughed one it's smooth oh my god I like this but yeah guys thank y'all for checking out the review I'm sorry that's all information I got and about thank you for checking out the review all information is down below where you can get the product for yourself remember thumbs up subscribe all that good stuff and I catch you in the next one I'm out", "yQZ5HnDQhuQ": "[Music] hi guys welcome back to my channel hope you guys are all having a little day welcome back if you are you have been part of the game i don't know what to call you guys um and if you are new welcome back go ahead and smash that like button subscribe and turn on your post notifications to be notified every single time i post a new linger today i'm currently in los angeles california i'm about to take a dab before i talk anymore go ahead and grab your dab your [ __ ] blunt your joint your edibles your thc drink your munchies go go go and let's take a dab and let's get high right before this video i always forget that it's not ready until it vibrates uh wow that was a dab every time like i sometimes when i dab uh like fat ass dab i drool since i'm not really used to bulls as well i usually like drool too and like i try to record a video and i'm over here like [ __ ] julie on my foot so i'm in los angeles like i mentioned and i actually met up with this company um i'm not sponsored by the way but i met up with this company and they actually hooked me up with some free products and i'm so thankful and i already picked up the package and the package looks so [ __ ] pretty so pretty um and i'm so excited to show you guys like i'm so excited to show you guys as i was saying i'm not sponsored so i'm going to be giving my honest opinion but i'm very thankful that they hooked me up with this with these products like that's so amazing but this wouldn't have been done by myself i wouldn't be able to do this on my own like you guys have also helped me get like these free products so y'all deserve to see me smoke these and it's like i'm smoking for you guys okay we smoking virtually hopefully one day we do get to like have like a big ass smoke sesh together and like a lit ass day like that would be so fun you know nice view type of [ __ ] but this is how the packaging looks hi 90s super nice super yellow definitely summer vibes has the palm trees right here they're wax infused cannabis pre-rolls each of them hold 1.2 grams and you all know like most of the time i be smoking like joins priors once in a while backwards but it's like everywhere not rare i would say but it's not i don't smoke it as often you know because pre-rolls um are definitely much healthier since they're nicotine free and let's just take a moment thumbnail these are so cute i can't i cannot oh my gosh so we have right here the um flavors that it has we have strawberry it's sweet and juicy strawberries straight from the fields we have watermelon the refreshing watermelon you crave after the beach peach so juicy and delightful you'll want seconds definitely tropical punch oh i love the the color for this one i love the color for all of them but this is like my favorite color a blend of sweet tropical flute flavors gelato oh my gosh you guys are you guys seeing what i'm seeing the packagings are so cute super [ __ ] cute sugar cookie ice cream better than grandma's pink lemonade like a cold glass of lemonade on a summer day definitely for the summer days pineapple sweet pineapple sprinkled with sugar and double cup a candy lemon lime soda your favorite rapper's drink okay hi nighties i see you guys you guys the packaging oh my gosh i can't even decide which one i want to try out first because they all look so cool and you can tell like the packaging is good quality i like glass containers like this because i can usually like stuff this pre-roll if i didn't finish it in the um back or like if i have another one and i'm like i'm gonna save it in here so it doesn't reek my room like these are just pretty cool containers and like i like that they're colorful that's super cool and it's vibrant and it makes me like happy and it's so summer vibes definitely summer vibes i really like it like i don't know i'm just so excited i can't even choose which one like i think i'm gonna have to like grab them all and do like any minimizing well because they're all too good so guys i actually didn't record a lot and i was actually talking a lot about the product itself and i'm already i already had sparked it up too and i was not recording uh youtuber fails look it it's definitely burning pretty nice we have that white ash i just [ __ ] up the burning that's why it's like but it's burning very like nice and even not even but smooth because i didn't burn it even but yeah as i was saying i was talking about the product i really love um i'm smoking tropical punch and this one has 29.7 thc i just chose this one because it matches my nails to be honest nothing specific in particular but it's hitting pretty good their weed is indoor weed they don't use no um no trim nor shake which is like number one like a big thing most of the pre-rolls range from 30 to 40 so far as i'm hitting it it's super smooth i can taste it that tropical in there these are so like on the gold and cute as [ __ ] like hey you're going to freaking grocery shopping or something you want to smoke right before let me take out aha 90s super cute super fashionable just spark it up ready to go so far i actually like the weed it's hitting pretty good and for it being small like it's hitting pretty good and as i was saying when i was unboxing packaging um they are wax infused heroes and h holds 1.2 grams so these little shits hold 1.2 not bad at all oh i did try fuzzies and it has 0.5 and i just feel like last time in like five minutes or so and this one already has lasted me like okay decent time and although it doesn't have the wax out on the outside it has it in the inside it tastes like pretty enjoyable versus the fuzzy i just felt like i don't know it just tasted like straight up wax like i don't know how to explain in like straight up wax and it also i don't know if it also could have been like the weed too that fuzzies carried because i know that the packaging date was pretty um it had been like since the end of march that they had packaged that [ __ ] so i was like [ __ ] but i already had paid for another great thing about these free rolls each of them comes from a natural blend of terpenes but i really like these spring rolls like i feel like with two i'd be like pretty cool two or three [ __ ] smoke on eight right now [ __ ] it it's all down maybe smoking like how many do you want me to smoke in the session because they do have seven now left i have seven all left so let me know what you guys want to see with the rest of these pre-rolls because yeah i don't want to be reviewing each flavor that's going to be too many or maybe i can i can do a series on this high 90s let me know down what you guys think i should do seven pre-rolls in a sitting um a series of like some flavors or like i don't know don't let me know some creative ideas i sometimes don't i'm not really creative i'm not creative to be honest but i do enjoy making videos for you guys and for the people that do enjoy thank you so much like i said i wouldn't be able to be doing this without you guys and we all go make it here i [ __ ] burned myself with a lighter but definitely i [ __ ] with it i also loved like it is a pre-roll i'm usually you guys always know i'm usually smoking joints free rows once in a while i'll be smoking some backwoods or whatever but it's an occasion it's not all the time because they are nicotine free so they are healthier which is it benefits you you know but i hope you guys enjoyed this video and say hi to the [ __ ] sky and until next time bye", "jIDXk52OUhk": "that's my secret yeah [Music] i'm always angry [ __ ]", "HntuIcah8ZA": "mmm this looks suspicious but delicious Oh dirty diapers on strings time to put this your deal behind me we got his pants stayed on oh good revenge on world look it's the incredible hulk he can't be the hulk I'm the Hulk oh please you couldn't even change into build Bixby come on dammit change mm-hmm ah forget it hmm I really did it once yes yes I just wished you had the power to leave my store hmm was headed there", "9O-j2As3YRo": "Bruce Banner is the Incredible Hulk a creature of unlimited strengths and boundless anger after seeing a premonition of the Incredible Hulk on his deadliest rampage yet one Avenger removed the threat of the Hulk once and for all now months later Earth faces a mysterious new threat the planet has been stolen and transported across the universe the heroes of Earth are lost in space along with some of the deadliest villains in the cosmos but there's still one more threat that Earth's Mightiest Heroes must face [Music] the immortal hope has returned will he be humanity's Savior or its destruction [Music]", "DxIvxhoE7G4": "Avengers: Infinity War might've pleased audiences\neverywhere, but if you're a fan of the Incredible Hulk, the film may have been a bit frustrating\nto watch. Why? Well, we might as well get this big, green,\nspoiler out of the way right now: In the beginning, the green giant withstands\na brutal beating by Thanos before being whisked away to Earth by Heimdall, and that's the\nlast time you see him in his full green glory. Bruce Banner tries and fails several times\nto get his other half to come out and play, but the Hulk refuses to emerge. So why is the Hulk being shy all of a sudden? The most obvious answer is that he simply\ndoesn't want to endure a second round against the Mad Titan, but there might be more to\nit than just that. Let's take a look at why the other guy doesn't\nwant to play the hero game anymore. Father of mine One regrettable aspect of Bruce Banner's portrayal\nin the MCU is that, as popular as Banner's \"I'm always angry\" line from Avengers has\nbecome, the movies have never explored exactly why that rage is always with him. So, it's possible that directors Joe and Anthony\nRusso are using Thanos to finally give us a glimpse of that story. In the 1985 comic Incredible Hulk #312, longtime\nHulk writer Bill Mantlo wrote one of Bruce Banner's most memorable and influential stories. Most of the tale is a flashback to Banner's\nyounger days. We learn that both Bruce and his mother Rebecca\nendured extreme emotional and physical abuse at the hands of Bruce's father, Brian Banner. Brian eventually ends his wife's life for\ntrying to escape from him. Mantlo essentially told readers that the gamma\nbomb blast from 1962's Incredible Hulk #1 didn't create the Hulk. The trauma Bruce endured created the Hulk,\nthe gamma blast just set him free. It's possible that what's stopping the Hulk\nfrom emerging in Infinity War isn't that the beating he took from Thanos scared him, but\nthat it reawakened his childhood trauma. In fact, this could be why a certain bizarre\nscene was deleted from Thor: Ragnarok. In the scene, Banner expresses regret at missing\nhis father's death because he was too busy working. \"I missed my own father's death because I\nwas focusing on my destiny.\" But that would be a strange thing to say,\nsince not only did the comic book Banner have no fluffy feelings for his father, but it\nwas eventually revealed that Bruce Banner actually killed his father. If the Infinity War filmmakers plan to use\nHulk's shyness as a way to introduce the abuse backstory, the conversation from the deleted\nscene wouldn't have made sense. A Hulk humiliated Maybe the Hulk isn't scared and maybe the\nHulk isn't traumatized. Maybe he's just embarrassed. The Hulk has never experienced the kind of\ndefeat Thanos handed him in the opening of Avengers: Infinity War. And the Green Goliath doesn't just have the\nintelligence of a toddler; he has the emotional maturity of one too. The beating he took may have destroyed his\nconfidence. The Hulk doesn't have any particular skills\nlike his teammates. Instead the Hulk's sole purpose is to beat\npeople up. If he can't do that then, in his mind, how\ncould he be anything but worthless? It's worth remembering that not only is Banner\naround other Avengers each time he tries to change into the Hulk in Infinity War, but\nthere's a specific Avenger he's being reminded of, Tony Stark. Tony's the only guy other than Thanos who's\nmanaged to knock the Hulk out. The first time Banner tries to change in Infinity\nWar, Tony's right there, urging him to Hulk out. The second time, during the battle in Wakanda,\nTony's nowhere to be found, but Banner is inside the Hulkbuster armor...inside the suit\nthat not only gave the Hulk one of his only defeats, but was created solely for the purpose\nof beating up the Hulk. It's possible that it was the wrong time to\nremind the Green Goliath of that. Third rock from the sun But maybe the reason Hulk refuses to emerge\nmay not have anything at all to do with Thanos at all. Maybe it's the Earth that's the problem. Thor, Loki, Valkyrie, and even Banner may\nhave been fine with leaving Sakaar in Thor: Ragnarok, but the Hulk didn't have much say\nin the matter. During their first one-on-one dialogue scene\ntogether, Hulk even told Thor plainly he had no intention of returning to Earth. Why? \"Earth hate Hulk.\" On Sakaar, Hulk was treated better than he'd\never been. No one even knew about Banner. The people of Sakaar didn't run screaming\nfrom him for smashing his enemies; they cheered him. They had parades for him. Why would he want to leave? So perhaps after he's sent to New York, Hulk\ndecides he just doesn't want to fight to protect the place that seems to hate him so much. The blame game We've already talked about the Hulk's fear\nand humiliation. But it's also possible Hulk's refusal to fight\nwas about guilt,.and friendship. Right after the Hulk is defeated by Thanos,\nHeimdall uses his last few breaths to transport Hulk to Earth so he can warn them. That means the first time Banner tries to\nHulk out, as far as the Hulk knows, he's the only survivor of the Asgardian refugee ship,\nand that Thor, Valkyrie, and everyone else is dead. Considering Thor and Hulk formed a bond during\nRagnarok, perhaps his belief that he wasn't strong enough to save his friend would be\ncrushing. If so, the revelation that Thor was really\nalive during the Battle of Wakanda could be a huge relief, and might help clear the way\nfor Hulk's arrival in Avengers 4. So he can do this again: Thanks for watching! Click the Looper icon to subscribe to our\nYouTube channel. Plus check out all this cool stuff we know\nyou'll love, too!", "Jz2pwgc6ZhQ": "[Music] oh [Music] duh", "YE0ybIVUu6E": "Joe Avella: Lowell Herb\nCo. is one of California's largest marijuana companies. Lowell specializes in producing\npacks of pre-rolled joints. Last year, it rolled and\nsold over 4 million joints. In order to do so, Lowell needs a lot of cannabis. This is David Elias,\nCEO of Lowell Herb Co. David Elias: Right now,\nwe're selling about 1,100 pounds a month, soon to be up to almost\n1,300 pounds a month. We're rolling 25,000 joints\na day out of this facility. Joe: The recent legalization\nof cannabis in California for recreational use has allowed companies like Lowell to grow at a rapid rate. David: As of last year, our revenues have\nincreased just over 300%. Joe: Lowell let me take a\npeek inside its facility to see how they make\nso many joints a year. Thank God, because I roll\nmaybe two or three a year, and they're all terrible. Let's check it out. How you doing? David: Right now, we're best known for our one-eighth pack of pre-rolls, which is seven pre-rolls\nin one-eighth of an ounce. We also have a quarter-ounce pack, which has double the number. We have jarred flower, which we sell one-eighth\njarred flower as well. AJ Fay: So, this is where\nwe store all of our flower. When it comes in, it goes\ninto a quarantine container, which is where we do our\ninitial R&D lab testing. When that comes back clear and it passes our\nquality-control standards, it moves over into these\nother two joined containers, which is all usable material. Joe: Each container\nholds about 2,000 pounds of marijuana. My new LinkedIn profile pic. Joe: Strawberry Banana, Mimosa. AJ: Some Gorilla Glue. Joe: Silky Johnson. AJ: The Rude Boy. Joe: The Rude Boy. You got any favorite strains? AJ: Sour Diesel. I love Durban Poison, and I love that Strawberry\nBanana; it's a great indica. Joe: All right, cool.\nAJ: Really relaxing. Joe: You seem like an indica guy. (laughs) The cannabis is put into this shaker to separate the big buds\nfrom the little buds. The big ones will be\nput in jars like these. Employee: This is 77 eighths in total. Joe: Seventy-seven eighths? Employee: Yeah. Joe: So... that's... gonna be 7 pounds? AJ: No, that's, like,\nless than half a pound. Joe: The first step in making\nso many pre-rolled joints requires this machine: a knock box. One-hundred paper cones,\npre-attached to filters, are loaded into the machine. Lowell starts with a blend of flower, which is added to a loading tray. Each tray holds 1 gram of cannabis. The tray is placed on top of the knock box and the machine vibrates and bounces, pulling the flower down\ninto the paper cones. Once the joints are filled, the trays are brought over to a roller. AJ: So, we have about 40\nrollers working each day on one tray per hour, so 100 joints per hour per roller, and that's where we get our about 25,000 joints rolled per day. Joe: Then the joints are\nbrought over to another station where they are placed\nin packages and sealed. David: When you think about pre-rolls, pre-rolls are very convenient. It's easier for the user; they don't have to buy the flower and roll it and then put it into a joint. Joe: Lowell also sells flower in jars if you like to roll your own joints. David: Here in California, we test for pesticides, microbials and potency. So, when a customer gets our product, they can actually see the\nTHC potency right on the pack and know that it's been tested for all the other items that are mandatory here in California. AJ: So, once everything's\nproduced and packaged, it moves into this container, which is our quarantine container. Joe: Gotcha. AJ: So, the lab comes here on site, they send their reps, and they do a random sampling based on the batch size. Joe: So, they just go in,\nthey grab one of these. AJ: So, this was a box of 25, they took two or three out\nof there for lab testing. Joe: Yeah, \"lab testing.\" AJ: And in a few days\nwe'll get the results back, which means if it passes it's able to be labeled and sold to the retailers. Joe: OK. How often do they\ncome through with tests? AJ: We test every single\nMonday, Wednesday, and Friday. Joe: After it passes, the products are labeled, boxed, and shipped out. Got his newest product. They're coming out with 17-pound joints.", "8HTyvxSTRIY": "[Music] we now return to Jeremy Piven as The Incredible Hulk you wouldn't like me when I'm angry I don't like you now", "kK9aegsa-QE": "what up YouTube ish avoid dnt back here with another video and today I got something special for you guys even some special for me right into my buddy and he was smoking a cigarette which I thought was a cigarette but it was actually a joint and he pulled out this pack and he said I can have the last one in here now the reason why I'm doing this video with just only one in here is because I've never seen these and these things look extra cool alright let's just get into it so it's a pack of marijuana cigarettes from a company called Lowell probably butchering the pronunciation Lowell smokes Lowell smokes from the company called Lowell smokes says right here Lowell Lowell herb Cove natural art of Kota this existed 1909 natural arts day Cooper I don't know what that means but it looks cool look at this look at this cow look at this cow with human light fingers has himself kind of like a suit licking thing I guess something you would wear in front see some mountains in his back it almost looks like that is like hysteria I and there's like another eye somewhere but that's his eye I'm gonna say I just kind of cooled it in this whole little package see what else it says there's a the powerhouse hybrid package 12:20 there's their handle the plugin Tara hill cannabis rural farms so they're here arm and blend the powerhouse hybrid and let's see the side side view is half ounce and 7 grams 1/2 ounce or I'm sorry quarter on quarter ounce 7 grams 14 all flour no trim no shake pre-rolled smokes quota ounce all inside this package looking pretty cool that's a side view see what this is hybrid a little holographic sticker this is hybrid on it on this side right in the middle this was big bunny top you there's a hybrid hybrid see I think it says certified certified authentic Lowell herbal code get that cool tower in the middle other side you there's the same thing on the own oh this has the government there's another little hybrid sticker governor warnings bottom pieces intensely strong and energizing euphoric and uplifting high sweetly sour lemon sweetly sour lemon flavor and aroma with an aroma with hints of mint lower fibers low farms and bold smokes cool the back the back says we grow our flowers with only organic fertilizer we never use synthetic pesticides we pay our farmers a proper living wage we use natural materials from seed to sale see the sale hybrid oh look at that this is the mix and blend that we have in here is 23 percent THC lutely 30 percent strawberry banana cultivated on 12 9 17 jeddah c bt 56 % got a CBD at 6 percent THC at twenty four point zero four percent then they got the 30 percent headband OG and 30 percent Wi-Fi ROG and 10 percent thinman headband coming at 28 point 28 percent THC CBD 0.5 11.04 CBG a cultivated 12 6 17 the other one a white flower coming in at 17 point 55 percent THC point to CBD point 42 c BG a cultivated 12 917 we've got 10 10 percent then mint you can make what makes the 408 coming in at 18 point nine four percent THC 0.4 percent CBD and I got a 1.9 Oh CBG a cultivated at 12 9 17 all of them mainly cultivated the beginning of December 2017 so it's not the freshest but you know this is amazing now these are already open so let's just go ahead and just continue what was happening already has a little spread of our story I'm gonna go ahead and just read this to you guys and the spring of 1909 William bull Lowell began growing what is called Indian hemp on his farm on the Central Coast of California Henry J finger took a dislike to Bulls marijuana being smoked by the wrong kinds of people I guess it's in parentheses marijuana being smoked by the wrong kinds of people finger conspired to outlaw cannabis and later passed the 1913 poison act ball believed in a man right to smoke the dried plant and enjoy its benefits Oh believed in man's right to smoke the dry plant and enjoy its benefits when the stubborn boy refused to stop growing his beloved plant fingers shut down Bulls farm and later threw him in jail oh no the guy who made these went to jail for selling this today our community and family today our community of family farms honor the great bolos tradition of growing cannabis naturally and with a deep love and respect for the plant little shoutouts to you your family you guys are amazing thank you for bringing this to us really awesome packaging you guys are professional you deserve everything you guys have all right this is a cool part handled it right there if you guys wanna check them out blow farms will smokes and little herb Co this is all legal check them out now let's go ahead and open this right off the bat that's cool they give you your own matches and these matches look pretty cool it says low herb Co and you just got two matches left these are pretty cool matches look at this little white tip with the green that's pretty cool pretty cool it even has a swimmer striking striking strip right here right there on top that is pretty amazing and if you keep going out comes this whole piece who grew it hashtag who grew it you know who did Bowl what is his last name hello my name is bolo and inside the packaging it just has like a picture it's just kind of folded into itself let's go ahead and put this right here we have this now we got the two matches and we have this little cool little picture that's just a flat to open up this and as you open it up not the cool picture right there crazy cop pull it open and there there you get your joints there are seven I have one got the hookup whoo-whee now this is cool for so many reasons but check it out they got the pre-roll in there got a filter this thing smells really amazing there you go guys now I'm gonna have you guys come outside with me so I can enjoy this with you guys check it out little farms you guys are amazing this places I mean these guys just crazy they even have like the in front right there it's pretty cool put up your issue boy DMT back here with another video and today as you guys seen a little bit before this right here I got the low smokes low smoke pack this is really cool to me and it's really sturdy like this is not no regular ass pack this thing is crazy so you guys are already seen how its prepared and packaged just gonna go ahead and pull it out light up dope low herb company Cheers just in case I need it oh good one more should do it low urge smokes y'all sorry for that sirens in the background guys I live in no they can't really do too much about it it's your boy doe put it out call it a video super sweet and I'm like an insane like it's maybe the smell but it tastes like some weed [Music] small companies you guys come through thank you guys for coming by for another video from your boy DMT like the video if you enjoyed about the video comment something you also want to see it in another video let me know let your boy know I'm here for you you guys have gift for me it's your boy DMT I don't care whatever you call me you guys in the next video", "pfFQbavoRGU": "hey guys my name's Barton and we're gonna do another video my sister here she is going to make me she's gonna put face paint on me and she's gonna make me look like Hulk so let's do it okay the green is done you look like Elphaba okay guys so a little bit weird but kind of cool I felt weird my sister did it and that's all for the video bye why do you look like", "0Yc-DeKUfRM": "[Music] all right everyone welcome back to another video or another brand new game video today we're going to be looking at the Incredible Hulk there it is the Incredible Hulk I guess what would you call this the the opening screen the screen essentially the screen so here is the screen of what the Incredible Hulk looks like this is for the PlayStation 3 2007 is when it was released by edge of time developed by edge of time which is the same people that are developing rise of the dark spark so I just want to check out how the game will play hopefully how it will play transformers rise of the dark spark by playing this game I mean if they're gonna have the same stuff same developer I'm pretty sure they might have the same type of you know gameplay alright you know quality so we're loading here see ya [Music] all right so this is the beginning of the game now we're gonna press Start we have no save file let's create one [Music] let's go into extras I like doing the extra stuff although we probably won't see anything here okay so movie secret characters uh this is gonna be cool classic ah we're gonna take a look at all of this stuff iron oh I mean Iron Man Hulkbuster alright so let's get out of there okay a really really a bit slow even getting out of there let's go into story all right you know what we might need to do something all right so it says press X to load I don't want to loot yet I want to say that we're gonna need to address the sound I mean I notice his roar really stunk I mean what I mean by stunk is that you couldn't hear anything you couldn't hear much I'm not sure if it's the sound or whatever buddy it wasn't good I think we're gonna need to adjust the sound so it's better hopefully it gets better anyways we're gonna have to go into setting that's all I'm trying to say [Music] my name is Bruce Banner I'm trying to stop a monster [Music] yeah [Music] a procedure [Music] [Music] all right we're gonna go through the tutorial but first again I was saying that we need to do the setting it isn't working out the music is too loud the dialogue is too low sound effects is a bit too loud can't really hear anything let's try this out is there a alright let's try that but I want to see if there is a fix for the visual I mean here's a sound but where's the visual I guess there's no visual fixing alright let's go alright actually we still need to fix that [Music] moving in holy cow go live go live how bullets are worthless go-go-go fan-out and neutralize the target taking them down back it up back it up take it down moving to a tax decision hey can we break this thing come on people all right this game is just like punching and punching so far I hope I hope they really improve over the years I mean it's been I don't know at least eight years right hopefully the new Transformers game will be good because right now I don't think he they'd even go over we can pick up stuff oh great well at least I figured that out what how can these guys sustain so many you know I don't know what I was using a baseball bat or something oh come on are you serious he's not throwing this he's some he's boy all right I guess you can throw it [Music] there's a gorilla or something loose in here all right so it says whole cos healing factor pressed down press hold triangle and Oh oh come on stop backstabbing me [Music] something attacked us in there general was not the gorilla and banner knows but he was I'm gonna find him I'm gonna put my foot in his throat and then I'm gonna ask him that was better you're gonna have to explain that statement sir banners work was a tangent of biotech that's our engineering solution banner was working on a biological one to improve the man instead of the equipment you telling me it becomes that thing at will I don't have to answer that soldier banner was brilliant one in a generation but he's a scientist you're not one of us no why not just take the data to someone else because he is the data as far as I'm concerned that man's whole body is property of the army [Music] I've gotten used to the brutality of the monster but there are times when he surprises me by reaching out and helping someone in need I both cherish and dread those moments because as much as I want to take credit for his good deeds I also have to take responsibility for his crimes alright looks like we're still in tutorial and somehow we're the hole instead of the human I also noticed this game follows the movie moving in all right goodbye supership ooh that's gotta hurt how do I climb up these buildings oh I'm actually crushing them whoops [Music] don't worry I'll save ya by punching you down goodbye where's the other shooter you know that was funny we went from a factory into the middle of the city all right so we're still in the tutorial jump and then pres oh oh okay this is how you climb it [Music] when I reach the ledge I will jump okay so far really hope that edge of reality has improved because I mean the cutscenes are really short I mean they are definitely cutscenes it feels like PlayStation 1 but then again this was made in 2007 what can I say I was like I think at least eight years ago about eight years ago I'll stop shooting our man is there a sniper on the other side or something oh there's a big now one of the things is you can't double punch that is stupid come on this is a hulk we're talking about you're telling me he can't double jump i mean double punch in the air his first theory whatever uh-oh all right our man is dying oh come on what hit us oh boy oh boy all right stick with our guy you know I'm just gonna throw you off all right what you need to do where is that fly helicopter all right you're going down or you're going up I don't know one of them well that didn't work well hey he's not dead don't like eat that oh man my head thanks for saving me name's Rick Jones whoa what was that are you okay I've been better I'm Bruce Bruce Banner dr. banner how do you know I can fill you in later but it has to do with the Enclave it's the brainchild of four scientists each with his own private army they use Manhattan as a giant test site the jokesters on the roof specialists in artificial intelligence that's morphed into mind-control I came across some stuff that I shouldn't have I know these guys have to be stopped whatever you were back there if I had you on my side it isn't on anyone's side he helped me right look I'm as good as dead on my own so if you wanted me to die you shouldn't always did the effort saved me in the first place how will I know if you're in trouble put this transmitter in your ear hopefully it'll survive your transformation where did you get this you'd be amazed at what you can find in places you shouldn't be looking at me watch your back by the way there's a large military presence in town I thought it was to deal with the Enclave but maybe they're after that big green Hulk Ross [Music] alright you know I pretty much I think that was the tutorial and that was it you know we're gonna move on with the next video it seems like we're gonna continue on playing trying to smash things but yeah I mean at least it nothing difficult is showing up right now I read the I just wish that the sound was better I think the sound isn't that great I'm not sure if its surround sound or something it's just not that great it's not like high quality but this is an old game I can't complain that much but yeah I mean that is Incredible Hulk Park one and we'll continue on with the Incredible Hulk part 2 in the next video", "LsW8QWaYXXw": "oh sorry about that hey watch it bye hon do again I see it watch it yeah no I'm saying I see it watch it yeah I'm sorry I say what yeah no sorry I see it I see it I yeah hey but you won't like it when I'm angry you making me angry", "ta_uz0r1erY": "hey guys what up son makes a bad line here Sonny's got right here we back playing mom still legends yes because we're back it's been long time playing monster legends yes it's been a long time we got this new update the premium pass has this is the premium you don't know what is the problem we do it's a VIP so so we going to travel home parent the Hulk okay did you remember the Hulk and this is called the dragon see game that people dragon and who doesn't do dry attachment and species is anyway because this is the in trouble the angry dragon this is the angry dragon you know he's like Bruce Baron after you beat him it's a 2d animation he's angry going to crazy turn to the Hulk it's not cool so that timid person we got possible I should add trying it see the Hulk just watch the game where I got beat up how yeah I know he's so funny you see that hi so yeah because [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause] hero like that door that is door here is Bruce Banner here's the hog here here oh yeah oh this is [Music] we'll get PA but I don't have Elizabeth be careful oh is this let the monster [Music] Oh [Music] [Music] [Applause] you will cross every wire you - so who it let's break it attack fire let's try and come up up mr. start we can spin it [Music] right it's a good one because he's skills a good one I'm going to Mordor hell with this robot is it a monster what the that's cursed to be a move right right yes beat now monster also I got arts night yeah I got all right finally I got him because he's the best my gaming me guess that's why I she was [Music] right - still [Applause] [Music] [Music] oh my god as it expects it [Music] first you need to get just happen don't hide okay I recognize that hey I don't see the big bar because I eat them like we got what the is that monster [Music] there's a Yeti oh my god [Music] [Applause] get this guy like water [Music] let's get bail get him knowledge knowledge yes yes oh my god [Music] so yeah Markham Strikeforce got new update there's a cottage awfully excited hertzel badass that's anyway I could see like to read are these right here you gotta fire you can be like man a fire [Music] [Music] [Music] [Music] all right go oh yeah wait oh yeah I've got [Music] [Music] let's tap this watch this guy's black it's like they easy he died tonight he can't back up foot in legendary monster play I'm going to change it [Music] [Music] all right this one [Music] being Sokka [Music] dead just like that often God [Music] [Applause] [Music] so just like that all right because we probably went into the monster [Applause] let's see what right she's just one what is look at this guy but it'll happen looking at boys he using this guy hey wait Dicky shadows Howdy's his dye update got a bear trap [Music] he forgot head of Defense's not using common monster used to legendary in any way [Music] all right why is it come on let's see let's Gary let's use let's use this one the team has a lot trophies we got use it shooting here this is Lobby this is a path favorite monster detector worse because he's a wolf character right thanks [Music] right so I go in here I die all right gasping joint here I can see the appeal up to legend make subscribe and never like and bought I talky guy [Music] [Applause] [Music] [Applause] [Music] [Applause] [Music] [Applause]", "bk8OgMyc15s": "you ready Cody you're gonna love this I'm gonna make it all the way to like 200 this is what I do most of my days making videos mm-hmm you got the glare of a superhero that's superhero is she glare from me all the way like 200 not yet we're almost done just be happy for me it's almost done my boy we're almost finished just be patient and happy this is only the greatest video you have never seen before from you all the way at 200 you got that mug look pop I look a pop I you know about my daughter no bomb i love the same thing they look the same same funny look that same", "Lar1basoJA4": "peace was going on YouTube today we're bringing you Bruce Banner Bruce Banner is a cross between oh gee Kush and Strawberry Diesel it's a sativa and it it really feels like a you know it is really he's got a nice amount of indica and you get a good body high off this also it's very good or as you can see it's heavily Tricon it's high in THC I don't know the percentages on it but it's very high in is very sticky very no dancer it's pretty good real good or beyond smell on this thing is a OG Kush type smell you know citrusy lemony it also has a very strong orange citrus taste to it you know immediate impact type herb here you hit it like once or twice you're gonna start feeling it in your head and the shoulders and stress relief it's very good for on depression anxiety PTSD relax you know muscle relaxation any type of tense stress type relief you're gonna love this herb right here for that type of treatment if you're able to pick it up I hope you can get it and try it out for yourself and then I'll leave you with some close-ups and help you see you again soon peace", "9TuJ20PXHXk": "brands on we don't know I am should I say you're like me", "qqRJv0YNbZ4": "all right let's give a little update irresistible organics here is that some hulks some g13 just put in there you got a little news deficiency but it's coming back already now so I just switched it over the ones already been in a flower and everything got some g13 super sour Diesel's blue waters over there Oh what you are and your yeah they're not actually looking too bad though go over here and look at the blue waters those are from our growing meds appreciate uh the clones you gave me you're looking real nice looking awfully frosty already just for just starting oh yeah I never can go them like I said these are just put in there looking good though so far nice and cool on air 66 kind of where I want it until next time guys hit that like button subscribe", "S7TPUVhH1c4": "[Music] dr. banner now might be a really good time for you to be worthy thus my secret cut I'm always worthy [Music] [Music] Thunder Hulk smash [Music] [Music]", "ZlkeWMwBZCE": "actually my father's going after Betty what makes you think you could go behind my back and get Ross to cut me out why is it so low you pathetic freak who doesn't do two hours for yourself I can state the obvious something tells me [Music] [Music] [Music] [Music] [Music]", "mKrqfPOIWSU": "yeah you guys go out there up your pre-roll game if you get it in a cardboard box and it's uh they're dry grab yourself a pack case throw above it in there let it sit for 24 hours your experience will be completely different than smoking a dry pre-roll nobody wants to do that anymore so let's let's change that welcome everybody this is anthony with boveda joined today by cody ziering with pac case how the hell are you buddy i'm good i'm good i'm coming off vacation so i'm still uh still a little bit of vacation mode um which is always a fun little area to be in no doubt uh best part about vacation is on the way their worst part of vacation is coming back to the office and seeing 18 000 emails waiting for you it happens all the time i know yeah so it's just been pitchforking out of that but um things are good yeah there's a lot going on here a lot of things to talk about today absolutely industry's booming boveda is booming pack cases booming let's get to it where do you want to start i mean you want to start with i guess how we kind of ran into each other years ago yeah absolutely this has been a long time coming no doubt um where was that i think mj biz vegas 2017 maybe yeah okay um yeah you guys what launched in 2016. just about yeah we uh we we came up with the idea very very early on like january 2nd 2016 we were still working for a vertically integrated cannabis company right near aspen colorado great experience gave us great insight into the industry and really what the cannabis market kind of demands uh and everything has come from there it was like it was one of my first very first trade shows i think when i walked over and saw you guys um it was a funny story we we bumped into you uh quite literally um saw your shirt and were like oh we know bobito we love that and we just started talking with you brett and i actually got invited brett's my business partner everybody in case uh nobody nobody knew that uh brettgelfan shout out to you buddy um brett and i actually went to that convention for free the cannabis company had purchased tickets for us and we had left before the show happened so we got to go on their dime and you know that's kind of when our world turned around and how did you how did you guys get into the space again um what was your background before pack case funny funny story uh i was working tech i was uh working for apple at the time i was an engineer um doing some annoying stuff on the phones with in between customers and engineering kind of realized that uh corporate life wasn't for me i needed a change and i was helping brett work on some website for some cannabis company uh two weeks later he said hey we need a director of marketing are you interested i jumped on the opportunities like all right we'll pack your stuff and get to colorado next month uh time to start so went out there a little bit of nepotism uh brett's uh brett's dad my dad and the guy that hired us have all been friends for 30 35 years i guess he wanted some smart cheap labor at the time and that's uh kind of how we got our invitation but a few months later unfortunately he got sick and it put brett and i in a position where we were running the show uh in our young 20s which is absurd to put 20 year olds in charge of a 15 million cannabis company but hey you know you got to do what you got to do in business it sure is yeah we have a similar story too um you know i want to hear it how did you get started please yeah no i was i was in tech as well like straight out of college um under the fluorescent lights in a cube sea of cubes and i was like oh yes i'm getting out of school i'm gonna you know work and sell stuff and pay off my loans and you know it's a big fortune 500 company and uh after about a year and a half you know i was going through started out as like uh you know basically a quote guy you know early on learning the sales process and then moved through quickly but i know i wanted to to sell and to really own accounts and quarterback stuff and i talked to my boss and he's like well that's probably eight to ten years away for you and so i'm like oh i can be patient but uh not that patient [Laughter] and uh yeah luckily family friends um one of my family friends lived down the street from my cousin again nepotism here lucky right place right time but um kate holstein who's in charge of our international business she's been uh she actually got me to sidetrack even more she got me my first job um working like as a banquet server at weddings and so i've just i've known her since i was a kid basically and she's like hey i worked this company boveda and um now we make these humidity control packs we're in the cannabis space we're in the tobacco market and we're in the music industry and i heard those three things i said cool i mean yeah i'm in so i interviewed with them long story short um you know as employee number 12 and i think we're over 65 now and that was just four and a half years ago so um really fun fun place to work similar stories here we're basically um very similar in what we do our products and our services are very complementary to the things we're trying to address here to the cannabis industry 100 peanut butter and jelly uh especially for for pre-rolls we make something that's uh great for protecting them and you guys make sure that they stay fresh and tasty for as long as absolutely possible longer than most thought would be possible exactly so anthony i mean we've been talking we've known each other for a long time but really i don't know the the story behind boveda how how did that come about what is it like tell everybody what bovita is yeah so um it's a really simple product and that's that's what uh that's what we like most about it but it's very effective and it works pretty well um it started 25 years ago a couple of guys in the tobacco business they were cigar smokers saw a problem with uh humidification one-way humidification for regulators for cigar humidors um they said there's got to be a better way to do this so they worked um with a couple of engineers from general mills here in minnesota on coming up with a product that's able to basically self-control it's not you you don't have to add anything to it um and it's a two-way controller so in a deficit environment it'll add humidity and then when there's not enough it'll or when there's too much it'll it'll absorb some too so it's it's really getting rid of those peaks and hills and valleys of humidity um and so that that technology started for the like i said for the the cigars and tobacco business and then over time and we i'm sure this has been talked about on many of our other podcasts but um you know we started seeing these tobacco stores uh selling a lot of products in northern california um to the traditional market and um there's like wow there's there's a demand for this on the cannabis space too and that was probably 10 12 years ago now um and so we came up with our our 62 formula and um you know from there the the technology has really stayed the same but we've been finding out more about how this technology can um you know not just protect weight and help you know manage the moisture content or water activity but to also preserve terpenes and trichome integrity so it's been fun to to watch how it's how it's grown and what we've learned um that's that's really fun there's a huge feast of thought culture here feast of learning love of learning um that's that's something that's at our very core um and we have a lab down in um the basement of our hq here where a lot of these tests are being ran we have a lot of partners um different labs across the states and even internationally that help run tests and it's it's really cool uh so yeah that's you know it's a bit of a ramble there but that's uh no it it it sounds super cool i mean we did we've we've been doing r d on our products for four years you know always trying to come up with new stuff but we just have to make a really interesting design and make sure it's structurally integral you guys you have to do some chemical engineering which i can only imagine just ups the level of difficulty by you know to the umpteenth degree so good for you guys it's great that you guys can do everything downstairs and run humidity tests and i know that's a great segue into what we'll we'll talk about next because you can't really run a humidity test without measuring what you're trying to contain the humidity within uh which kind of leads me on to what we do over a pack case and we make these really amazing joint cases this is one of our awesome hemp clients father obsidian but check this out we call this product a jpeg it's our flagship so you'll notice inside this is what's amazing to bovida and everyone who uses it there's a gasket seal that lines the actual case to hold five payrolls um so when you close it you can actually hear the click that's how you know it's sealed and then our favorite part not so boveda is central but we have a extra little place that you can store roaches so you can't finish a joint you don't want to stink up the rest of uh the fresh ones inside the pack that was a really cool idea um so as we were developing this the whole reason we put a gasket in there was to make sure that pre-rolls stayed fresh unfortunately in this industry the pre-roll has been an underutilized product skew for so long such an easy product to produce it's something that from a beginner to an intermediate to a super heady everyone loves smoking joints everyone loves smoking bloods and when we first got in the industry back in 2016 everyone was just taking trim that shitty extra leftover whatever stuffing in a pre-roll and saying okay good enough today now it's totally different story people use only flower premium everything sometimes they're even caviar which means that they may have a core with some hash or are wrapped with some keef and some extra little bits on the outside and can exceed retail values of over 50 bucks in fact last time i was in vegas at the show we went to a dispensary planet 13 and they were selling a can of cigar for a thousand dollars uh so the pre-roll game has totally evolved now think about this anthony what would what would you do if you went out you bought a blood that was a thousand dollars and it was dry i would immediately want to return it right and can you probably not probably not so products like that have to be in something that's airtight and gasket sealed and if you're doing it the right way you have a bill vita pack in there as well yeah no doubt um you you brought up some really interesting stuff cody um do you mind expanding a little bit on how you've seen um you know we're we're more on the you know we certainly work with a lot of companies that manufacture pre-rolls um but also you know people that are just packaging grams or eighths or quarters or ounces or pounds um but it seems you know i mean you guys have a focus on pre-rolls do you want to elaborate on how that's changed throughout like the last four or five years um you know going into this more premium stuff versus just the consumable hey you know the dispensary is running a deal and you get a free pre-roll and it's kind of just like everyone expects oh it's it's probably gonna be dry it's probably not gonna taste very good but i mean how is it where is it changed and where is it changing where is it going yeah absolutely like i had said before when we first got into it no one really cared they just took a pre-roll they were sometimes even making them in the dispensary with leftover whatever after bagging out you know an eighth for a customer there's maybe another gram or two in the jar so the manager said screw it let's grind it up throw it in some pre-rolls and now we can sell it today the pre-roll is a main sku in the industry i think it accounts for maybe 10 15 20 somewhere in there depending on the month of total cannabis sales in the entire country so clearly they're here to stay and it's a product that people love so very quickly back in 2016 and 17 when we were starting pack case we realized that the pre-roll was super underutilized it wasn't really given the appreciation that it should have i mean it's a top level sku it's a real money maker and it doesn't take a lot of money to actually start producing them so we created our product because there wasn't any premium offerings like i said everyone was just throwing [ __ ] in a tube and or a bag and that was it there really wasn't like a uh a big demand for people asking for quality pre-rolls and we didn't understand that because as pre-roll enthusiasts someone who we smoke joints all the time especially when we went skiing or out for hikes or whatever joints are the way to go um no one really had anything that was nice or worth talking about bringing home so instead we just buy flour and roll our own but it left a huge amount of market opportunity for all these cannabis companies who weren't doing something to make a premium sku that addresses a huge market need so there was an incredible amount of demand and no supply whatsoever and that's where pac case came in to fill the gap and give opportunities to companies like this to be able to sell a premium pre-roll so was pac case kind of born on the mountain per se it's funny uh we quickly came up with the idea late at night uh the second night that brett and i had ever met um just because we were talking about going skiing and taking joints before we ever had a prototype uh i had actually uh three or four joints like in my chest pocket um took a little kicker while i was skiing and totally yard sale ate [ __ ] skis went flying worst part though uh i was kind of hurt and the joints were all broken so not only was i like in pain i couldn't smoke so it was it was rough so brett and i very quickly jumped on finding someone to help us out with the design and we quite literally used our prototype our very first one which i have right here super basic shitty design but uh this i used for an entire winter to hold pre-rolls and make sure that they wouldn't break so connor was uh was born out of uh two things a we needed a person we had a personal need we needed to be able to carry joints on the mountain or going for hikes or wherever uh and at the same time we knew that the cannabis market needed it too so it was a little bit of a selfish uh build it was kind of doing it for us and then realized there was a business behind it too that's that's exactly it though i mean that's how great products and ideas are born what's what's uh what's a problem i'm facing in my world today like some broken pre-rolls and then you know there's gonna be thousands of other people that have the same problem so cool stuff i've always loved your guys products um and you guys um you have your your five pack obviously what's what's more of your consumer facing um your duo right do you have you don't have a single though because who's gonna smoke a single joint i mean you're always gonna have one for a buddy so you would think that we uh we do have a we may or may not i cannot confirm or deny that we have a single in the works um but it won't be ready for a while if in fact we're working on something uh really though like one is never enough right like two is always better than one three is better than two and [ __ ] if you can have five will have five um so it's it's what's most amazing and what i find most interesting about our product and why it it works so well on both sides of the aisle um it's a packaging product it was always developed to be a packaging product and whole allow cannabis companies to sell pre-rolls but over the course of a year or two as we were our social media was growing and people were starting to find out about what we were doing people started asking for these just like hey i don't live in a cannabis state how do i get one um so we put them up on amazon and let it ride and uh two years later we've sold you know more than 50 000 units and are absolutely crushing a thousand reviews which blows my mind and we have over four and a half stars which on a product intended for packaging that gets sold as an accessory yeah blows my mind every time 100 and um one thing that i've always loved about your guys product is that um you know you can you can customize it um you know the the business can go put their branding on it and customize it however they want um that's a huge thing especially up in canada and some other markets that um you know they can't necessarily advertise or brand do you have any experience there um helping companies really market their brand with your guys packaging technology i'm glad that you asked that anthony pack case technically is a packaging company right that's the product that we sell but really when you get down to things we consider ourselves a marketing company we give our clients an ability to brand and promote products in ways that they wouldn't be able to before our packaging may be slightly more expensive than everyone else on the market but that's obviously because it's a premium feel what other packaging can go out and say hey i sell for 20 on amazon but instead you can come to my dispensary take five of my best highest quality joints with delicious flour have my brand on it and then now go and walk around with it so we give these companies not just an opportunity to create beautiful packaging that's going to create an amazing customer experience but we also allow their customers to then become a walking advertisement for their company think about it you buy a jpack from somebody that means you have five joints so you take one joint out to smoke with a friend well you're obviously gonna close the pack put it back in your pocket again you still have four left so you're gonna hold on to the packaging for a long time which means anytime you smoke with somebody and you take that out your brand as a company gets exposed to their friend who's now likely to become a customer their self themselves yeah well and let's let's back up to a second so let's talk about um the premium aspect so and what that value can can mean not only to a business but to the consumer so your guys you go i mean let's and we can even back up to that leap down study that we helped you guys do so that by let's explain this to the the people so yeah boba can take uh packaging and put it into a um a dry chamber put above the pack in there and then we can basically estimate the shelf life or stability how long the boba packs can last how long the product is going to stay fresh um versus no active humidity control versus having a boat pack in there and then we can compare that um against the control and give you hey this is going gonna you know add an extra week two weeks a month some cases um let's should we chat about uh how that went and what that kind of means for brands and consumers as far as you know brands are gonna be able to go into more inventory and that's something that we've seen on on the boveda side is um you know a big concern or a big problem facing a lot of these operators was hey we're just trying to get product on the shelf because the supply and demand chart is totally kitty wampus and you know we've had cultivators operators say we're we're trying to like they're torn especially these commercial ones because they want to have a longer cure on their their flower and they wanna couldn't really control that quality um but then they have um people in the supply chain saying hey this dispensary's been out of said strain this amount of flour for x amount of days and like we just we need to get on the shelf it's just flying off the shelf that we have seen as i have seen personally that's kind of slowing down and people are able to go into more inventory and carry more um but our products together can help assure that that shelf life is there and so product isn't sitting for two three months and then it's sold dry that's one of the benefits of being able to use pack case and boveda together um these operators who you know think about it if you have a production team of 10 well you don't necessarily want to have two people doing pre-rolls and two people doing edibles and spread out your labor force a lot of the times it's more efficient and our clients have told us this that you know i want to put my entire production team have them do an entire run start to finish bang it out and then move on to the next project now when you do that with flour with pre-roll with something that's not necessarily super shelf stable like a concentrate or an edible you have to have velocity so not only do you have to package it up quickly you have to get it out the door you have to get it to the dispensary they have to shelve it and then they have to get it out to the consumer now that process can take a lot longer than it would take a cannabis to dehumidify and then dry out lose terpenes lose flavor lose potency and mess with um with effects right like if uh some thc converts into cbd that flower that you smoke once it's converted is gonna make you feel totally different than if it didn't exactly so with boveda and pack case because they're such a tremendous seal these producers have the ability to make an entire run of pre-rolls leave them in their factory if they have to and as long as it's properly sealed and the boveda pack is fresh these pre-rolls are going to last a lot longer which means that their production problems that come along with having to do massive runs and then making it like sit on it as opposed to doing smaller runs and moving them quicker and making a regular process makes life a lot easier for them they can sit down bang out all of their pre-rolls that they need for a month and two days and then not have to worry about the quality at all because of the protection that pacquiao boveda provides yeah and a term that comes to mind that i hear a lot is consistency um and that's that's what a lot these brands want to deliver because they know in a lot of these markets especially on the east coast where i've been working predominantly it's medicine so uh you know it's if you can the cannabis plant in the flower is not a it's not a pill and it's very volatile and so like you said um you start getting that trichome degradation and you're gonna lose medicinal benefits um and it's like you know going to get your prescription and your short your short two pills and there's an extra one magical pill tossed in there you know it's like you you want to make sure that the product is consistent and delivered same same smell same taste same flavor same effect every time and uh yeah i think i think our our two products definitely can help um in that in that regard absolutely cannabis obviously is a product that affects headspace and if you find something that works for you and you find something that you like you want to make sure that if you buy it again it's going to have the same exact effect uh there's only one way to do that in terms of flour and pre-rolls and that's control the humidity making sure that the product stays the same on day one as it is on day 30 and potentially even out to day 60s so it's important i know that a lot of people that consume cannabis for medical reasons um which there are many that's how this whole industry really started right um they need that they need consistency of dose they need consistency of effect and you can only do that by controlling terpene and humidity content right yup yup there's no doubt about that and then um you know let's another thing that i've been seeing um and sorry this is so salesy just because that's the world that i live in every day is just sales but um you know competition between brands um i i like to think of the cannabis industry as a more friendly um competition uh than any than any other industry that i've been in or or seen where it's you know really we're we're all in this together with one common goal and that's to bring uh relief to a lot of people and liberty to a lot of people um to do what they want with their lives consume what they want and um just not step on anyone else's toes but competition on shelf space um is the pack case boveda combo is that something that people can use to set their their brands apart from others is that can you take these these two common value adds and educate the consumer to say hey i'm gonna my pre-rolls are gonna probably be better in here by the time i get them depending on when they were packaged and you know i'm gonna have an extra two three weeks to go through these um with the boveda pack and then you know i have the pack case forever um these are these are things that consumers care about and are gonna want is that messaging from the consumer is that getting driven to these brands that are making these decisions on packaging yet it's a good question some of the brands who really have a premium focus and a premium attention absolutely they understand that their customers keep coming back to them because their products are so good some of the there's a lot of a lot unfortunate but there's a lot of cannabis companies out there that really don't cater to a premium market um and don't really care about the quality of their products um you know like i said a lot of them are still back in the model of 2016. let's take any leftover [ __ ] that we have let's toss it in a pre-roll put it in the doob tube and just send it whatever happens happens i don't know about you but whenever i consume something that affects headspace uh alcohol cannabis whatever else it may be i always want to make sure that i'm getting something that's quality and consistent um price isn't so much uh a concern of mine right i would much rather pay an extra 20 or 30 bucks to know that uh the quality that i'm getting is there versus having to deal with some [ __ ] for a much cheaper cost i believe that if you're gonna intake something it should only be the the best quality you know it's affecting you like you as yourself not a car not a house you and your health so for me as a consumer i always want to make sure i'm getting high quality and i think that there's a lot of companies that value my sentiment and cater towards a client like me when you have a customer that doesn't you end up with shitty product and that creates a negative loop sure you're going to get the sale once or twice because it's a cheap product but i doubt that person's coming back to you there's no consistency there's no flavor it's all dry harsh smoke it's no good no one likes that yeah and that's i think that's changing too i think as more people get introduced to cannabis i mean we talk about all these people taking baby steps i mean i was down in in florida i had a dispensary doing a visit and i i witnessed what i always knew was going on down there but never had witness for myself which was a woman that looked just like my grandma going into a dispensary for the first time and she has all of her paperwork and she looks at the the person at the front desk and she's kind of you know pretty coy and her her husband's behind her um you know they're just kind of looking around and she goes i'm here to um purchase some marijuana it's so cool to see that but there's so many people that need to be become educated on you know multiple different aspects of cannabis um but it's there's so many new people coming into it and uh that's that's a that's a big piece of the education piece and you know knowing what you're consuming how it's gonna make you feel um you know what you like essentially there are a lot of people figuring out what they like and um you know here in minnesota it's tough for me uh because we don't have um you know like we don't have adult use here so i can't just go in and say hey you know i'm wanting this today and that's uh that's something that a lot of new states are having which is is great um and uh sorry i kind of lost my train of thought here it's all good those are those were always my fate when when i was back at the cannabis company those are always my favorite people you know there were times and days where you know as just a higher level employee at the company uh the dispensary was short-handed so i'd have to go in there and maybe put a quick shift in and just talk to cool people about wheat all day it was honestly not a bad way to uh spend a couple hours outside of my normal role my favorite customers were always the older folks who really had never id any idea they'd walk in they'd always be like hey can i like can i buy some weed yeah and it's like you don't have to whisper it's legal welcome to the cannabis store let me show you what what are you what are you interested in what would you like to try are you interested in smoking something would you like to vape something would you like to try an edible it's always great introducing those people to the entire world something that as an enthusiast we've been living for decades right but i don't want to date myself but [ __ ] it's been a long time um yeah it's it's it's remarkable the clearly the direction of the country the world is totally changing our neighbors up to the north were a lot smarter than we were legalized a lot quicker and look what happened now they have five or six companies in cannabis worth over a billion dollars you ever think that there'd be a unicorn in cannabis now there's five it's insane yep ellen what do you think is i mean comparing the canada to the u.s right now um especially these last couple weeks um just these these larger operators and what what is that what does this mean for cannabis in 2021 um as far as these these bigger companies you know that and you know four or five years ago in the grassroots cannabis movement semi grassroots cannabis movement um you know a lot of it was the the buzz around trade shows in the industry was all these you know these big companies are gonna come in and they're gonna start getting swooped up and the commercialization does cannabis in your opinion cody does it kind of model what happened uh recently this last decade with beer craft beer and you know your big domestic beer is there gonna be a commercial side of cannabis and then also room for the craft cultivator um that's really focused on small quality good stuff um that's gonna be competing against you know price and volume from some of these giants that's a great question the beer model is one that is perfect to use as an analogy um i think myself a lot of these major cannabis companies are swooping up a lot of the smaller ones there's a lot of conglomeration that's going on in the industry obviously when you kind of grow as a company or you want to expand you either need additional growth space which requires additional licensing so a lot of the small guys or the guys that were in quickly did some decent growing started as a startup and made it to mid-sized company those are ideal acquisition targets for the big boys so i think what's going to happen at least the next three four years is that all the big boys are going to start to swoop up a lot of the smaller guys that's where you emerge the budweiser the coors light all the the general high volume lower quality lower price type products from that will come the grassroots movement again so i think everything is going to kind of go underground for a little while and all these craft companies in maybe three four years will start to emerge when people really care about quality and it's not so much about bottom dollar anymore yeah we have a huge canadian client that we love working with when we first started with them they had a huge huge initiative and focus on innovation it was 2018 they had an opportunity to really try and control the market with an innovative awesome product uh cost was no object they said [ __ ] it we want the coolest best highest quality product that we can provide and it worked out great for them they quickly jumped into one of the leaders positions in the industry in canada and everything was was great it towards the end of 2019 and then with uh early covid uh early 2020 uh their share price fell dramatically they were you know their balance sheets showed that they were just outlaying cash left and right for the innovation without necessarily realizing that when you spend so much on innovation it takes a long time for it to come back right roi on innovation is a year year and a half process minimum for us for example you know we started designing jpeg trio in 2018 it didn't get launched until you know mid 2019 it took 12 16 months 18 months to get the product out there so with this cannabis company even though they were so amazingly focused on innovation for the first part once legalization happened now they realize that it's all about bottom dollar and how do we reduce cost of goods so now instead of trying to produce flowers that may be tastier but take an extra two weeks now they're producing lower quality genetics that harvest faster that they can just turn around and sell and cheaper packaging and i think that's now the start of where you see the the budweiser and the the coors lights versus like uh you know a small batch brewing company really focused on delivering a delicious tasty product i mean one has consistency one has flavor yup but you know which would you prefer to drink budweiser or the the local craft beer pretty easy decision in my opinion yeah well for me too it's a time and place thing sometimes uh you know being from minnesota and uh going up to the cabin a busch light just kind of brings you back you know i love those you mean can't hate on that i'm a big coors guy i went to school in colorado spent a few years in co i love course especially like any tailgate absolutely but then you know you're trying to drink 16 18 beers potentially and really have yourself an afternoon that's not so much the case when you're drinking something that's a little bit tastier and perhaps next to a steak and maybe you're gonna have one or two very different days though the pairing is everything bingo and the season two i'm a big seasoned guy when it comes to those things absolutely you brought up uh i don't know how much time we have here ramsay um but you brought up uh kovid um how do you think that's been um impacting i guess pros and cons um your guys customers people you've been working with um you know if i can touch briefly i can just say what i've noticed is um i think a lot of these quality things sops standard practices best practices a lot of these procedural things are starting to really get drilled into um on paper and people are starting to like really figure their their [ __ ] out um and that's i think making a little bit extra room for products and services that focus on true value-add and um you know roi that you know we can bovada specifically too can can really tell you hey your flower your inventory your entire inventory weighs this today um and here's the percent moisture content um if you added two percent moisture content to that entire inventory here's the literal change in fair market value of your inventory i think those things now it's not it's not everything's not moving so fast where it's hey package it get it you know it doesn't matter if it cures on the shelf whatever we just we got to get it in stores because we don't have any and people are buying it anyway um i think covid kind of or the lockdown specifically um kind of help people really look at their what they're doing their day-to-day operations and where they can make changes have you guys noticed that too absolutely it gave you know business operators a chance to sit back and not be surrounded by the buzz of a hopping office and they actually had a few moments to think about like hey what can we do better what can we do to improve like our everything our process is top to bottom from growing the production of packaging to sales yeah um what's interesting is that you know this is what makes me happy is that a lot of the country deemed cannabis in a central industry um okay would you ever have been able to imagine that 10 years ago probably not i mean even back in 2014 but government said hey people need cannabis especially in california and all the cannabis companies stayed open so i think having those cannabis restrictions that got imposed on everybody required all these business operators to really sit back and understand how can we do things more efficiently because [ __ ] i used to run my growing operation with 40 people well now i can only have 15 in the building so how are we still going to manage the same output but with less than half of the labor staff forces you to sit back and really think about what you're doing and if you guys are cutting short you know corners trying to take a shortcut when that's not necessarily the best thing to do or neces or even necessary you know small little changes in process like adding a movita pack into your curing box can potentially generate an extra 300 000 a year for a mid-sized cannabis company it's substantial and that tiny little you know how much could that really end up costing you a couple thousand dollars over the course of a year when you can end up you know that can let you back a couple hundred thousand so a lot of these guys with cannabis you just you've been running and like you you ever try and get on a treadmill when it's set at 10 you there's no warm-up time you just have to get down and start sprinting yeah college a couple times yeah i'm not sure if those ended well but that's that's what working in a cannabis company is like the moment that your product goes out the door for the first time it's off to the races you have now an endless uh endless demand for your product and you have to continuously handle that that with good supply um and they don't haven't had a lot of time to think about it as soon as they got on that treadmill it's just off to the races full sprint covent gave them a chance to sit back take a second step off the treadmill and try and figure out what they should actually be doing yeah i completely agree um definitely notice that as well on our end um all right cody uh what's next for paccase great question we have a couple cool new packaging products coming out but that's not really what what tickles me i get very excited about the consumer market i love bringing products to people that will actually use it so we have a really awesome new case that should be launching the next five six months uh think jpac an iphone had a baby that's about all i can touch on it yeah well that's uh that's intriguing um because i think i think i know where that's going um don't wanna don't want to speculate too much but um and where can you pick these up so i know you said amazon um i know you guys have uh point of purchase displays too so i'm assuming that it's this is getting into more mass retail absolutely yeah we uh we sell in a couple different places you can go out and check uh jpac products out on amazon number one uh our shopping website packcase.com i'm sorry packcase.shop you can get there from packcase.com as well um and now they're we're starting to be available in retailers so there's a whole bunch of distributors starting to pick these up so you should start seeing them in retail stores over the next few months and if you're a retailer and interested in picking up our products we have a wonderful wholesale section on paccase.shop so make sure to stop there put in a little vendor request and we'll make sure to get to you so you guys can start selling pack cases yourself cool cool yeah same thing for boveda um we're on amazon we're in the retail stores uh we have a direct site businesses we have a wholesale site too um yeah you guys go out there up your pre-roll game if you get it in a cardboard box and it's uh they're dry grab yourself a pack case throw above it in there let it sit for 24 hours your experience will be completely different than smoking a dry pre-roll nobody wants to do that anymore so let's change that [Music] you", "h43FBW9SqhY": "all right hey guys welcome back to my channel so today we just wanted to show you a video on how to use the buddies bump box we use this out the facility that we're at we use this to make pre-rolls and then we also do use this machine over here the rocketbox to also make them but yeah Jim will show you today how to use it put them in each individual hole simple these are actually one size too big so they do stick out a little bit but normally they would sit flush at the bottom like that so when you want to go in and fill your box with product come over here do this you'll end up shaking it like this bump it exactly what its name is for come back to this bottom piece this will then actually lift your pre rolls when they're done so you're pretty well filled just give it a nice little shake and then twist and you got a pre-roll so you guys I hope you enjoyed the video on how to use the bump box and how to make your own at home pre rose", "tYj58WpPKEY": "you know for a man who's supposed to be\navoiding stress you picked a hell of a place to settle it's good to meet you\ndr. banner your work on antielectron collisions is unparalleled and I'm a\nhuge fan of the way you lose control and turn into an enormous green rage monster\nI read all about your accident that much gamma exposure should have killed are you here to kill me miss Romanoff because that's not gonna work out for\neveryone so you're saying that the Hulk the other guy saved my life I know\nyou're angry no we're way past that I could choke the life out of you and\nnever change a shade avoiding stress isn't the secret and what is it you want\nto know my secret agent Romanoff you want to know how I stay calm Bruce you gotta fight this is just what loki wants, your monster. oh no you brought the monster you're gonna be okay i swear on my life I would get you out of this you will walk away never ever, YOUR LIFE!!! stop lying to\nme you needed to kill me but you can't i know I tried I don't get a suit of armour I'm exposed like a nerve it's a nightmare i didnt see an end so I\nput a bullet in my mouth and the other guy spit it out\nyou know bio organics better than anyone there's no one that knows gamma\nradiation like you do we are gonna need a really big brain so\nfury is not after the monster now might be a really good time for you to get angry you wanted to know who I am that's my secret i am always angry youre stronger you're smarter you're Bruce banner hulk smash we are not your enemies banner, try to think the world just saw the Hulk the real Hulk for the first time where can I go where in the world am i not a threat\nyou're not a threat to me you sure how long before you trust me it's not\nyou that i trust i can't have this, kids do the math i physically can't neither can i , our fight is over so we just\ndisappear, we disappear hey big guy Suns getting real low how's nat she's not coming back we have to make it worth it we have to\nwhat about sokovia, the city sokovia did we save it , Banner\nlisten  sokovia Ultron that was two years ago what are you saying I've been Hulk for\ntwo years for years I've been treating the hulk like a some kind of disease\nsomething to get rid of  but then I started looking at him as the cure alright!! the\ngloves ready question is who's gonna snap the frickin\nfingers, it got to be me many a could survive , how do we know you will , the radiations mostly gamma its like I was made for this I'm counting on you bruce we all are you know I tried when I had the gauntlet,\nthe stones I really tried to bring her back I miss her man me too", "0VYRtuX5ItY": "smelling good go give up your ass give him your asses sacrifice to take me do me in the ass let's do it do it make it quick make it quick just take it just check against come come slowly come slowly come on deep inside care but come on almost there oh yeah Oh God oh yes oh yeah yes oh yes that's it yes I succumb to you I succumb to you yes Oh wonderful oh he likes it he likes it he loves it yes so go deeper go deeper yeah just take it take it take it", "xryp_onLDUg": "hey sir what ah I'm going to tie you up and choke you there are we're doing oh you was happy noises I string green oh me angry where is this why are you pulling me from turning into some oysters [Music] [Music] no why do you see a bear [Music] [Music] [Music] [Music] I'm dead wonderful that guy died subscribe to my channel I'm yoke well like a turn to it but thank you", "NEWAbeBRMSM": "[Music] [Applause] [Music] [Music] [Applause] [Music] [Music] [Music] [Music]", "KZghGusfm4M": "all right let's do prd2 trust farm with four operators you're gonna need silver ash for skill ao igari silencing her drone and push specialist let's go i'm gonna start a new theory of random stage trust farm because sometimes i just need more time to edit videos and i need to post something you know silver ashy i'm just going to talk a little bit about the upcoming archmage event which is called rewinding breeze it's the event with a third hair how do you say her name s-u-r-t-r certain silence over here i think that's how you say it sir turn yeah yeah it's an event with certain spanner and we got one we got three more operators one is for the event milestone her name is meant she's a caster not sure if she's go target or aoe probably single target why do we keep getting casters like we just got to mimi and i thought i would grow her but maybe i'll grow men's and she looked cuter sorry another one what's her name i really like her too she's a bunny girl we love bunnies i actually don't remember her name another operator for the banner is a four star his name is arlene arlene i don't know how to say his name but he's not too exciting i already got a lot of husbandos so i don't heal your av bed so i don't really need anymore just right now i just got phantom and i love him and yeah oh god what is her name you broke out more the bunny girl she's so cute april her name is april i'm pretty sure her name is april yeah so nail operators certain use broker skills are your aoe cards no operators are serder april are our lane arlene are lane i guess and so yeah just a little bit about that danielle our next one that's coming in two days but that's a little bit of video for you guys and make sure to like and subscribe if you want to see more artwork guides that i make and bye", "0Gw2uDLL674": "hey guys MRA back again with a really quick review I'm in the middle of cleaning up my mess after that earthquake but this just came in the mail today I never did a review on my Hot Toys 1/6 scale Hulk there's a lot of reviews out there but what's special about this is I ordered this new head sculpt from Hong Kong it's a custom-made head sculpt it's nothing official and basically the original head looks like this and for those of you who are interested you can see the paint color at least on the one I got is pretty close pretty similar so it looks pretty good because in some pictures it looks a little too green and sometimes in some of the images I've seen on eBay which is where I purchased this head sculpt the eyes looked a little off they looked kind of wonky but luckily mine looks pretty good looks I'm pretty satisfied but you don't have the peers eye system like the hot toys Hulk does if you have no idea what I'm talking about you're not a hot toys collector or you don't have the Hulk air or any of the other hot toys figures the peer system basically allows you to manipulate the eyes so here we have individual you know the joystick thingies so you can manipulate the eyes but again back to the head does most of you guys are interested in that okay looks like this is by qy toys and this is the amazing packaging that it comes in it's just really well done it's it's an excellent quality plastic bag with a zip block on top and it comes with a sticker there of the head sculpt you're getting so yeah I'm being a little sarcastic guys again let me give you guys a good shot Mia try to put the hair back on this Oh doing this with one hand so sorry guys uh there we go sorry sorry sorry but there you go comparison shot give you guys some different views and I'm gonna need this head sculpt because I'm basically getting another home pretty soon and I ordered the Bruce Banner and Hulk 2pac from sideshow so I'm basically going to end up with another Hulk to get my banner and now I have an alternate head sculpt that will go along well with that are there Hulk and make me feel a lot better about ordering that 2pac when I really didn't have to one of the things I have to gripe about is I don't know if you can see it here in the video but there's this glassy spray to it that I guess used to emulate beads of sweat I don't really care for that also the hair has that sort of gloss coat on it making it a little more shiny it's not as apparent here probably in the video but in hand you can tell it's a lot more glossy so I'm probably gonna customize it a bit and spray a little dull coat on it to give it a more flat or matte finish probably a little bit on the face Joe I don't really care for that sweaty look so I'm gonna dull it down a tad another thing is the ball joint that it comes with I think it's the right size but it's not quite long enough so I'm having a little trouble you know having it snap in place I don't know if it's just mine or they're all gonna be that way but it's not quite snappy in place and I don't want to shove it down too much but if you just push it down it rests pretty nicely on the neck there you just you know really can't pick up the figure by the head like you can with the original hot toy sculpt so there's another view let me pan back to give you guys a look the whole figure with a head sculpt again there's the original packaging by Hot Toys and if you don't have the figure it was within this foam cradle plastic cover there comes with extra hands again if you don't know you're not familiar the hands are bendable at least the fingers are so you can manipulate the hands you have two pairs of open hands and then the two fists that you can pop off so there you have it guys you can find on eBay right now it's available for around 60 65 bucks don't know how long it's going to be there so if you watch this video two years from now in the year 2016 who knows if the head will still be around but as of now 2014 the head sculpt is available and it's up to you if you want to pick it up or not I dig it I think it's cool not too bad if you want to alternate look for your Hulk there you have it guys take care I got to get back to my cleaning keep on collecting bye bye", "0b3lDhYsf-U": "I'm below [Music] I am Iron Man let's do it you shoot my guy and I'll blast him let's go", "JDIMUZQyZLI": "[Music] yo what's up youtube it's your boy medical mall cells i got another strain for you the black berry cheesecake fire so you already know it's early in the morning sun beaming you know i'm saying we're gonna get a roll of this we want you to load this all for you youtube it's on fire you know what i'm saying so keep hitting that l and keep hitting that bell stay high as hell let's get into this fire ass blackberry cheesecake fire brandon constrained busting in at t 31 you dig and it is an indica and i did a review on this before so this is the second review of the branding constraint and i got it kicking rolling up in the wood leaf wild berry i'm saying even though i need some more white brushes he sold out so i gotta deal with this so yeah man you already know keep subscribing man keep liking let's get over this [Music] [Music] and you know i've been smoking it but this is the blackberry cheesecake youtube oh yeah so i'm about to roll that up with their plant and there's an indica that's called branded cook now this is the blackberry cheesecake man you roll that up show you what that look like [Music] so that's definitely some fire flames purple exotic medical dispensary marijuana airplane my guys so i'm going to show you how this look this is the blackberry cheesecake kind of fluffy and dense and it snaps right apart so i'm gonna roll up while i break up it's early you know you've got the light on the refrigerators early so let me uh [Music] make a nice blunt real quick just get a load of that blackberry cheesecake that [ __ ] got [Music] diners everywhere in the know like a hybrid this is some flames definitely 93 man foreign [Music] how to roll this up there's some flames [Music] [Music] even the little ones purple all right so my newbies out there you know showing one more time how to finish with one hand crush twist look at that i don't smoke the earth if it ain't purple or blue this one got green in it yeah so y'all do that right there you know showing my new viewers how to roll a little wood up real quick let me get right into it show you what it tastes like the smell and how the high feel you know i'm saying this your boy a great one crystals get high so i hope you're rolling your blood up too man it's the weed show don't watch me watch tv so that's a nice blunt you know i'm done i got a little piece left so i'm gonna mix this with some other [ __ ] see how fluffy it is quickly it's quick to snap apart but it's a dense string let's do that snap test johnny ding oh it is christmas out here youtube are you get that iced out baguettes bbs's no cuban links guys yeah so we're gonna hold this one up okay youtube that would leave is rolled sorry that wild berry about to smoke that blackberry cheesecake brandica kicking in that 31 where's my lighter at let's give me youtube [Music] let it burn number one man stay with you ain't smoking weed what the hell you doing [Music] it's your boy man keeping that l keep hitting that bell blackberry cheesecake fire getting the phone so yeah man my license card holders make sure you go get your hands on it man busting 31 percent blackberry cheesecake the branding it's your boys early in the morning can bait more fire reviews y'all uh [Music] see you next time more fire streams coming big woods stay tuned faded [Music] kind of dry but very dense i advise you go get your hands on it myself behave out there so this one i really a comment tell me what you think that's okay man playing tomorrow we review right now if you want to stay updated new medical dispensary is coming [Music] grow for good man [Applause] this [ __ ] boy [Music] sign then sign up make sure you go get your hands on your band oh yeah and by the way i transferred my weedlices to cure leaf they got way better prices more selections fire strings so go check it out arrow slash care leaf fire i was at something wellness [ __ ] changed fast so yeah that new video coming to show you how to transfer your medical license to another dispensary will benefit you with better prices and more selections and varieties of marijuana medical strains so stay tuned that new video is coming y'all so if you wanna know hit that like hit that subscribe button [Music] man yeah man it's way better i already went i'm already smoking it and i want you to go try it yourself how to get away license part two about the drop as well so you know what's in this bag already those are updates sneak peeks so i'm already ready yeah keep it for you youtube yeah so like subscribe nobody see you next time that blackberry cheesecake awesome man go get your hands on it is that cheesecake blackberry buzz", "mAgDcz8UbI4": "[Music] [Applause] yes we want to burn wannabe wrong lane cones let's try this out and see how it works so I've already bought a couple of these before the one thing I do know is they are tough to kind of stuff this piece of called what actually came with the pack and he spread the weed out on here and stuff it I've had mixed results with this I actually bought this comes with the stick and the scrape card it was that another one that's a little harder but we're gonna go ahead and load this bad boy up now I do like the fact that they have no run technology in the paper so it burns evenly but uh seems to take quite a bit to fill them up and it takes quite a while to fill it up actually and don't know a lot of weed out trying to get this motor filled up but luckily I do have the loader if you slide it down and I'll go to the paper that it came with also and try and load it but uh I like the fact that they have a filter on it and the only thing I don't like is the filters a lot longer than the one and a quarter so it seems like you're missing a boat four or five extra pulls just as filters so that's one thing I took not away but it is uh unrefined paper I'm very clean so that is a definite pro any times it looks Hampton technique tapping technique as your example eight down and these stick on you that has two whips actually the skinny side for pokin and once it gets a little more load of this more round and sad sweat this actually has kind of like a point to it I guess so to speak a dull point it doesn't sometimes it goes over the top of the paper as well it doesn't slow down this little chute evenly so this is a device they made so I can only imagine not having anything how difficult it must be to use one of these was gonna say roll but I guess it would be more stuff that's making quite a bit of time all right going on with you usually I like rats and pretty much to the point [Music] so we still got quite a bit of ways to go as much as we've been stuffing all weight stuff on our little hearts out I was a bit too much but I guess that's the waiter both grumble I intended I actually like these a little bit better than the only one and a quarter just for the fact you don't have to stuff so much into it if it wasn't for that Philip I love you auntie powder now you just better keep attracting this until you've stopped it as much as you're going to so I forgot our limit once we get here and up because it's barely twisting after Dan so I've maximized it there we go to raw lean as I said think the filter should be it's it's a bit shorter like the normal ones you get about four or five extra poles to enjoy I am", "G6kz9ZzSz1U": "[Music] foreign [Music] [Applause] [Music] [Music] [Music] so [Music] so [Applause] [Applause] [Music] [Applause] so [Music] so so [Music] so [Music] [Applause] [Music] [Applause] foreign [Music] you", "gWPLnATICbQ": "hello rso sos here and i've gone all the way to butlands i wish i could smoke like this all the time all the [ __ ] time just smash through that [ __ ] ball and it granddaddy's going there now you what's up oh see this one this was the one that had granddaddies how [ __ ] is stone i am yeah i can't keep it it must take every day these these are glass tips these glasses they're cannons honestly he's a far boss proper [ __ ] lovely"}