{"S39gtVWxFyQ": "[Music] so we're only have seven grams here of this we're gonna put it in 14 gram bag it's 160 micron we're going to a bottle textile on here which is on the front here so we're gonna get a 14 gram bag one of them we have our temp set where we want it for the strand we have our target psi right under thousand there and our timer set to 105 okay so we're gonna go ahead and put that in this [Music] I bet we got about 2 grams out of that it looks like to be a high 20% yielder and the color couldn't get any better and they're here the after puck of the 14 gram bags see how clean it's really virtually non sticky see all the rosin has run directly off of it you can see that the whole round circle here is about six millimeters larger than the actual puck all the way around this is where it pressed away from the puck [Music]", "D-JEa2jz0xI": "- Currently, there's a\nvehicle parked down here at the dead end. The caller says there's\ntwo people inside of it. It is close to a public trail,\nso not really an odd spot for a car to be parked. But if there's people in it and\nnot moving, then it kind of is. [music playing] - 654, I'm out. Wo ho! Slightly high. Hi. What's going on? Just chilling? OK. Do you know where you're at? OK. How much have you\nhad to smoke today? How much marijuana\nhave you smoked? No, him. I'm talking to you. OK, how long ago was that? OK. Did you guys smoke\nit all already? OK. Can you hop out\nof the car for me? 54-33, do you want\nto come over here? All right, man,\ndo you have any-- you got anything illegal on you? Don't reach. OK. I'm just asking\nyou a question, OK? No drugs or anything? All right, turn around for me. Put your hands on top the car. Keep your hands up\nfor me, OK, ma'am? Do you see that your car\nis still smoking actively? Were you guys hot\nboxing or what? OK. How long have you been here? The caller said they'd been\nhere for over two hours. There was still smoke\ncoming out of the car. Yeah, people parked\nout here, usually, they're smoking or poking. So and when I turned\nmy light onto you, I immediately knew\nit was smoking. I'm sure you've seen some\nmemes online about high people. And you looked\nexactly like them. - [laughter] - If I had a camera-- - [inaudible] - Yeah, front page\nof Reddit for sure. So they said they smoked it all. But, clearly, they did not. All right, so you told\nme you smoked it all. What about the, uh, 8 grams\nin the bag that was sitting in the center console? So you just forget\nabout 8 grams. Is it cause you're so\nhigh that you forgot, or-- OK. Here's our next dilemma. How are we getting home? Do you have a phone\nyou can call people? Because that car's\ngetting towed. And I'm not going to leave\nit here because then you'll walk back and drive it high. The female was let go because\nshe didn't claim possession of any of it. The male was issued a citation\nand released on scene.", "9mv-h3WZT4Q": "we're excited to announce the automated pressure control system which almost fully automates your rasen pressing process this is available as an upgrade to any existing Pikes Peak or long speak Rossum press push the buttons walk away and the machine does the rest for you [Music] with the automated pressure control system you can set your material type and your bag size and then load up your bag [Music] [Music] [Music] with peer pressure's automated pressure control system you can warm up your bubble hash while applying zero pressure this enables you to get the full yield after the fact and ensure that you never blow out a bag [Music] [Music] [Music] with the ability to increase in pressure one PSI at a time completely on the digital readout or to run a recipe that will do everything for you our system enables you to get everything that you need [Music] [Music] [Music] [Music] [Music]", "Ra6Dn9tq7ks": "[Music] hey guys what's up welcome back so here we are today we have a fantastic video planned for you and I know this because it was one of the most watched videos on my original channel and is above and beyond by far the most requested to be re uploaded here on the new channel but instead of doing that we're gonna clean up a few of the little mistakes that were in the first video and just make it a little better and we're just gonna make a whole new video so before I go any further I'm making this video for educational documentary and safety purposes only I do not support promote condone or glorify any dangerous or illegal activities be smart about this guys this is simply a PID controlled heated plate system nothing more nothing less so again this is well within YouTube's Community Guidelines and does not glorify promote condone or support dangerous or illegal activities so the DIY PID heated plate system we all know that most of the confusion is wiring the whole thing up with the PID so if you're just here for that look in the table of contents at the very beginning of this and this will give you a timestamp to that point otherwise let me go over the components real quick what they are what they do kind of how they their job and also how to search for them because I'm gonna give you Amazon links to everything you see here will have an Amazon link even specific drill bits and taps if you don't have that stuff already but if an Amazon link goes out I want you to understand what this actually is so you can search for it on your own or something along those lines so not any further let's let's get into the components here what this consists of mostly is the PID the relay the thermocouple heaters aluminium plates a mounting system and a box to put it all into as well as some wires connectors and m5 screws and some really basic stuff again so everything will be down below the main component itself is the PID this is the brains of the operation this is what's going to control power to and from the heaters to turn them on and off to then heat the plate steers at higher temperature so this guy control your temperature and basically again be the brains of it it's gonna do that in tandem with two things that are supplied in the kit that I have here this is an Inc bird 106 ITC 106 VH and this is basically good for US and European it does a hundred to two hundred fifty volts very common very easy to work with anyway it comes in a package with a thermocouple ready wired up already has your terminal connectors and a quarter twenty screw end that we will put into the plate side as well as it comes with a 40 amp relay now you can use the 25 amp relay and save yourself five bucks but yeah it really doesn't matter things are so cheap and either way it's well within it and this is what's gonna actually cut the power according to the PIDs signal now again I believe most the confusion of the build will come from wiring that up even though it is very simple we'll go over that next down the line is the heaters now these are the these are and were the most challenging to obtain in the original build and that's because they come from China these are called cartridge heaters now that term cartridge heater is what you guys need to know when these links go out of stock or I miss some or this or that so this specifically is a hundred watt AC cartridge heater so that means it's going to use AC or alternate current power which is what you have in your walls and it's going to use about a hundred watts of 100 watts which is 100 watts of heat in this case so if you can't find this specific one they make 120 watt ones they make 200 watt once they make 40 watt ones they make 80 watt ones they'll all work but I'm specifically recommending the hundred watt ones for the ease and compared to the original build I believe people are stocking these stateside now and we will be able to get them much quicker so anyway very simple cartridge heater cartridge heater is your search term and that's what's going to get you to the right product so next we have the plates themselves now these are the these are the bronze of the build the PID was the brain these are the well I guess technically the presses but this is what's going to be heating up and actually applying pressure to whatever you have under here so what these are are these are three by five plates now on the original one I did a big 6 by 6 plate build and you can still do something like this this build will still work it actually the plate size is more or less irrelevant at this point what you're going to be searching for is bar stock aluminum and again this is a three a three inch by one inch by five inch long profile so when you're searching for a loom aluminum bar stock online eBay Amazon whatever it may be what you're actually searching for is this width and height so again this is one inch by three inch and then I have it in a five inch long segment here and I have two of these now the links I provide you to Amazon or to a supplier named stoner metals he has some really good profiles available both 3x5 style and bigger five by five six by six style usually impairs fantastic shipping I got these plates these ones like two years ago for like 18 or fourteen dollars shipped and I got my big 6x6 ones for under $30 shipped to my door so I really support him and his his little thing anyway any aluminum bar stock that fits your your needs or your profile will work now with these plates also comes a little bit of machining we have to machine some holes in here for the heaters to slide in we have to put a ground and we often the thermocouple spot right in the center there so we can know the temperature of the plates now this is very simple I'm not here to show you how to drill and tap but I highly suggest you have a drill press for this though it can be done with a hand drill it's not ideal and for this build I'm going to be using four heaters two in each plate and what that's gonna do is that's essentially going to guarantee me a very quick heat up time with the first six by six build it was a little slow combining one heater and massive plates now we're completing two heaters into smaller plates I've already tested this the heat up time is like two minutes it's awesome now to mount this to the press we've done the same thing as we did in the old build and this is the floor flange this is a one and one and one quarter inch floor flange for plumbing um it may look a little more familiar to you guys with the wings on the side here it's a nice circular floor flange what I did is because you have to get the one and a quarter to make it go over most sized Rams check you might be able to get away with one but nonetheless it's wider than these narrow plates you see this this half would hang off here which is totally fine if you don't want to dine this off you can leave it on there it's just aesthetics at that point on two screws is more than enough so anyway I marked it cut it off so it fits on top of the plate really really nice two screws m5s to mount them on there very simple very easy and it goes I'm very quick the last part is we have to set the set screws and this is what actually kind of pinches the RAM and holds it still in the first build I had a collar that went up and you can see it was kind of big and bulky well we don't necessarily need this extension and we drilled right through the collar that's already built in on the floor flange and it worked fantastic m5 screws right through there again I used a drill press but be careful if you're not and five pinched in there very nice last of the major components of the build is this project box and this is in the first build I used a basic junction box from Home Depot anything that's gonna clean up your build flow work even if you had a wood box there's nothing of temperature or anything as long as your connections are good you can make a wood box but this is a ABS plastic project box from bud Industries is very cheap it was like seven or eight dollars shipped perfect size really cleans up the build and all we had to do was machine a forty seven millimeter by forty seven millimeter square so the PID can slide right up in there just like so and then two holes on the back so we can have power come into this box and then power go out of this box to the plates that's it and it closes out very nicely and in the end will look very good next to your plates so in the end you should have a system that looks somewhat like this very clean ready to go and mount on to any press system that you have for a build like this I suggest six tons to twelve tons you don't need definitely don't need more than the 12-time but if it's a cheap twelve ton press it's probably really around ten or eight so you get the picture anyways six to twelve tons for this build the most you're gonna need you have bigger plates you can go twelve to twenty you have smaller plates and go less you get the picture lastly there are some key components here we have sixteen you can get away with eighteen but a 16-gauge power cord one or two of them works fantastic once you can actually just bring in power from the wall very simply to your box and then another one so you can actually connect the plates from the box that do carry power with a nice jacket instead of just running wires you can run a jacketed power cord that's a little more protected so you have to go buy any extra sheeting or anything like that and if you're really in a pinch you can take one eight foot power cord and cut it in half and you have a four foot power cord and a four foot extension a little jacketed extension run there last couple little components here we have some peach I believe these are PG 11s yes PG 11 gland connector or cable gland connectors only need two of them very simple and then we're gonna need a handful I believe it's five or six I use WAGO connectors but you can use a wire nut you can use any kind of quick connector wire connector or you can solder but anyway if we're gonna need about six of them I'm gonna recommend the three packs they work very very well but if you happen to have like a variety pack with the five packs for the twos they were will work for somebody you need a lot of more threes than anything without further ado let's get into the wiring let's talk about the schematic the wiring and then we will I'm going to do it all for you outside right out here in the open and then we're gonna do it you're gonna watch me shove it in the box because it's hard to show you shoving it in the box because there's that that technique of shoving it in the box you got to make it fit and that parts not pretty but we will show you up show you in a nice open space where all the wires go explain the diagram let's get into this okay guys so let's wire this up let me talk about the wiring real quick that will actually wire it up so what we are looking at here is one of my beautiful diagrams if you would rather look at the instructional version it'll get you to the same place so go ahead and the instruction version I believe it's on page 4 the instructions looks like this right here or if you forget that one you can turn your PID sideways and the 106 VH has it right there on the side all the terminals that are gonna get connected and what they are but lucky for you guys you have me and I have created this beautiful drawing see there's a lot of colors I think you want may understand what's actually here but these wires are what obviously are confusing so before we go too far let's actually check out what the wire what the colors of these wires represent what they're doing and kind of where they come from on this diagram so we have both AC and DC current going on in this setup it is mostly AC there's only a little bit of DC but here's how they're all represented the black solid lines the big black solid lines will be the AC hot and that's going to correspond to when we actually do get our power cords we have a black wire that is our AC hot now the next one is in silver because we're on white paper this is actually gonna represent our white wire being our AC neutral and you can see the third one here green is ground whether we're on DC AC doesn't matter green or yellow will always beat your ground and they can be the same after that we're gonna have a little bit of a DC like I said we only have a little DC action and that's represented by some dotted lines and we're gonna use red and blue so we don't confuse the black that's AC hot so dotted red is DC positive dotted blue DC negative and like I said green ground is always going to be ground whether we're grounding a DC connection an AC connection it is always grant and lastly I have the thermocouple as a blue and red combined little solid line and that's because right here the thermocouple comes as one piece it is only at the last two and a half inches here that it splits off into its positive and negative and they clearly it comes clearly marked as blue and red so when we get to that it'll be very very clear so is why the thermocouple itself is a little different because it's technically DC but it's generating its own current so and as you can see has everything that it's going to go on we got the PID up here got the relay here got the plates here got thermocouple and some wiring in here we have cable glands essentially coming into the box here so this is the full set up bam bam what the hell's actually going on right so it all starts with this all starts with the PID and the entire premise of the whole the whole operation is on the back of the PID and as you can see right here you got some screw terminals you've got one two three four five six seven eight nine ten you got eleven and twelve up the gut but those aren't even used so don't worry about it but that obviously correlates very nicely to my drawings of the PID so one two three four five six seven eight nine ten one two three four five six seven eight nine ten and as you can see from this overhead view we have Liars coming in and out of it let's explain that so all these are as screw terminals you unscrew them you put your wire or your connector on there screw it down it's tight good to go okay so we're only going to be using six out of those ten or actually technically twelve but six out of the twelve screw terminals on the back of the PID here we're gonna be using numbers three and four for the thermocouple three for the negative of the thermocouple four for the positive of the thermocouple when you're using terminals six and eight six for the negative DC to the relay and eight for the positive DC to the relay and lastly is numbers nine and ten nine we're going to use neutral alternating current and ten is going to be the hot from the alternating current so this nine and ten this is your power from the wall if that's the the easiest way to to realize what AC power is just the power from the wall that's cool how about we we wire it all up so start off I got the P you sit in there we got the relay sitting right here we have power coming into the box right here and we have connectors on it ready to go and then we will deal with the power out in just a second so just as the diagram goes let's start with the easy one so you kind of guys see you guys kind of get the hang of it and that's what the thermocouple see it's all one wire except for the very end it breaks out and just as I told you we have negative or blue going to Terminal three we will put them in and screw it down and then we have positive coming out to Terminal four so let's get that under the terminal connector there and screw it down secure so now just like the drawing shows wires three and four blue and red coming out the side the actual PID has wires three and four and blue and red coming off the side let's just do the same for the rest of it the negative DC goes to right underneath sometimes it's easier to turn it upside down so screw terminal falls push the wire in secure it down same for getting a positive DC and while we're at it let's just connect these two you can see on the diagram we have six going to terminal six of the PID going to terminal 4 or negative of the relay and eight going to three let's do that right now take your black go to terminal 4 of the relay screw it down nice and secure take six or excuse me take eight or your positive from be PID and do it to the positive of the relay nice now we're really moving along guys we got the thermocouple connected and we have the relay connected to the PID lastly we're gonna need to get power from this wall plug power here see the other end of it's at the wall comes out wall plug power here when you get power from here to the PID and we're we are going to do that with a black and white wire going from its corresponding power to be correct terminals so for the black wire which is the hot or the the actual power wire here that is going to go to number 10 technically the polarity of this alternating does not matter because for you guys in Europe you have 240 volts and this works for that as well too but for the sake of sanity here let's mmm keep it consistent because what we do run through the relay is going to matter so the neutral AC wire or the white wire is going to run to Terminal nine so now just like we did we have a white a black and a green we're gonna connect the black from terminal nine to the black from the wall connected and secured we're gonna connect the white from terminal nine to the white coming in from the wall power in secure very nice very easy well the next step now is we need to get power running out of this box and we're going to do that you could easily do that by just linking from these open connectors straight over to your the power cord jumper coming in and that's what we're gonna do for most of it except for the hot wire so before we go any further let's just do that we're gonna take the AC going out or the power out to the plates and we're connected to the white of the power in directly BAM and we are going to connect the grounds together now this is green to green and the only connection now the last link between power going power coming in from the wall and power going out to the plates is this hot line and this is where the real a comes in the relay is going to interrupt coming from power in to power out so we're going to do that by connecting from power in so power in right here we have this terminal it's going connect connect to the relay they can connect anywhere can connect to two or terminal one doesn't matter that's going to connect to Terminal four now in my drawing Terminal two so now we have power coming in and it goes to the PID but it also takes a stop here the hot line takes a stop here at the relay now we not take the oh the last open terminal here have the last open terminal on the relay terminal one we're gonna put a wire from here sure and this goes to from the relay all the way to power going out to the plates so now we have a full connection within the relay we have DC power signaling it when to turn on and off and we have the actual power break down below now guys we are to the point that all of this would be inside of this box and at this point only tooth well two things are gonna come out that'll be our two cable glands and one is our power going into it it's actually not coming out is going in and that's right here this goes in and stays there well coming out is obviously the AC power but in addition to that we are going to buddy it up you can go ahead and unwrap your thermocouple now and this is going to run out the back of the plates as well so from here on the thermocouple lot once it reaches outside the box the thermocouple line and the jacketed extension carrying alternating current power to your plates can be looked at at one wire or package of liars okay so this is all inside the box like here we have everything hooked up we have our power coming in you can see this nice little stubby just for demonstration so you see this is would be from the wall going in and like I just talked about you can consider what's coming out as one set of wires because out of this cable gland we have the jacket extension and the thermocouple coming out one so they will both run to the plates and at the other end of them you have the thermocouple quarter-twenty screw that's ready to go into your plates and you have the three wires of the jacketed extension exposed again black for hot white for neutral green for ground so we can set this off to the side now save that for the last connection and what we're gonna move on to is the plates and you can see a little demonstration here but I'd rather I'll just show you so what we have here are the four heater holes you can see these four main holes one two three four so two on each plate are the heater holes that's gonna be done with the twenty one sixty four-bit just bored in there no threads no nothing so that's that's really nice and easy because the heaters just drop in if you want to use a little bit of paste at thermal paste or anything at the very tip to just kind of give it a little suction they can but these should be securely in there really aren't gonna go anywhere once you get your your press and plate system mounted up nicely so we have the top plate we have the bottom plate the center hole what you're looking at here in the top plate because you only need it on one plate because we only have one PID system here is the thermocouple and the reason we're gonna do it on the top plate is because heat rises so this is gonna be the hottest point if we put the the temperature at the hottest point you know anything that's below it should kind of err on the lower side so say you set it to say 200 degrees you know maybe the bottom plates not a perfect 200 degrees but it's like a 190 195 that's a better error than being hotter than you anticipate it for the non measured plate so the thermocouple that's pretty simple as well - that is literally just a screw right in and make sure you torque it down just nice and tight unless you have a a blind tap that bores all the way down you're not gonna get it perfectly flush so this is where I suggest just a little bit of thermal grease or thermal compound in the bottom of the hole so there's no air pocket down there and the temperature matching will be as accurate as possible then lastly what we have is the ground and this is what's gonna make sure that if anything were to happen if any short or anything were to you know arc or anything this is gonna run back trip your circuit breaker and everything's going to be just fine so what I have is I have two green wires here and I put terminal connectors on them you don't have to you can just kind of wrap the wire around the screw but terminal connectors make it obviously cleaner in a little a little nicer these are just getting screwed right into the plates so I have some m5 screws that we've gotten ready here and these will get terminal connected right under there now this is a step I believe some of you guys may try to skip technically the press will work just fine without it but this is a safety step so I suggest you do it and do it correctly so all this is doing again is making sure that if there were any short or anything this would run back and rip your circuit breaker so so now we need to hook up the the wires in so what you'll notice here is there are two wires coming out of each heater ones gonna act as a hot and one is going to act as a neutral now there's no indication it does not matter you could switch these at any point and it's still gonna run fine it's just a resistance heater in there so we're just gonna grab them randomly and so for the top and bottom plate gonna take two wires just grab two wires give them a little twist together and we are gonna put them inside one terminal so one terminal two wires going into one terminal of this way go three connector now if you have a way go five connector for this multi heater build here would be ideal but just double-check that both wires are securely in that Wego terminal you're good to go now take two random wires from the top plate or the bottom plate excuse me the other plate whichever the other plate and do the same thing and insert that into the next one on that same connector again double-check that they're secure by tugging on each wire so now we have four wires connected to this this one way go one from each heater that leaves four wires left out for wires remaining and we're gonna do the same thing but to a separate connector so start with I suggest when you're twisting them twist them from the same plate that way we can separate them later so take the two that are on the top plate here twist them together just a slight twist we'll put them both into their single terminal of the way go and again make sure they're secure and now we'll take the remaining wires from the top plate and do the same thing so we're gonna twist it together right here and stick it in the remaining or itten in the center there's actually two remaining excuse me again always check to make sure this is secure because this is AC power this is where we want to be safe so if you have the juego fives use them here anyway now we have one more to do we're gonna take these grounds and we're gonna connect these two grounds together with a juego three as well okay so now what we're looking at here thank you that in your view a little bit more is we have three juego connectors here which correspond beautifully to the three ends of your jacketed extension so we've already put the thermocouple into the heater plate again make sure that's nice and tight and has a little bit of thermal grease to help it securely in now at this point we are just going going to connect the power out these three terminals to their corresponding connector now like I just said the polarity here doesn't necessarily matter because we've connected one of each heater together and one of each heater together here so whichever one we decide is hot or neutral that's going to be it it doesn't necessarily matter but the obvious one here is green to green ground so this is what makes the connection so we have both plates grounded which will also ground your press and anything else touching to it we have that grounded and then the last thing we're gonna do is take will designate this one the neutral here this group will be the neutral so we will connect it to the last remaining open way go make sure that's nice and secure and then our hot make sure she's twisted up nice and into the last remaining way go so three-way goes three wires in our jacketed extension power out so the last thing we're gonna do is we just have to put the flange on here this is the floor flange that we built already we've put our m5 set screws right through the side bore holes here so m5 set screw right there through the side and then we've already tapped the top of the plates to the corresponding holes right there easy as it gets this is kind of the last step formality if you guys didn't realize this needed to happen this needs to happen and wha-la that is securely on now let's go mount it to a press so I can show you how it works actually let me get this stubby out of here get this ready to show you guys mount it up plug it in is we just have to put the flange on here this is the floor flange that we built already we've put our m5 set screws right through the side bore holes here so m5 set screw right there through the side and then we've already tapped the top of the plates to the corresponding holes right there easy as it gets this is kind of the last step formality if you guys didn't realize this need to happen this needs to happen and voila that is securely on now let's go mount it to a press so I can show you how it works actually let me get this stubby out of here get this ready to show you guys mount it up plug it in and just verify she's working it will work through anything here we have the plate system sitting here ready to go we have not plugged it in yet because before we do I want to go back into the box you have the box we have our power coming in going to where it needs to go signals everything's there you can secure it the relay down with a little bit of thermal epoxy or you can use some very short screws or you know dremel or grind off the back of the screws if they do go through the project box but just secure it down so it doesn't move around and the one key thing we need to do in here is I want to put some electrical tape over these contacts you have these exposed down here these are what we go on to cover so we're gonna take a strip of electrical tape and we're gonna go right over both of these just to insulate them electrically so that way anything rattling around in here won't have any issues so now you can see just got some electrical tape over the connectors here are the terminals here and here for both the AC and the DC the AC is your main concern there you don't want this thermocouple sheathing touching that in any way but the DC side you also don't word out over there and there so we have everything completed ready to go ready to plug it in let's mount it to the press and then we'll plug it in let it start heating up double-check our temperatures make sure things are good so as you can see it's sitting here this is pretty much everything the press comes with I mentioned before anything from 6 to 12 tons will do you're right for this build the more you want to spend on your press to get things like pressure gauges other things like that that's up to you pneumatic doesn't matter but anywhere from 6 to 12 tons with this size plate will get the job done bigger plates more pressure or towards the upper end of this range smaller plates less pressure towards the lower end of this range now the mounting system here it's basically most presses come with these these steel blocks these are great but the one issue we have with any press and any heated plate system is these get hot and we don't want the press to get hot so we need to insulate the plate somehow now there's two points of contact from the plates to the press and that's the bottom plate and it's the top plate to the RAM the bottom plate gets the most contact it pretty much will sit on whatever you put it so what I use here it's just wood most of the time I'm pressing or using this heated plate system under 200 degrees at most 220 and I haven't gone that hot in a long time so a piece of wood here I have a just a little I don't know what this was at the time maybe maybe a little more than 1/4 3/8 piece of plywood or so and it's obviously gotten a little darker and you know be careful we use some kind of insulating material based on your pressing temperatures so I'm kind of silicone pad many of things anyway the bottom plates like I said the biggest contact points also the easiest to insulate the top plate is a little interesting and I don't actually have an insulated now I have too much issue with it but ideally if there was a little silicone pad or something we could slide down right into this into here where the Rams gonna sit that would be our our ultimate line of insulation but as long as you get the bottom and you you press your material quick don't leave all day turn it off you know you should be good to go so no further ado let's get this get this press mounted that all we need to do is when you need to align the plates where they need to go then we're gonna bring the press system down so now we have the press system down the RAM the plates everything's touching the steak yeah I can't move the plates so you don't need to kill pressure you don't need to squeeze it like you're pressing the biggest thing in the world you just want the plates flush and to know where they're flat and at that point we can start tightening the set screws and now I use a hex hex or allen wrench screws for these just because you know when you're torquing something against anything a little more secure but if you if you just happen to use your Phillips or whatever it doesn't doesn't particularly matter but we're just pinching the RAM that's all we're doing we're just pinching the ram and the fact that it's already pressed press down in there so nicely it's nice and sick here now watch we're gonna release pressure and the plate will come right up damn so perfecto I guess it's time to see if all our wiring was correct and plugged this baby in look at that fires right up apparently it's 80 degrees in here already so what you have here on your PID display is you have in green underneath that's your target temperature all you need to do is use the up arrows and down arrows to get to the desired temperature and then press set and at that point any time you unplug or replug in your machine or turn it on or off it'll go back to that setting now you don't need one of the biggest questions I get asked is do I need to program it what settings do I use if you get the ink bird the 106 that I showed you it comes preset and most ink bird pids do and you don't need to mess with any of the settings if you want to get really complicated with your with your overshoot and undershoot you're one of those professionals you probably don't even need me for this video if you if you really need to tweak with your settings the standard PID settings are really really accurate work very very well so the last thing I wanna do is when we're not using the system or when it's heating up I want to to have the plates resting against each other that way the thermocouple well how it works is this plate will interact and these will reach an equilibrium and that'll give the thermocouple the most accurate representation of what's going on because again we're only using 1 PID here see the plates are heating up very very quickly that's that's the whole idea of this double heater per plate system we have almost instantaneous heat up it has been less than 2 minutes and we're already at 160 360 for climbing very very fastly so with a system that heats up this quickly we're gonna want to give it just a little bit of time once it does reach temperature to kind of find some equilibrium get to that true temperature but nonetheless look at this baby go flying plates been sitting here heating up doing their thing really just staying at temperature for the last 15 minutes or so so giving them time to kind of hit an equally equally briam there and you can see I have it at 180 point 5 degrees here for my desired temperature and it is like bouncing right up and on that perfectly for the what the thermocouple of the PID is saying and I can tell you by my hands it's pretty it's pretty hot but to be even more accurate I have a secondary thermocouple hooked up here and this is hooked up in the back right basically where a ground would go and one of those holes I had to I'd kind of accidentally put an extra hole in there so we have the thermocouple back in there and this is an unjacketed thermocouple so it's just raw through my couple inside a hole and it's reading a hundred and eighty-five hundred and eighty-six with just under there and so that's basically it's about a five or six degree difference between what I'm seeing here to what's actually going on and that's pretty good you know we're not going to be perfect and like I said maybe there's an air pocket if we could get our taps or our threads down farther we could get that thermocouple to pinch up the metal itself I just didn't quite have the correct tap to do it I guess but nonetheless fairly accurate here we can totally work with this so for me I know I have about a five to six degree difference so if I want to press at 195 I'll press I'll set my temperature to 190 but that's about that's really it we have we have nothing left to do then retire this and what you're looking at here is a completely functional PID controlled heated plate system so whatever you want to use it for go ahead and do that but thank you guys for falling along like I said I know this was one of the most requested videos to be made or re-uploaded or every so I hope this answers all your questions get you guys back on track for your builds for your references whatever you need this for that's what it's here for so thank you guys for supporting me following the channel if you're not following the channel go ahead and give it a fall give this video life really appreciate it helps it on it helps it along we've we've come back a long way since getting deleted originally but we will continue to produce fantastic safe videos over and over and over again so thank you guys peace [Music] [Music]"}