{"nmoixthgqxA": "I was good YouTube this came from the cannabis club today got me someone's breath filling real Bob Marley ish today I mean so about a toke up these lands breath just wanted to show you guys and I'm about to make another video in a second about some granddaddy purple not really no granddaddy purple they just put a name money you know how they do sometimes it's all good though check it out", "IYWbhOr8SXQ": "so I just got off of work stopped by this gas station and I'm gonna go buy my first pack of cigarettes ever so see how this goes honestly this is probably a shady idea never had a package to get ever had a cigarette before never bought a pack of cigarettes before I've never had a cigarette I've never really knew that I've like smoked a cigar so I can't really see how it's any far off but we'll see I'm gonna go in here five pack of cigarettes and let's see what all this what all these people are dying over you know I got next to me I'm looking at like four people smoking cigs right now it's crazy all right well see ya after I get out of store all right so I just got out I got the American spirits and the light this [ __ ] like came out to ten dollars for both of these [ __ ] like I don't see how people can afford this like I could buy a [ __ ] good meal for that addictive free tobacco I don't know I bought it because of the packaging you know packaging cells you know I was just like those yellow ones look sick so I got those so yeah that's uh one of these babies up I'll do a spike actually - station all right so I'm here started to rain a little bit traffic's picking up so I got these man I don't know all right I know which once again so I just got those yeah I didn't know if any taste better meaning I'm sure you're gonna [ __ ] taste like [ __ ] it's kind of what I figure well now they are [ __ ] cancer sticks God like I've never smoked a cigarette and I hate him like I hate him like they just smell nasty but I'm a firm believer of don't bash it till you try it you know so uh [ __ ] it's like sludge down my seat well yeah dude I can't believe a pack of signal lighter it was like $9.33 like it $10 oh my god I could eat at like McDonald's twice for that much dude well alright well sometimes a cancer oh what the [ __ ] there's a little cancer stick it's got like some [ __ ] on it man oh no man I how does that work and I was just like let's try a cigarette how the cool people do it well some metaphor yeah I don't know that any of it but it tastes like [ __ ] [ __ ] that it tastes like [ __ ] there's like people getting me worried about oh yeah it won't be better it's [ __ ] gross oh that's [ __ ] gross I don't understand it dude I really don't really do not understand like I guess it's just something you did get addicted to you know okay look that all right well first cigarette ever oh now I'm like buzz but it's like that's weird I'll taste it horrible I think I'm just gonna give this to somebody I guess just give it to like homeless guys oh man alright well I hope y'all enjoyed that probably not doing that again have a good one", "0O0yi8YgYbs": "Supreme, baby! I just bought a faux-fur\njacket for $1,000, so. People want to know, \"Hey, look, that guy's wearing Supreme.\" But people also make a\nliving off it too, so. Narrator: These two jackets\nare nearly identical, both made by The North Face, and both using Gore-Tex technology. This one on the left costs $300. The one on the right is currently\nselling for nearly $1,300. So what's the difference? This one just happens to be a North Face collaboration with Supreme. So why would someone pay\nnearly a thousand dollars more for basically the same jacket? And what is it that makes\nSupreme so expensive? From the eye-catching logo to\nthe limited product releases and artist collaborations,\nover the past 20 years, Supreme has transitioned from\na small skateboarding store in New York to a $1\nbillion streetwear company. But for its fans, Supreme\nis more than just a brand. It's often an obsession and an\nentire subculture of its own. Since its origin, Supreme has maintained an image of being authentic. Founded by James Jebbia in 1994, Supreme started as a skateboarding store in the SoHo neighborhood of Manhattan. The store started out selling\nhoodies and sweatshirts aimed towards the burgeoning\nNew York skate scene. Throughout the '90s and early 2000s, Supreme functioned as a skate brand catering to both skaters\nand those interested in the emerging streetwear style. But Supreme's limited\nreleases and attitude has pushed them far\nbeyond their beginnings. The most iconic Supreme\ndesign is their box logo, originally, simple white, italic lettering over a plain red background. This design so closely echoes the work of conceptual artist Barbara Kruger that it is hard not to\nsee it as a direct copy, and copyright theft is something\nthat's in Supreme's DNA. Supreme's appropriation of images is one of the keys to its popularity. Pop-cultural imagery and\nlogos are copied and adapted in a way that makes the designs feel more like contemporary\nart or graffiti than a big fashion brand. Supreme's first branded\nT-shirt was simply a photo of Robert De Niro in\nthe film \"Taxi Driver\" along with the iconic red-and-white logo. And the company's use of\noften unlicensed imagery has led to Supreme being\nserved cease-and-desist letters from Louis Vuitton, the NHL, and the NCAA. Dimitrios Tsivrikos: The more\nwe've been exposed to a brand, the more likely we are gonna\nbe developing an association, a familiarity, almost a\nsense of connection with it. With Supreme, there's\nno element of status, and they went completely for what a logo should be all about: standing\nout, being identifiable. Narrator: The recognizability is key to Supreme's power as a brand. But the items are also\npurposefully difficult to get ahold of, and\ntheir products are kept in high demand by very limited releases. Chris Magnaye: Tuesday at 11:00 a.m., you go to the Supreme website, you enter your basic information: your name, email, phone\nnumber, and credit-card number. Then, they'll send you\na text later in the day to let you know if you've been\nselected to stand in line. Then on Wednesday, they'll send you a text telling you the time\nand store to report to. And on Thursday, you go to the store at the time that you're given. There's a one-limit-per-style\nrule in Supreme, so what that means is,\nif a shirt comes out in black, red, and gray,\nyou can only get it in gray. So if I want it in black and red, I need to get two other\npeople to get it for me, so they need to stand in line for me. A lot of the people who do stand in line are standing in line for someone else. Narrator: Supreme only\nsells their merchandise at 11 brick-and-mortar\nstores across the world as well as their online store. It was around the mid to late 2000s that Supreme really\nstarted to pick up speed. This success was partly due to what's been dubbed the \"Kanye effect.\" In 2006, Supreme released\ntheir Supreme Blazer SB, a collaboration with Nike. The shoes retailed for around $150, with resale prices\nranging from $300 to $400. In July 2007, West was\npictured wearing the shoes at the Grammy Foundation's\nStarry Night party. After the photos were released, the resale price of the\nshoes doubled to $800. Similarly, the teal box-logo sweatshirt worn by Tyler, the Creator\nin his \"She\" music video, originally priced at around\n$150, sold for $3,500. But not everything from Supreme is gonna end up being valuable. Sellers like Chris have to decide what's going to be popular and what items will give\nthem the best return. Chris: So how I decide on\nwhat I think is gonna resell is based mainly on what I would wear. You can also go to these\nInstagram accounts, and they'll have Instagram\npolls, Twitter polls, talking about, oh, like\nyou can upvote this, you can downvote this, and\nit's this crowdsourcing tool to understand the market\nbetter and find out, oh, this one's gonna resell,\nor this one is really popular. The most money that I've\nmade off of one Supreme item is the 2017 fall/winter\ncollaboration with The North Face, and it was a mountain parka. I bought it for $398,\nand I sold it for $950. Narrator: This incredibly limited release means that buying and\nreselling Supreme items is where the real money is. When you look at the prices\nof Supreme items in-store, they aren't as outlandish\nas you may expect. They retail for around $38 for a T-shirt to $138 for a sweatshirt. But it's once these products have sold out that they can reach 30\ntimes their original price. Many other big brands are now adopting this method of very limited releases to generate hype around their products, from trainers to other streetwear brands. These releases make people feel like they're part of something exclusive. Dimitrios: The more we\nmake a consumer work for their particular access to a product, the more alluring these services\nand products are becoming. So I think Supreme know very\nwell how to make something incredibly accessible and sexy by allowing us to jump through\nas many hoops as possible to make it relevant for them. Narrator: But there's\nsomething about Supreme that's different. Could any other company get\naway with selling a brick or a branded crowbar? What is it that gives Supreme\nsuch a devoted following? I think it's the hype. They come out with really cool items. I personally feel like they do. It's a name brand, and name brands attract anybody at the end of the day. In New York especially,\nit's a lot of streetwear. So people want to have\nthose exclusive items. So I feel like Supreme, they\nkeep their quantities very low because of the high demand. People will pay that price\nif it's something they like. Supreme, I think the thing\nthat really causes people to spend money and wait in line is kind of the \"it factor\"\nthat it has, right? They've done an amazing\njob of limiting quantities and underproducing to the demand. So in that way, their market of people that would\nwant to buy the product isn't just people that are\ninterested in the product, but it's also people that are\ninterested in making money, and that demographic is\nway bigger than people that are just interested in streetwear. So when there's an\nopportunity to make money, then there's gonna be a huge\nline of people around the block regardless if they want to\nwear the product or not. Narrator: Supreme has\nmanaged to somehow keep their cool, alternative,\nand exclusive image despite their expansion\nand has still maintained its skater credentials despite selling a 50% stake in the brand\nto a private equity firm. With more and more people\nwanting their products, for now, it looks like\nSupreme isn't going anywhere."}